#ifndef UE4SS_SDK_ABP_Cat_New_HPP
#define UE4SS_SDK_ABP_Cat_New_HPP

class UABP_Cat_New_C : public UCatAnimInstance
{
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_111;                    // 0x0438 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_110;                    // 0x0460 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_109;                    // 0x0488 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_41;                               // 0x04B0 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_79;       // 0x0578 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_78;       // 0x0670 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_39;                    // 0x0768 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_108;                    // 0x0798 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_107;                    // 0x07C0 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_40;                               // 0x07E8 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_77;       // 0x08B0 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_76;       // 0x09A8 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_38;                    // 0x0AA0 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_106;                    // 0x0AD0 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_39;                               // 0x0AF8 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_75;       // 0x0BC0 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_74;       // 0x0CB8 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_37;                    // 0x0DB0 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_105;                    // 0x0DE0 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_38;                               // 0x0E08 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_73;       // 0x0ED0 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_72;       // 0x0FC8 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_36;                    // 0x10C0 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_104;                    // 0x10F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_103;                    // 0x1118 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_37;                               // 0x1140 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_71;       // 0x1208 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_70;       // 0x1300 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_35;                    // 0x13F8 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_102;                    // 0x1428 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_36;                               // 0x1450 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_69;       // 0x1518 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_68;       // 0x1610 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_34;                    // 0x1708 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_101;                    // 0x1738 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_35;                               // 0x1760 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_67;       // 0x1828 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_66;       // 0x1920 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_33;                    // 0x1A18 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_100;                    // 0x1A48 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_99;                     // 0x1A70 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_34;                               // 0x1A98 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_65;       // 0x1B60 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_64;       // 0x1C58 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_32;                    // 0x1D50 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_98;                     // 0x1D80 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_33;                               // 0x1DA8 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_63;       // 0x1E70 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_62;       // 0x1F68 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_31;                    // 0x2060 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_97;                     // 0x2090 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_32;                               // 0x20B8 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_61;       // 0x2180 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_60;       // 0x2278 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_30;                    // 0x2370 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_96;                     // 0x23A0 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_31;                               // 0x23C8 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_59;       // 0x2490 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_58;       // 0x2588 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_29;                    // 0x2680 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_95;                     // 0x26B0 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_30;                               // 0x26D8 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_57;       // 0x27A0 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_56;       // 0x2898 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_28;                    // 0x2990 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_94;                     // 0x29C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_93;                     // 0x29E8 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_29;                               // 0x2A10 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_55;       // 0x2AD8 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_54;       // 0x2BD0 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_27;                    // 0x2CC8 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_92;                     // 0x2CF8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_91;                     // 0x2D20 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_28;                               // 0x2D48 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_53;       // 0x2E10 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_52;       // 0x2F08 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_26;                    // 0x3000 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_90;                     // 0x3030 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_89;                     // 0x3058 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_88;                     // 0x3080 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_87;                     // 0x30A8 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_27;                               // 0x30D0 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_51;       // 0x3198 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_50;       // 0x3290 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_25;                    // 0x3388 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_86;                     // 0x33B8 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_26;                               // 0x33E0 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_49;       // 0x34A8 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_48;       // 0x35A0 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_24;                    // 0x3698 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_85;                     // 0x36C8 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_25;                               // 0x36F0 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_47;       // 0x37B8 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_46;       // 0x38B0 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_23;                    // 0x39A8 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84;                     // 0x39D8 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_24;                               // 0x3A00 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_45;       // 0x3AC8 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_44;       // 0x3BC0 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_22;                    // 0x3CB8 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_83;                     // 0x3CE8 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_23;                               // 0x3D10 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_43;       // 0x3DD8 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_42;       // 0x3ED0 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_21;                    // 0x3FC8 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_82;                     // 0x3FF8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_107;                        // 0x4020 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_69;                               // 0x40A0 (size: 0x30)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_22;                               // 0x40D0 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_41;       // 0x4198 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_40;       // 0x4290 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_20;                    // 0x4388 (size: 0x30)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_21;                               // 0x43B8 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_39;       // 0x4480 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_38;       // 0x4578 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_19;                    // 0x4670 (size: 0x30)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_20;                               // 0x46A0 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_37;       // 0x4768 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_36;       // 0x4860 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_18;                    // 0x4958 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_81;                     // 0x4988 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_19;                               // 0x49B0 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_35;       // 0x4A78 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_34;       // 0x4B70 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_17;                    // 0x4C68 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_80;                     // 0x4C98 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_106;                        // 0x4CC0 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_105;                        // 0x4D40 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_48;                       // 0x4DC0 (size: 0xA0)
    FAnimNode_StateResult AnimGraphNode_StateResult_68;                               // 0x4E60 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_104;                        // 0x4E90 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_103;                        // 0x4F10 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_47;                       // 0x4F90 (size: 0xA0)
    FAnimNode_StateResult AnimGraphNode_StateResult_67;                               // 0x5030 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_66;                               // 0x5060 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_14;                             // 0x5090 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_65;                               // 0x5140 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_102;                        // 0x5170 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_101;                        // 0x51F0 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_100;                        // 0x5270 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_99;                         // 0x52F0 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_46;                       // 0x5370 (size: 0xA0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_45;                       // 0x5410 (size: 0xA0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_44;                       // 0x54B0 (size: 0xA0)
    FAnimNode_StateResult AnimGraphNode_StateResult_64;                               // 0x5550 (size: 0x30)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5;                        // 0x5580 (size: 0xB0)
    FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph_1;                        // 0x5630 (size: 0xA0)
    FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph;                          // 0x56D0 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_98;                         // 0x5770 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_63;                               // 0x57F0 (size: 0x30)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_18;                               // 0x5820 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_33;       // 0x58E8 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_32;       // 0x59E0 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_16;                    // 0x5AD8 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79;                     // 0x5B08 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_17;                               // 0x5B30 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_31;       // 0x5BF8 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_30;       // 0x5CF0 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_15;                    // 0x5DE8 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78;                     // 0x5E18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77;                     // 0x5E40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76;                     // 0x5E68 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_97;                         // 0x5E90 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_62;                               // 0x5F10 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_96;                         // 0x5F40 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_61;                               // 0x5FC0 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_60;                               // 0x5FF0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_13;                             // 0x6020 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_59;                               // 0x60D0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_95;                         // 0x6100 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_58;                               // 0x6180 (size: 0x30)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_16;                               // 0x61B0 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_29;       // 0x6278 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_28;       // 0x6370 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_14;                    // 0x6468 (size: 0x30)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_15;                               // 0x6498 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_27;       // 0x6560 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_26;       // 0x6658 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_13;                    // 0x6750 (size: 0x30)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_14;                               // 0x6780 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_25;       // 0x6848 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_24;       // 0x6940 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_12;                    // 0x6A38 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75;                     // 0x6A68 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_13;                               // 0x6A90 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_23;       // 0x6B58 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_22;       // 0x6C50 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_11;                    // 0x6D48 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74;                     // 0x6D78 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_94;                         // 0x6DA0 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_93;                         // 0x6E20 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_92;                         // 0x6EA0 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_91;                         // 0x6F20 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_43;                       // 0x6FA0 (size: 0xA0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_42;                       // 0x7040 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_90;                         // 0x70E0 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_89;                         // 0x7160 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_88;                         // 0x71E0 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_87;                         // 0x7260 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_41;                       // 0x72E0 (size: 0xA0)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4;                        // 0x7380 (size: 0xB0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_40;                       // 0x7430 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_86;                         // 0x74D0 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_85;                         // 0x7550 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_39;                       // 0x75D0 (size: 0xA0)
    FAnimNode_StateResult AnimGraphNode_StateResult_57;                               // 0x7670 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_84;                         // 0x76A0 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_83;                         // 0x7720 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_82;                         // 0x77A0 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_81;                         // 0x7820 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_38;                       // 0x78A0 (size: 0xA0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_37;                       // 0x7940 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_80;                         // 0x79E0 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_79;                         // 0x7A60 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_78;                         // 0x7AE0 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_77;                         // 0x7B60 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_36;                       // 0x7BE0 (size: 0xA0)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3;                        // 0x7C80 (size: 0xB0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_35;                       // 0x7D30 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_76;                         // 0x7DD0 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_75;                         // 0x7E50 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_34;                       // 0x7ED0 (size: 0xA0)
    FAnimNode_StateResult AnimGraphNode_StateResult_56;                               // 0x7F70 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_55;                               // 0x7FA0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_12;                             // 0x7FD0 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_54;                               // 0x8080 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_74;                         // 0x80B0 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_73;                         // 0x8130 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_33;                       // 0x81B0 (size: 0xA0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_32;                       // 0x8250 (size: 0xA0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_31;                       // 0x82F0 (size: 0xA0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16;                           // 0x8390 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;                           // 0x83B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73;                     // 0x83E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72;                     // 0x8408 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71;                     // 0x8430 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70;                     // 0x8458 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69;                     // 0x8480 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68;                     // 0x84A8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_72;                         // 0x84D0 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_71;                         // 0x8550 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_70;                         // 0x85D0 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_30;                       // 0x8650 (size: 0xA0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_29;                       // 0x86F0 (size: 0xA0)
    FAnimNode_StateResult AnimGraphNode_StateResult_53;                               // 0x8790 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_69;                         // 0x87C0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_52;                               // 0x8840 (size: 0x30)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_28;                       // 0x8870 (size: 0xA0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_27;                       // 0x8910 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_68;                         // 0x89B0 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_67;                         // 0x8A30 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_66;                         // 0x8AB0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_51;                               // 0x8B30 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_50;                               // 0x8B60 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_11;                             // 0x8B90 (size: 0xB0)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_12;                               // 0x8C40 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_26;                       // 0x8D08 (size: 0xA0)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_11;                               // 0x8DA8 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67;                     // 0x8E70 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66;                     // 0x8E98 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65;                     // 0x8EC0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64;                     // 0x8EE8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63;                     // 0x8F10 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62;                     // 0x8F38 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65;                         // 0x8F60 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_64;                         // 0x8FE0 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63;                         // 0x9060 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_25;                       // 0x90E0 (size: 0xA0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_24;                       // 0x9180 (size: 0xA0)
    FAnimNode_StateResult AnimGraphNode_StateResult_49;                               // 0x9220 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62;                         // 0x9250 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_48;                               // 0x92D0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61;                         // 0x9300 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60;                         // 0x9380 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_23;                       // 0x9400 (size: 0xA0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22;                       // 0x94A0 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_59;                         // 0x9540 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_47;                               // 0x95C0 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_46;                               // 0x95F0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_10;                             // 0x9620 (size: 0xB0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_58;                         // 0x96D0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_45;                               // 0x9750 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61;                     // 0x9780 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60;                     // 0x97A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59;                     // 0x97D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58;                     // 0x97F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57;                     // 0x9820 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56;                     // 0x9848 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57;                         // 0x9870 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56;                         // 0x98F0 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55;                         // 0x9970 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21;                       // 0x99F0 (size: 0xA0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20;                       // 0x9A90 (size: 0xA0)
    FAnimNode_StateResult AnimGraphNode_StateResult_44;                               // 0x9B30 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_54;                         // 0x9B60 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_43;                               // 0x9BE0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_53;                         // 0x9C10 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52;                         // 0x9C90 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51;                         // 0x9D10 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19;                       // 0x9D90 (size: 0xA0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18;                       // 0x9E30 (size: 0xA0)
    FAnimNode_StateResult AnimGraphNode_StateResult_42;                               // 0x9ED0 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_41;                               // 0x9F00 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_9;                              // 0x9F30 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_40;                               // 0x9FE0 (size: 0x30)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_10;                               // 0xA010 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_21;       // 0xA0D8 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_20;       // 0xA1D0 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_10;                    // 0xA2C8 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55;                     // 0xA2F8 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_9;                                // 0xA320 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_19;       // 0xA3E8 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_18;       // 0xA4E0 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_9;                     // 0xA5D8 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54;                     // 0xA608 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53;                     // 0xA630 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52;                     // 0xA658 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_39;                               // 0xA680 (size: 0x30)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_8;                                // 0xA6B0 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_17;       // 0xA778 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_16;       // 0xA870 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_8;                     // 0xA968 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51;                     // 0xA998 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_7;                                // 0xA9C0 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_15;       // 0xAA88 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_14;       // 0xAB80 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_7;                     // 0xAC78 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50;                     // 0xACA8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50;                         // 0xACD0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_38;                               // 0xAD50 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49;                         // 0xAD80 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_37;                               // 0xAE00 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48;                         // 0xAE30 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_36;                               // 0xAEB0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_8;                              // 0xAEE0 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_35;                               // 0xAF90 (size: 0x30)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_6;                                // 0xAFC0 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_13;       // 0xB088 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_12;       // 0xB180 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_6;                     // 0xB278 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49;                     // 0xB2A8 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5;                                // 0xB2D0 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_11;       // 0xB398 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_10;       // 0xB490 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_5;                     // 0xB588 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48;                     // 0xB5B8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47;                         // 0xB5E0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_34;                               // 0xB660 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46;                         // 0xB690 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_33;                               // 0xB710 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45;                         // 0xB740 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_32;                               // 0xB7C0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_7;                              // 0xB7F0 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_31;                               // 0xB8A0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_6;                              // 0xB8D0 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_30;                               // 0xB980 (size: 0x30)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17;                       // 0xB9B0 (size: 0xA0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16;                       // 0xBA50 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44;                         // 0xBAF0 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43;                         // 0xBB70 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15;                       // 0xBBF0 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42;                         // 0xBC90 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14;                       // 0xBD10 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41;                         // 0xBDB0 (size: 0x80)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47;                     // 0xBE30 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46;                     // 0xBE58 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45;                     // 0xBE80 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44;                     // 0xBEA8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43;                     // 0xBED0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42;                     // 0xBEF8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41;                     // 0xBF20 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40;                     // 0xBF48 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0xBF70 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0xBF98 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0xBFC0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0xBFE8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40;                         // 0xC010 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39;                         // 0xC090 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38;                         // 0xC110 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37;                         // 0xC190 (size: 0x80)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2;                        // 0xC210 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_29;                               // 0xC2C0 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_28;                               // 0xC2F0 (size: 0x30)
    FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_2;                          // 0xC320 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36;                         // 0xC3C0 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35;                         // 0xC440 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_27;                               // 0xC4C0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34;                         // 0xC4F0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_26;                               // 0xC570 (size: 0x30)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8;                      // 0xC5A0 (size: 0xE8)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7;                      // 0xC688 (size: 0xE8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0xC770 (size: 0xB0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33;                         // 0xC820 (size: 0x80)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6;                      // 0xC8A0 (size: 0xE8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13;                       // 0xC988 (size: 0xA0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12;                       // 0xCA28 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32;                         // 0xCAC8 (size: 0x80)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5;                      // 0xCB48 (size: 0xE8)
    FAnimNode_StateResult AnimGraphNode_StateResult_25;                               // 0xCC30 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31;                         // 0xCC60 (size: 0x80)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4;                      // 0xCCE0 (size: 0xE8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11;                       // 0xCDC8 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30;                         // 0xCE68 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29;                         // 0xCEE8 (size: 0x80)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0xCF68 (size: 0xB0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0xD018 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0xD040 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4;                                // 0xD068 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_9;        // 0xD130 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_8;        // 0xD228 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_4;                     // 0xD320 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0xD350 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3;                                // 0xD378 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_7;        // 0xD440 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_6;        // 0xD538 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_3;                     // 0xD630 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0xD660 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0xD688 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0xD6B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0xD6D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0xD700 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0xD728 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2;                                // 0xD750 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_5;        // 0xD818 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_4;        // 0xD910 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_2;                     // 0xDA08 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0xDA38 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0xDA60 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0xDA88 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0xDAB0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0xDAD8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0xDB00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0xDB28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0xDB50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0xDB78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0xDBA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0xDBC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0xDBF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0xDC18 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28;                         // 0xDC40 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_24;                               // 0xDCC0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27;                         // 0xDCF0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0xDD70 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26;                         // 0xDDA0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0xDE20 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25;                         // 0xDE50 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0xDED0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24;                         // 0xDF00 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0xDF80 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23;                         // 0xDFB0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0xE030 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22;                         // 0xE060 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0xE0E0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0xE110 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0xE190 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0xE1C0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0xE240 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0xE270 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0xE2F0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0xE320 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0xE3A0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0xE3D0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0xE450 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0xE480 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0xE500 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_5;                              // 0xE530 (size: 0xB0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10;                       // 0xE5E0 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0xE680 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0xE700 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4;                              // 0xE730 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0xE7E0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0xE810 (size: 0xB0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9;                          // 0xE8C0 (size: 0x158)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_28;                                 // 0xEA18 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_27;                                 // 0xEB20 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_26;                                 // 0xEC28 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_25;                                 // 0xED30 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_24;                                 // 0xEE38 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_23;                                 // 0xEF40 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_22;                                 // 0xF048 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_21;                                 // 0xF150 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_20;                                 // 0xF258 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_19;                                 // 0xF360 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_18;                                 // 0xF468 (size: 0x108)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;     // 0xF570 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_17;                                 // 0xF590 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_16;                                 // 0xF698 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_15;                                 // 0xF7A0 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_14;                                 // 0xF8A8 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_13;                                 // 0xF9B0 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_12;                                 // 0xFAB8 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_11;                                 // 0xFBC0 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_10;                                 // 0xFCC8 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_9;                                  // 0xFDD0 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8;                                  // 0xFED8 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7;                                  // 0xFFE0 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6;                                  // 0x100E8 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5;                                  // 0x101F0 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4;                                  // 0x102F8 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3;                                  // 0x10400 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2;                                  // 0x10508 (size: 0x108)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;     // 0x10610 (size: 0x20)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5;                            // 0x10630 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x106F8 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9;                        // 0x10778 (size: 0xA0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x10818 (size: 0x28)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4;                            // 0x10840 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x10908 (size: 0x80)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3;                            // 0x10988 (size: 0xC8)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x10A50 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x10B58 (size: 0x108)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;                      // 0x10C60 (size: 0xE8)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2;                            // 0x10D48 (size: 0xC8)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0x10E10 (size: 0xE8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x10EF8 (size: 0xC0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x10FB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x10FE0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x11008 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x11030 (size: 0x28)
    FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_1;                          // 0x11058 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x110F8 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x11178 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x111F8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x11228 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x112A8 (size: 0x30)
    FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt;                            // 0x112D8 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x11378 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x113F8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x11428 (size: 0xB0)
    FAnimNode_Trail AnimGraphNode_Trail;                                              // 0x114E0 (size: 0x260)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x11740 (size: 0x20)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8;                          // 0x11760 (size: 0x158)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8;                        // 0x118B8 (size: 0xA0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x11958 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x11980 (size: 0x28)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x119A8 (size: 0x20)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7;                        // 0x119C8 (size: 0xA0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6;                        // 0x11A68 (size: 0xA0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7;                          // 0x11B08 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x11C60 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x11C88 (size: 0x28)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x11CB0 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x11CD0 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6;                          // 0x11CF8 (size: 0x158)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x11E50 (size: 0x20)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5;                          // 0x11E70 (size: 0x158)
    FAnimNode_BlendBoneByChannel AnimGraphNode_BlendBoneByChannel;                    // 0x11FC8 (size: 0x68)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x12030 (size: 0x28)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x12058 (size: 0xE8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x12140 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x12170 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x12198 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x122F0 (size: 0x28)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_1;                            // 0x12318 (size: 0xC8)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x123E0 (size: 0xE8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x124C8 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x12588 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x125B0 (size: 0x158)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x12708 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x12750 (size: 0x158)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0x128A8 (size: 0xA0)
    FAnimNode_Inertialization AnimGraphNode_Inertialization;                          // 0x12948 (size: 0x70)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x129B8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x12A00 (size: 0xA0)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_1;                                // 0x12AA0 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_3;        // 0x12B68 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_2;        // 0x12C60 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_1;                     // 0x12D58 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x12D88 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x12DB0 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_1;        // 0x12E78 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator;          // 0x12F70 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult;                       // 0x13068 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x13098 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x130C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x130E8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x13110 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x13190 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x131C0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x13240 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x13270 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x132A0 (size: 0xB0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x13350 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x13378 (size: 0x158)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;                              // 0x134D0 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x13598 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x135C0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x135E8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x13610 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x13638 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x13660 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x13688 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x136B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x136D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x13700 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x13728 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x137A8 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x13828 (size: 0xA0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x138C8 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x13968 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x139E8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x13A18 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x13A98 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x13AC8 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x13B48 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x13BC8 (size: 0xA0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x13C68 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x13D08 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x13D88 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x13DB8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x13DE8 (size: 0xB0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x13E98 (size: 0x158)
    bool IsMoving;                                                                    // 0x13FF0 (size: 0x1)
    class ABP_CatPawn_C* CatPawn;                                                     // 0x13FF8 (size: 0x8)
    float Delta Time;                                                                 // 0x14000 (size: 0x4)
    FVector2D MovementWorldInput;                                                     // 0x14004 (size: 0x8)
    bool IsInJumpState;                                                               // 0x1400C (size: 0x1)
    bool IsJumping;                                                                   // 0x1400D (size: 0x1)
    float JumpLength;                                                                 // 0x14010 (size: 0x4)
    float JumpHeight;                                                                 // 0x14014 (size: 0x4)
    float JumpPlayRate;                                                               // 0x14018 (size: 0x4)
    bool IsHanging;                                                                   // 0x1401C (size: 0x1)
    bool IsHangingRequested;                                                          // 0x1401D (size: 0x1)
    bool IsExitingHanging;                                                            // 0x1401E (size: 0x1)
    bool IsExitingHangingLeft;                                                        // 0x1401F (size: 0x1)
    bool IsPerched;                                                                   // 0x14020 (size: 0x1)
    FVector2D CorrectedWorldInput;                                                    // 0x14024 (size: 0x8)
    bool IsRunning;                                                                   // 0x1402C (size: 0x1)
    bool IsUTurnA;                                                                    // 0x1402D (size: 0x1)
    bool IsTurning;                                                                   // 0x1402E (size: 0x1)
    bool AIsTurningLeft;                                                              // 0x1402F (size: 0x1)
    bool BIsTurningLeft;                                                              // 0x14030 (size: 0x1)
    class UCurveFloat* WalkBlendspaceCorrectionCurve;                                 // 0x14038 (size: 0x8)
    bool IsJumpAnimA;                                                                 // 0x14040 (size: 0x1)
    bool IsCustomAnimationEnabled;                                                    // 0x14041 (size: 0x1)
    FCustomAnimation CustomAnimationA;                                                // 0x14050 (size: 0x50)
    float StopMaxVelocityThreshold;                                                   // 0x140A0 (size: 0x4)
    float StopMinInputThreshold;                                                      // 0x140A4 (size: 0x4)
    float timeSinceLastMiaou;                                                         // 0x140A8 (size: 0x4)
    FJumpBlock JumpBlockA;                                                            // 0x140B0 (size: 0xD0)
    FJumpBlock JumpBlockB;                                                            // 0x14180 (size: 0xD0)
    bool IsPerchRequested;                                                            // 0x14250 (size: 0x1)
    FRotator Spine Delta Rotation;                                                    // 0x14254 (size: 0xC)
    float Cat Speed;                                                                  // 0x14260 (size: 0x4)
    class UCurveFloat* SpineCurve Trot;                                               // 0x14268 (size: 0x8)
    float TailAlphaBlend;                                                             // 0x14270 (size: 0x4)
    FRotator Tail1 Rotation;                                                          // 0x14274 (size: 0xC)
    bool ShouldBePlayingJumpStopAnimation;                                            // 0x14280 (size: 0x1)
    float ShakeAlpha;                                                                 // 0x14284 (size: 0x4)
    float ShakeAlphaDecayTime;                                                        // 0x14288 (size: 0x4)
    float ShakeAlphaIncrement;                                                        // 0x1428C (size: 0x4)
    FSmootherFloat ShakeAlphaSmoother;                                                // 0x14290 (size: 0xC)
    class UMaterialInstanceDynamic* MI_CatFootStep;                                   // 0x142A0 (size: 0x8)
    FLinearColor FootStep Color;                                                      // 0x142A8 (size: 0x10)
    FLinearColor FootStep PaintColor;                                                 // 0x142B8 (size: 0x10)
    float FootStep Opacity;                                                           // 0x142C8 (size: 0x4)
    float FootStep Ro;                                                                // 0x142CC (size: 0x4)
    FVector FootStep Decal Size;                                                      // 0x142D0 (size: 0xC)
    TEnumAsByte<EPhysicalSurface> FootStep SurfaceType from CatRoot;                  // 0x142DC (size: 0x1)
    class UAnimSequence* ScriptedJumpAnimation;                                       // 0x142E0 (size: 0x8)
    bool IsInScriptedJump;                                                            // 0x142E8 (size: 0x1)
    bool IsOnRail;                                                                    // 0x142E9 (size: 0x1)
    FRotator LookAt Delta Rotation;                                                   // 0x142EC (size: 0xC)
    bool DoRandomLookAt;                                                              // 0x142F8 (size: 0x1)
    bool DoDialogLookAt;                                                              // 0x142F9 (size: 0x1)
    float DoLookAt Smooth;                                                            // 0x142FC (size: 0x4)
    FVector2D RandomEars;                                                             // 0x14300 (size: 0x8)
    bool IsInInterpolationAnimation_0;                                                // 0x14308 (size: 0x1)
    FVector2D RandomEarsSmooth;                                                       // 0x1430C (size: 0x8)
    FRotator Random Eyes Rotation;                                                    // 0x14314 (size: 0xC)
    FRotator Random Eyes Rotation Smooth;                                             // 0x14320 (size: 0xC)
    FRotator LookAt Delta Rotation Smooth;                                            // 0x1432C (size: 0xC)
    FRotator LookAtDialogDelta;                                                       // 0x14338 (size: 0xC)
    float BreathSpeedRate;                                                            // 0x14344 (size: 0x4)
    bool PlayIdle;                                                                    // 0x14348 (size: 0x1)
    int32 IdleIndex;                                                                  // 0x1434C (size: 0x4)
    float DoBlink Smooth;                                                             // 0x14350 (size: 0x4)
    int32 SubIdleIndex;                                                               // 0x14354 (size: 0x4)
    bool Crawl_Front;                                                                 // 0x14358 (size: 0x1)
    bool Crawl_Full;                                                                  // 0x14359 (size: 0x1)
    bool CustomWalk;                                                                  // 0x1435A (size: 0x1)
    int32 CustomWalk Index;                                                           // 0x1435C (size: 0x4)
    bool IsInterpolating_0;                                                           // 0x14360 (size: 0x1)
    class UAnimSequence* InterpolateAnimationA;                                       // 0x14368 (size: 0x8)
    class UAnimSequence* InterpolateAnimationB;                                       // 0x14370 (size: 0x8)
    bool IsInterpolatingA;                                                            // 0x14378 (size: 0x1)
    E_CatSubAnimInstances SubAnimInstanceIndex;                                       // 0x14379 (size: 0x1)
    float PerchAngle;                                                                 // 0x1437C (size: 0x4)
    FSmootherFloat SmoothedPerchAngle;                                                // 0x14380 (size: 0xC)
    float HangingAngle;                                                               // 0x1438C (size: 0x4)
    bool IsBendEnabled;                                                               // 0x14390 (size: 0x1)
    bool IsBodyRollEnabled;                                                           // 0x14391 (size: 0x1)
    bool IsTailTrailEnabled;                                                          // 0x14392 (size: 0x1)
    bool IsLookAtEnabled;                                                             // 0x14393 (size: 0x1)
    bool IsRandomEyesEnabled;                                                         // 0x14394 (size: 0x1)
    float HangingRotationSpeed;                                                       // 0x14398 (size: 0x4)
    int32 LastTeleportFrame;                                                          // 0x1439C (size: 0x4)
    int32 CurrentFrame;                                                               // 0x143A0 (size: 0x4)
    bool IsExitingHanging180;                                                         // 0x143A4 (size: 0x1)
    FVector Movement Direction for Bend;                                              // 0x143A8 (size: 0xC)
    bool IsWallPerched;                                                               // 0x143B4 (size: 0x1)
    float CinematicBlend;                                                             // 0x143B8 (size: 0x4)
    bool IsCinematic;                                                                 // 0x143BC (size: 0x1)
    TArray<float> BendCurveValues;                                                    // 0x143C0 (size: 0x10)
    bool HasJump;                                                                     // 0x143D0 (size: 0x1)
    E_UTurnType ATurningType;                                                         // 0x143D1 (size: 0x1)
    float PerchStartRatio;                                                            // 0x143D4 (size: 0x4)
    E_UTurnType BTurningType;                                                         // 0x143D8 (size: 0x1)
    TEnumAsByte<ECatAttitude> CatAttitude;                                            // 0x143D9 (size: 0x1)
    bool ShouldBePlayingJumpStopRailAnimation;                                        // 0x143DA (size: 0x1)
    bool IsDead;                                                                      // 0x143DB (size: 0x1)
    float JumpStartVelocityRatio;                                                     // 0x143DC (size: 0x4)
    bool DoSlowJumpA;                                                                 // 0x143E0 (size: 0x1)
    bool DoSlowJumpB;                                                                 // 0x143E1 (size: 0x1)
    class UHKAnimInstance* CatPawPushInstance;                                        // 0x143E8 (size: 0x8)
    float BarrelAlpha;                                                                // 0x143F0 (size: 0x4)
    bool IsInBarrel;                                                                  // 0x143F4 (size: 0x1)
    FCustomAnimation CustomAnimationB;                                                // 0x14400 (size: 0x50)
    bool IsInCustomAnimationA;                                                        // 0x14450 (size: 0x1)
    FNoiseSmootherFloat HangingRotationSpeedSmoother;                                 // 0x14458 (size: 0x38)
    int32 HangingTurnSide;                                                            // 0x14490 (size: 0x4)
    float HangingTurnPlayRatio;                                                       // 0x14494 (size: 0x4)
    class UHKAnimInstance* CageInstance;                                              // 0x14498 (size: 0x8)
    FRotator CatPreviousRotation;                                                     // 0x144A0 (size: 0xC)
    float WallPerchRatio;                                                             // 0x144AC (size: 0x4)
    float UturnPlayRate;                                                              // 0x144B0 (size: 0x4)
    bool TailAnimWalkOn;                                                              // 0x144B4 (size: 0x1)
    bool TailAnimStandOn;                                                             // 0x144B5 (size: 0x1)
    int32 TailWalkIndex;                                                              // 0x144B8 (size: 0x4)
    int32 TailStandIndex;                                                             // 0x144BC (size: 0x4)
    float Tail Alpha Blend;                                                           // 0x144C0 (size: 0x4)
    bool TailAnimIsStanding;                                                          // 0x144C4 (size: 0x1)
    bool TailAnimIsWalking;                                                           // 0x144C5 (size: 0x1)
    float sfx cat walk starting force;                                                // 0x144C8 (size: 0x4)
    bool IsInBucket;                                                                  // 0x144CC (size: 0x1)
    E_MainPaw MainPawA;                                                               // 0x144CD (size: 0x1)
    E_MainPaw MainPawB;                                                               // 0x144CE (size: 0x1)
    bool UseMainPawA;                                                                 // 0x144CF (size: 0x1)
    float VelocityRatio;                                                              // 0x144D0 (size: 0x4)
    bool ShouldFailJumpA;                                                             // 0x144D4 (size: 0x1)
    bool ShouldFailJumpB;                                                             // 0x144D5 (size: 0x1)
    FVectorSpringState LookAtSpringState;                                             // 0x144D8 (size: 0x18)
    float DriftFactor;                                                                // 0x144F0 (size: 0x4)
    class USoundBase* Temp_object_Variable;                                           // 0x144F8 (size: 0x8)
    class USoundBase* Temp_object_Variable_1;                                         // 0x14500 (size: 0x8)
    class USoundBase* Temp_object_Variable_2;                                         // 0x14508 (size: 0x8)
    class USoundBase* Temp_object_Variable_3;                                         // 0x14510 (size: 0x8)
    class USoundBase* Temp_object_Variable_4;                                         // 0x14518 (size: 0x8)
    class USoundBase* Temp_object_Variable_5;                                         // 0x14520 (size: 0x8)
    class USoundBase* Temp_object_Variable_6;                                         // 0x14528 (size: 0x8)
    class USoundBase* Temp_object_Variable_7;                                         // 0x14530 (size: 0x8)
    class USoundBase* Temp_object_Variable_8;                                         // 0x14538 (size: 0x8)
    class USoundBase* Temp_object_Variable_9;                                         // 0x14540 (size: 0x8)
    class USoundBase* Temp_object_Variable_10;                                        // 0x14548 (size: 0x8)
    class USoundBase* Temp_object_Variable_11;                                        // 0x14550 (size: 0x8)
    TEnumAsByte<EPhysicalSurface> Temp_byte_Variable;                                 // 0x14558 (size: 0x1)
    class USoundBase* Temp_object_Variable_12;                                        // 0x14560 (size: 0x8)
    class USoundBase* Temp_object_Variable_13;                                        // 0x14568 (size: 0x8)
    class USoundBase* Temp_object_Variable_14;                                        // 0x14570 (size: 0x8)
    class USoundBase* Temp_object_Variable_15;                                        // 0x14578 (size: 0x8)
    class USoundBase* Temp_object_Variable_16;                                        // 0x14580 (size: 0x8)
    class USoundBase* Temp_object_Variable_17;                                        // 0x14588 (size: 0x8)
    class USoundBase* Temp_object_Variable_18;                                        // 0x14590 (size: 0x8)
    class USoundBase* Temp_object_Variable_19;                                        // 0x14598 (size: 0x8)
    class USoundBase* Temp_object_Variable_20;                                        // 0x145A0 (size: 0x8)
    class USoundBase* Temp_object_Variable_21;                                        // 0x145A8 (size: 0x8)
    class USoundBase* Temp_object_Variable_22;                                        // 0x145B0 (size: 0x8)
    class USoundBase* Temp_object_Variable_23;                                        // 0x145B8 (size: 0x8)
    class USoundBase* Temp_object_Variable_24;                                        // 0x145C0 (size: 0x8)
    class USoundBase* Temp_object_Variable_25;                                        // 0x145C8 (size: 0x8)
    class USoundBase* Temp_object_Variable_26;                                        // 0x145D0 (size: 0x8)
    class USoundBase* Temp_object_Variable_27;                                        // 0x145D8 (size: 0x8)
    class USoundBase* Temp_object_Variable_28;                                        // 0x145E0 (size: 0x8)
    class USoundBase* Temp_object_Variable_29;                                        // 0x145E8 (size: 0x8)
    class USoundBase* Temp_object_Variable_30;                                        // 0x145F0 (size: 0x8)
    class USoundBase* Temp_object_Variable_31;                                        // 0x145F8 (size: 0x8)
    class USoundBase* Temp_object_Variable_32;                                        // 0x14600 (size: 0x8)
    class USoundBase* Temp_object_Variable_33;                                        // 0x14608 (size: 0x8)
    class USoundBase* Temp_object_Variable_34;                                        // 0x14610 (size: 0x8)
    class USoundBase* Temp_object_Variable_35;                                        // 0x14618 (size: 0x8)
    class USoundBase* Temp_object_Variable_36;                                        // 0x14620 (size: 0x8)
    class USoundBase* Temp_object_Variable_37;                                        // 0x14628 (size: 0x8)
    class USoundBase* Temp_object_Variable_38;                                        // 0x14630 (size: 0x8)
    class USoundBase* Temp_object_Variable_39;                                        // 0x14638 (size: 0x8)
    class USoundBase* Temp_object_Variable_40;                                        // 0x14640 (size: 0x8)
    class USoundBase* Temp_object_Variable_41;                                        // 0x14648 (size: 0x8)
    class USoundBase* Temp_object_Variable_42;                                        // 0x14650 (size: 0x8)
    class USoundBase* Temp_object_Variable_43;                                        // 0x14658 (size: 0x8)
    TEnumAsByte<EPhysicalSurface> Temp_byte_Variable_1;                               // 0x14660 (size: 0x1)
    class UParticleSystem* Temp_object_Variable_44;                                   // 0x14668 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_45;                                   // 0x14670 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_46;                                   // 0x14678 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_47;                                   // 0x14680 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_48;                                   // 0x14688 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_49;                                   // 0x14690 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_50;                                   // 0x14698 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_51;                                   // 0x146A0 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_52;                                   // 0x146A8 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_53;                                   // 0x146B0 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_54;                                   // 0x146B8 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_55;                                   // 0x146C0 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_56;                                   // 0x146C8 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_57;                                   // 0x146D0 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_58;                                   // 0x146D8 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_59;                                   // 0x146E0 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_60;                                   // 0x146E8 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_61;                                   // 0x146F0 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_62;                                   // 0x146F8 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_63;                                   // 0x14700 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_64;                                   // 0x14708 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_65;                                   // 0x14710 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_66;                                   // 0x14718 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_67;                                   // 0x14720 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_68;                                   // 0x14728 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_69;                                   // 0x14730 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_70;                                   // 0x14738 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_71;                                   // 0x14740 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_72;                                   // 0x14748 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_73;                                   // 0x14750 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_74;                                   // 0x14758 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_75;                                   // 0x14760 (size: 0x8)
    TEnumAsByte<EPhysicalSurface> Temp_byte_Variable_2;                               // 0x14768 (size: 0x1)
    class UParticleSystem* Temp_object_Variable_76;                                   // 0x14770 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_77;                                   // 0x14778 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_78;                                   // 0x14780 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_79;                                   // 0x14788 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_80;                                   // 0x14790 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_81;                                   // 0x14798 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_82;                                   // 0x147A0 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_83;                                   // 0x147A8 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_84;                                   // 0x147B0 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_85;                                   // 0x147B8 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_86;                                   // 0x147C0 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_87;                                   // 0x147C8 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_88;                                   // 0x147D0 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_89;                                   // 0x147D8 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_90;                                   // 0x147E0 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_91;                                   // 0x147E8 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_92;                                   // 0x147F0 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_93;                                   // 0x147F8 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_94;                                   // 0x14800 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_95;                                   // 0x14808 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_96;                                   // 0x14810 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_97;                                   // 0x14818 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_98;                                   // 0x14820 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_99;                                   // 0x14828 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_100;                                  // 0x14830 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_101;                                  // 0x14838 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_102;                                  // 0x14840 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_103;                                  // 0x14848 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_104;                                  // 0x14850 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_105;                                  // 0x14858 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_106;                                  // 0x14860 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_107;                                  // 0x14868 (size: 0x8)
    TEnumAsByte<EPhysicalSurface> Temp_byte_Variable_3;                               // 0x14870 (size: 0x1)
    class UParticleSystem* Temp_object_Variable_108;                                  // 0x14878 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_109;                                  // 0x14880 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_110;                                  // 0x14888 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_111;                                  // 0x14890 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_112;                                  // 0x14898 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_113;                                  // 0x148A0 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_114;                                  // 0x148A8 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_115;                                  // 0x148B0 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_116;                                  // 0x148B8 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_117;                                  // 0x148C0 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_118;                                  // 0x148C8 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_119;                                  // 0x148D0 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_120;                                  // 0x148D8 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_121;                                  // 0x148E0 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_122;                                  // 0x148E8 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_123;                                  // 0x148F0 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_124;                                  // 0x148F8 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_125;                                  // 0x14900 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_126;                                  // 0x14908 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_127;                                  // 0x14910 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_128;                                  // 0x14918 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_129;                                  // 0x14920 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_130;                                  // 0x14928 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_131;                                  // 0x14930 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_132;                                  // 0x14938 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_133;                                  // 0x14940 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_134;                                  // 0x14948 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_135;                                  // 0x14950 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_136;                                  // 0x14958 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_137;                                  // 0x14960 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_138;                                  // 0x14968 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_139;                                  // 0x14970 (size: 0x8)
    TEnumAsByte<EPhysicalSurface> Temp_byte_Variable_4;                               // 0x14978 (size: 0x1)
    class UParticleSystem* Temp_object_Variable_140;                                  // 0x14980 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_141;                                  // 0x14988 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_142;                                  // 0x14990 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_143;                                  // 0x14998 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_144;                                  // 0x149A0 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_145;                                  // 0x149A8 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_146;                                  // 0x149B0 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_147;                                  // 0x149B8 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_148;                                  // 0x149C0 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_149;                                  // 0x149C8 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_150;                                  // 0x149D0 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_151;                                  // 0x149D8 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_152;                                  // 0x149E0 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_153;                                  // 0x149E8 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_154;                                  // 0x149F0 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_155;                                  // 0x149F8 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_156;                                  // 0x14A00 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_157;                                  // 0x14A08 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_158;                                  // 0x14A10 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_159;                                  // 0x14A18 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_160;                                  // 0x14A20 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_161;                                  // 0x14A28 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_162;                                  // 0x14A30 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_163;                                  // 0x14A38 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_164;                                  // 0x14A40 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_165;                                  // 0x14A48 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_166;                                  // 0x14A50 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_167;                                  // 0x14A58 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_168;                                  // 0x14A60 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_169;                                  // 0x14A68 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_170;                                  // 0x14A70 (size: 0x8)
    class UParticleSystem* Temp_object_Variable_171;                                  // 0x14A78 (size: 0x8)
    TEnumAsByte<EPhysicalSurface> Temp_byte_Variable_5;                               // 0x14A80 (size: 0x1)
    FLinearColor Temp_struct_Variable;                                                // 0x14A84 (size: 0x10)
    FLinearColor Temp_struct_Variable_1;                                              // 0x14A94 (size: 0x10)
    FLinearColor Temp_struct_Variable_2;                                              // 0x14AA4 (size: 0x10)
    FLinearColor Temp_struct_Variable_3;                                              // 0x14AB4 (size: 0x10)
    FLinearColor Temp_struct_Variable_4;                                              // 0x14AC4 (size: 0x10)
    FLinearColor Temp_struct_Variable_5;                                              // 0x14AD4 (size: 0x10)
    FLinearColor Temp_struct_Variable_6;                                              // 0x14AE4 (size: 0x10)
    FLinearColor Temp_struct_Variable_7;                                              // 0x14AF4 (size: 0x10)
    FLinearColor Temp_struct_Variable_8;                                              // 0x14B04 (size: 0x10)
    FLinearColor Temp_struct_Variable_9;                                              // 0x14B14 (size: 0x10)
    FLinearColor Temp_struct_Variable_10;                                             // 0x14B24 (size: 0x10)
    FLinearColor Temp_struct_Variable_11;                                             // 0x14B34 (size: 0x10)
    FLinearColor Temp_struct_Variable_12;                                             // 0x14B44 (size: 0x10)
    FLinearColor Temp_struct_Variable_13;                                             // 0x14B54 (size: 0x10)
    FLinearColor Temp_struct_Variable_14;                                             // 0x14B64 (size: 0x10)
    FLinearColor Temp_struct_Variable_15;                                             // 0x14B74 (size: 0x10)
    FLinearColor Temp_struct_Variable_16;                                             // 0x14B84 (size: 0x10)
    FLinearColor Temp_struct_Variable_17;                                             // 0x14B94 (size: 0x10)
    FLinearColor Temp_struct_Variable_18;                                             // 0x14BA4 (size: 0x10)
    FLinearColor Temp_struct_Variable_19;                                             // 0x14BB4 (size: 0x10)
    FLinearColor Temp_struct_Variable_20;                                             // 0x14BC4 (size: 0x10)
    FLinearColor Temp_struct_Variable_21;                                             // 0x14BD4 (size: 0x10)
    FLinearColor Temp_struct_Variable_22;                                             // 0x14BE4 (size: 0x10)
    FLinearColor Temp_struct_Variable_23;                                             // 0x14BF4 (size: 0x10)
    FLinearColor Temp_struct_Variable_24;                                             // 0x14C04 (size: 0x10)
    FLinearColor Temp_struct_Variable_25;                                             // 0x14C14 (size: 0x10)
    FLinearColor Temp_struct_Variable_26;                                             // 0x14C24 (size: 0x10)
    FLinearColor Temp_struct_Variable_27;                                             // 0x14C34 (size: 0x10)
    FLinearColor Temp_struct_Variable_28;                                             // 0x14C44 (size: 0x10)
    FLinearColor Temp_struct_Variable_29;                                             // 0x14C54 (size: 0x10)
    FLinearColor Temp_struct_Variable_30;                                             // 0x14C64 (size: 0x10)
    TEnumAsByte<EPhysicalSurface> Temp_byte_Variable_6;                               // 0x14C74 (size: 0x1)
    float Temp_float_Variable;                                                        // 0x14C78 (size: 0x4)
    float Temp_float_Variable_1;                                                      // 0x14C7C (size: 0x4)
    float Temp_float_Variable_2;                                                      // 0x14C80 (size: 0x4)
    float Temp_float_Variable_3;                                                      // 0x14C84 (size: 0x4)
    float Temp_float_Variable_4;                                                      // 0x14C88 (size: 0x4)
    float Temp_float_Variable_5;                                                      // 0x14C8C (size: 0x4)
    float Temp_float_Variable_6;                                                      // 0x14C90 (size: 0x4)
    float Temp_float_Variable_7;                                                      // 0x14C94 (size: 0x4)
    float Temp_float_Variable_8;                                                      // 0x14C98 (size: 0x4)
    float Temp_float_Variable_9;                                                      // 0x14C9C (size: 0x4)
    float Temp_float_Variable_10;                                                     // 0x14CA0 (size: 0x4)
    float Temp_float_Variable_11;                                                     // 0x14CA4 (size: 0x4)
    float Temp_float_Variable_12;                                                     // 0x14CA8 (size: 0x4)
    float Temp_float_Variable_13;                                                     // 0x14CAC (size: 0x4)
    float Temp_float_Variable_14;                                                     // 0x14CB0 (size: 0x4)
    float Temp_float_Variable_15;                                                     // 0x14CB4 (size: 0x4)
    float Temp_float_Variable_16;                                                     // 0x14CB8 (size: 0x4)
    float Temp_float_Variable_17;                                                     // 0x14CBC (size: 0x4)
    float Temp_float_Variable_18;                                                     // 0x14CC0 (size: 0x4)
    float Temp_float_Variable_19;                                                     // 0x14CC4 (size: 0x4)
    float Temp_float_Variable_20;                                                     // 0x14CC8 (size: 0x4)
    float Temp_float_Variable_21;                                                     // 0x14CCC (size: 0x4)
    float Temp_float_Variable_22;                                                     // 0x14CD0 (size: 0x4)
    float Temp_float_Variable_23;                                                     // 0x14CD4 (size: 0x4)
    float Temp_float_Variable_24;                                                     // 0x14CD8 (size: 0x4)
    float Temp_float_Variable_25;                                                     // 0x14CDC (size: 0x4)
    float Temp_float_Variable_26;                                                     // 0x14CE0 (size: 0x4)
    float Temp_float_Variable_27;                                                     // 0x14CE4 (size: 0x4)
    float Temp_float_Variable_28;                                                     // 0x14CE8 (size: 0x4)
    float Temp_float_Variable_29;                                                     // 0x14CEC (size: 0x4)
    float Temp_float_Variable_30;                                                     // 0x14CF0 (size: 0x4)
    float Temp_float_Variable_31;                                                     // 0x14CF4 (size: 0x4)
    TEnumAsByte<EPhysicalSurface> Temp_byte_Variable_7;                               // 0x14CF8 (size: 0x1)
    float Temp_float_Variable_32;                                                     // 0x14CFC (size: 0x4)
    float Temp_float_Variable_33;                                                     // 0x14D00 (size: 0x4)
    float Temp_float_Variable_34;                                                     // 0x14D04 (size: 0x4)
    float Temp_float_Variable_35;                                                     // 0x14D08 (size: 0x4)
    float Temp_float_Variable_36;                                                     // 0x14D0C (size: 0x4)
    float Temp_float_Variable_37;                                                     // 0x14D10 (size: 0x4)
    float Temp_float_Variable_38;                                                     // 0x14D14 (size: 0x4)
    float Temp_float_Variable_39;                                                     // 0x14D18 (size: 0x4)
    float Temp_float_Variable_40;                                                     // 0x14D1C (size: 0x4)
    float Temp_float_Variable_41;                                                     // 0x14D20 (size: 0x4)
    float Temp_float_Variable_42;                                                     // 0x14D24 (size: 0x4)
    float Temp_float_Variable_43;                                                     // 0x14D28 (size: 0x4)
    float Temp_float_Variable_44;                                                     // 0x14D2C (size: 0x4)
    float Temp_float_Variable_45;                                                     // 0x14D30 (size: 0x4)
    float Temp_float_Variable_46;                                                     // 0x14D34 (size: 0x4)
    float Temp_float_Variable_47;                                                     // 0x14D38 (size: 0x4)
    float Temp_float_Variable_48;                                                     // 0x14D3C (size: 0x4)
    float Temp_float_Variable_49;                                                     // 0x14D40 (size: 0x4)
    float Temp_float_Variable_50;                                                     // 0x14D44 (size: 0x4)
    float Temp_float_Variable_51;                                                     // 0x14D48 (size: 0x4)
    float Temp_float_Variable_52;                                                     // 0x14D4C (size: 0x4)
    float Temp_float_Variable_53;                                                     // 0x14D50 (size: 0x4)
    float Temp_float_Variable_54;                                                     // 0x14D54 (size: 0x4)
    float Temp_float_Variable_55;                                                     // 0x14D58 (size: 0x4)
    float Temp_float_Variable_56;                                                     // 0x14D5C (size: 0x4)
    float Temp_float_Variable_57;                                                     // 0x14D60 (size: 0x4)
    float Temp_float_Variable_58;                                                     // 0x14D64 (size: 0x4)
    float Temp_float_Variable_59;                                                     // 0x14D68 (size: 0x4)
    float Temp_float_Variable_60;                                                     // 0x14D6C (size: 0x4)
    float Temp_float_Variable_61;                                                     // 0x14D70 (size: 0x4)
    float Temp_float_Variable_62;                                                     // 0x14D74 (size: 0x4)
    float Temp_float_Variable_63;                                                     // 0x14D78 (size: 0x4)
    TEnumAsByte<EPhysicalSurface> Temp_byte_Variable_8;                               // 0x14D7C (size: 0x1)
    float Temp_float_Variable_64;                                                     // 0x14D80 (size: 0x4)
    float Temp_float_Variable_65;                                                     // 0x14D84 (size: 0x4)
    float Temp_float_Variable_66;                                                     // 0x14D88 (size: 0x4)
    float Temp_float_Variable_67;                                                     // 0x14D8C (size: 0x4)
    float Temp_float_Variable_68;                                                     // 0x14D90 (size: 0x4)
    float Temp_float_Variable_69;                                                     // 0x14D94 (size: 0x4)
    float Temp_float_Variable_70;                                                     // 0x14D98 (size: 0x4)
    float Temp_float_Variable_71;                                                     // 0x14D9C (size: 0x4)
    float Temp_float_Variable_72;                                                     // 0x14DA0 (size: 0x4)
    float Temp_float_Variable_73;                                                     // 0x14DA4 (size: 0x4)
    float Temp_float_Variable_74;                                                     // 0x14DA8 (size: 0x4)
    float Temp_float_Variable_75;                                                     // 0x14DAC (size: 0x4)
    float Temp_float_Variable_76;                                                     // 0x14DB0 (size: 0x4)
    float Temp_float_Variable_77;                                                     // 0x14DB4 (size: 0x4)
    float Temp_float_Variable_78;                                                     // 0x14DB8 (size: 0x4)
    float Temp_float_Variable_79;                                                     // 0x14DBC (size: 0x4)
    float Temp_float_Variable_80;                                                     // 0x14DC0 (size: 0x4)
    float Temp_float_Variable_81;                                                     // 0x14DC4 (size: 0x4)
    float Temp_float_Variable_82;                                                     // 0x14DC8 (size: 0x4)
    float Temp_float_Variable_83;                                                     // 0x14DCC (size: 0x4)
    float Temp_float_Variable_84;                                                     // 0x14DD0 (size: 0x4)
    float Temp_float_Variable_85;                                                     // 0x14DD4 (size: 0x4)
    float Temp_float_Variable_86;                                                     // 0x14DD8 (size: 0x4)
    float Temp_float_Variable_87;                                                     // 0x14DDC (size: 0x4)
    float Temp_float_Variable_88;                                                     // 0x14DE0 (size: 0x4)
    float Temp_float_Variable_89;                                                     // 0x14DE4 (size: 0x4)
    float Temp_float_Variable_90;                                                     // 0x14DE8 (size: 0x4)
    float Temp_float_Variable_91;                                                     // 0x14DEC (size: 0x4)
    float Temp_float_Variable_92;                                                     // 0x14DF0 (size: 0x4)
    float Temp_float_Variable_93;                                                     // 0x14DF4 (size: 0x4)
    float Temp_float_Variable_94;                                                     // 0x14DF8 (size: 0x4)
    float Temp_float_Variable_95;                                                     // 0x14DFC (size: 0x4)
    bool Temp_bool_Variable;                                                          // 0x14E00 (size: 0x1)
    FVector Temp_struct_Variable_31;                                                  // 0x14E04 (size: 0xC)
    TEnumAsByte<ECatBendInputMode> Temp_byte_Variable_9;                              // 0x14E10 (size: 0x1)
    bool Temp_bool_Variable_1;                                                        // 0x14E11 (size: 0x1)
    bool Temp_bool_Variable_2;                                                        // 0x14E12 (size: 0x1)
    bool Temp_bool_Variable_3;                                                        // 0x14E13 (size: 0x1)
    bool Temp_bool_Variable_4;                                                        // 0x14E14 (size: 0x1)
    bool Temp_bool_Variable_5;                                                        // 0x14E15 (size: 0x1)
    bool Temp_bool_Variable_6;                                                        // 0x14E16 (size: 0x1)
    class USoundBase* Temp_object_Variable_172;                                       // 0x14E18 (size: 0x8)
    class UJoyEasingInterpolator* CallFunc_StartEasingInterpolator__interpolatorObject; // 0x14E20 (size: 0x8)
    class UJoyEasingInterpolator* CallFunc_StartEasingInterpolator_ReturnValue;       // 0x14E28 (size: 0x8)
    bool CallFunc_IsValid_ReturnValue;                                                // 0x14E30 (size: 0x1)
    class USoundBase* Temp_object_Variable_173;                                       // 0x14E38 (size: 0x8)
    int32 Temp_int_Variable;                                                          // 0x14E40 (size: 0x4)
    TEnumAsByte<EPhysicalSurface> Temp_byte_Variable_10;                              // 0x14E44 (size: 0x1)
    class USoundBase* Temp_object_Variable_174;                                       // 0x14E48 (size: 0x8)
    class USoundBase* Temp_object_Variable_175;                                       // 0x14E50 (size: 0x8)
    class USoundBase* Temp_object_Variable_176;                                       // 0x14E58 (size: 0x8)
    class USoundBase* Temp_object_Variable_177;                                       // 0x14E60 (size: 0x8)
    class USoundBase* Temp_object_Variable_178;                                       // 0x14E68 (size: 0x8)
    class USoundBase* Temp_object_Variable_179;                                       // 0x14E70 (size: 0x8)
    class USoundBase* Temp_object_Variable_180;                                       // 0x14E78 (size: 0x8)
    class USoundBase* Temp_object_Variable_181;                                       // 0x14E80 (size: 0x8)
    class USoundBase* Temp_object_Variable_182;                                       // 0x14E88 (size: 0x8)
    class USoundBase* Temp_object_Variable_183;                                       // 0x14E90 (size: 0x8)
    class USoundBase* Temp_object_Variable_184;                                       // 0x14E98 (size: 0x8)
    class USoundBase* Temp_object_Variable_185;                                       // 0x14EA0 (size: 0x8)
    class USoundBase* Temp_object_Variable_186;                                       // 0x14EA8 (size: 0x8)
    class USoundBase* Temp_object_Variable_187;                                       // 0x14EB0 (size: 0x8)
    class USoundBase* Temp_object_Variable_188;                                       // 0x14EB8 (size: 0x8)
    class USoundBase* Temp_object_Variable_189;                                       // 0x14EC0 (size: 0x8)
    class USoundBase* Temp_object_Variable_190;                                       // 0x14EC8 (size: 0x8)
    class USoundBase* Temp_object_Variable_191;                                       // 0x14ED0 (size: 0x8)
    class USoundBase* Temp_object_Variable_192;                                       // 0x14ED8 (size: 0x8)
    class USoundBase* Temp_object_Variable_193;                                       // 0x14EE0 (size: 0x8)
    class USoundBase* Temp_object_Variable_194;                                       // 0x14EE8 (size: 0x8)
    class USoundBase* Temp_object_Variable_195;                                       // 0x14EF0 (size: 0x8)
    class USoundBase* Temp_object_Variable_196;                                       // 0x14EF8 (size: 0x8)
    class USoundBase* Temp_object_Variable_197;                                       // 0x14F00 (size: 0x8)
    class USoundBase* Temp_object_Variable_198;                                       // 0x14F08 (size: 0x8)
    class USoundBase* Temp_object_Variable_199;                                       // 0x14F10 (size: 0x8)
    class USoundBase* Temp_object_Variable_200;                                       // 0x14F18 (size: 0x8)
    class USoundBase* Temp_object_Variable_201;                                       // 0x14F20 (size: 0x8)
    class USoundBase* Temp_object_Variable_202;                                       // 0x14F28 (size: 0x8)
    class USoundBase* Temp_object_Variable_203;                                       // 0x14F30 (size: 0x8)
    class USoundBase* Temp_object_Variable_204;                                       // 0x14F38 (size: 0x8)
    class USoundBase* Temp_object_Variable_205;                                       // 0x14F40 (size: 0x8)
    class USoundBase* Temp_object_Variable_206;                                       // 0x14F48 (size: 0x8)
    class USoundBase* K2Node_Select_Default;                                          // 0x14F50 (size: 0x8)
    class UJoyEasingInterpolator* Temp_wildcard_Variable;                             // 0x14F58 (size: 0x8)
    float Temp_float_Variable_96;                                                     // 0x14F60 (size: 0x4)
    class USoundBase* Temp_object_Variable_207;                                       // 0x14F68 (size: 0x8)
    class USoundBase* Temp_object_Variable_208;                                       // 0x14F70 (size: 0x8)
    bool Temp_bool_Variable_7;                                                        // 0x14F78 (size: 0x1)
    class USoundBase* Temp_object_Variable_209;                                       // 0x14F80 (size: 0x8)
    class USoundBase* Temp_object_Variable_210;                                       // 0x14F88 (size: 0x8)
    class UJoyEasingInterpolator* Temp_wildcard_Variable_1;                           // 0x14F90 (size: 0x8)
    class USoundBase* Temp_object_Variable_211;                                       // 0x14F98 (size: 0x8)
    class USoundBase* Temp_object_Variable_212;                                       // 0x14FA0 (size: 0x8)
    class USoundBase* Temp_object_Variable_213;                                       // 0x14FA8 (size: 0x8)
    class USoundBase* Temp_object_Variable_214;                                       // 0x14FB0 (size: 0x8)
    class USoundBase* Temp_object_Variable_215;                                       // 0x14FB8 (size: 0x8)
    class USoundBase* Temp_object_Variable_216;                                       // 0x14FC0 (size: 0x8)
    class USoundBase* Temp_object_Variable_217;                                       // 0x14FC8 (size: 0x8)
    class USoundBase* Temp_object_Variable_218;                                       // 0x14FD0 (size: 0x8)
    TEnumAsByte<EPhysicalSurface> Temp_byte_Variable_11;                              // 0x14FD8 (size: 0x1)
    class USoundBase* Temp_object_Variable_219;                                       // 0x14FE0 (size: 0x8)
    int32 Temp_int_Variable_1;                                                        // 0x14FE8 (size: 0x4)
    int32 CallFunc_InternalBreakableDelay_ReturnValue;                                // 0x14FEC (size: 0x4)
    bool CallFunc_InternalBreakBreakableDelay_ReturnValue;                            // 0x14FF0 (size: 0x1)
    int32 CallFunc_InternalBreakableDelay_ReturnValue_1;                              // 0x14FF4 (size: 0x4)
    bool Temp_bool_Has_Been_Initd_Variable;                                           // 0x14FF8 (size: 0x1)
    bool Temp_bool_IsClosed_Variable;                                                 // 0x14FF9 (size: 0x1)
    bool Temp_bool_Variable_8;                                                        // 0x14FFA (size: 0x1)
    class USoundBase* Temp_object_Variable_220;                                       // 0x15000 (size: 0x8)
    float Temp_float_Variable_97;                                                     // 0x15008 (size: 0x4)
    bool Temp_bool_Variable_9;                                                        // 0x1500C (size: 0x1)
    bool Temp_bool_Variable_10;                                                       // 0x1500D (size: 0x1)
    bool Temp_bool_Variable_11;                                                       // 0x1500E (size: 0x1)
    bool Temp_bool_Variable_12;                                                       // 0x1500F (size: 0x1)
    bool Temp_bool_Variable_13;                                                       // 0x15010 (size: 0x1)
    bool Temp_bool_Variable_14;                                                       // 0x15011 (size: 0x1)
    bool Temp_bool_Variable_15;                                                       // 0x15012 (size: 0x1)
    class UAnimSequence* K2Node_Select_Default_1;                                     // 0x15018 (size: 0x8)
    class UAnimSequence* K2Node_Select_Default_2;                                     // 0x15020 (size: 0x8)
    bool Temp_bool_Variable_16;                                                       // 0x15028 (size: 0x1)
    bool Temp_bool_Variable_17;                                                       // 0x15029 (size: 0x1)
    class UAnimSequence* K2Node_Select_Default_3;                                     // 0x15030 (size: 0x8)
    class UAnimSequence* K2Node_Select_Default_4;                                     // 0x15038 (size: 0x8)
    bool Temp_bool_Variable_18;                                                       // 0x15040 (size: 0x1)
    E_MainPaw K2Node_Select_Default_5;                                                // 0x15041 (size: 0x1)
    class USoundBase* Temp_object_Variable_221;                                       // 0x15048 (size: 0x8)
    float CallFunc_BreakRotator_Roll;                                                 // 0x15050 (size: 0x4)
    float CallFunc_BreakRotator_Pitch;                                                // 0x15054 (size: 0x4)
    float CallFunc_BreakRotator_Yaw;                                                  // 0x15058 (size: 0x4)
    float CallFunc_BreakVector2D_X;                                                   // 0x1505C (size: 0x4)
    float CallFunc_BreakVector2D_Y;                                                   // 0x15060 (size: 0x4)
    float CallFunc_BreakRotator_Roll_1;                                               // 0x15064 (size: 0x4)
    float CallFunc_BreakRotator_Pitch_1;                                              // 0x15068 (size: 0x4)
    float CallFunc_BreakRotator_Yaw_1;                                                // 0x1506C (size: 0x4)
    class UJoyEasingInterpolator* CallFunc_StartEasingInterpolator__interpolatorObject_1; // 0x15070 (size: 0x8)
    class UJoyEasingInterpolator* CallFunc_StartEasingInterpolator_ReturnValue_1;     // 0x15078 (size: 0x8)
    bool CallFunc_IsValid_ReturnValue_5;                                              // 0x15080 (size: 0x1)
    float Temp_float_Variable_98;                                                     // 0x15084 (size: 0x4)
    float CallFunc_BreakRotator_Roll_2;                                               // 0x15088 (size: 0x4)
    float CallFunc_BreakRotator_Pitch_2;                                              // 0x1508C (size: 0x4)
    float CallFunc_BreakRotator_Yaw_2;                                                // 0x15090 (size: 0x4)
    float K2Node_CustomEvent_Ratio_1;                                                 // 0x15094 (size: 0x4)
    FABP_Cat_New_CK2Node_CreateDelegate_OutputDelegate K2Node_CreateDelegate_OutputDelegate; // 0x15098 (size: 0x10)
    void InterpolatorTickOutputPin(float bpp__Ratio__pf);
    FABP_Cat_New_CK2Node_CreateDelegate_OutputDelegate_1 K2Node_CreateDelegate_OutputDelegate_1; // 0x150A8 (size: 0x10)
    void InterpolatorCompleteOutputPin();
    float Temp_float_Variable_99;                                                     // 0x150B8 (size: 0x4)
    float CallFunc_Array_Get_Item;                                                    // 0x150BC (size: 0x4)
    float CallFunc_Array_Get_Item_1;                                                  // 0x150C0 (size: 0x4)
    float CallFunc_Array_Get_Item_2;                                                  // 0x150C4 (size: 0x4)
    float CallFunc_Array_Get_Item_3;                                                  // 0x150C8 (size: 0x4)
    float CallFunc_Array_Get_Item_4;                                                  // 0x150CC (size: 0x4)
    float CallFunc_Array_Get_Item_5;                                                  // 0x150D0 (size: 0x4)
    float CallFunc_Array_Get_Item_6;                                                  // 0x150D4 (size: 0x4)
    float CallFunc_Array_Get_Item_7;                                                  // 0x150D8 (size: 0x4)
    float CallFunc_Array_Get_Item_8;                                                  // 0x150DC (size: 0x4)
    float CallFunc_Array_Get_Item_9;                                                  // 0x150E0 (size: 0x4)
    float CallFunc_Array_Get_Item_10;                                                 // 0x150E4 (size: 0x4)
    float CallFunc_Array_Get_Item_11;                                                 // 0x150E8 (size: 0x4)
    float CallFunc_Array_Get_Item_12;                                                 // 0x150EC (size: 0x4)
    float CallFunc_Array_Get_Item_13;                                                 // 0x150F0 (size: 0x4)
    float CallFunc_Array_Get_Item_14;                                                 // 0x150F4 (size: 0x4)
    float CallFunc_Array_Get_Item_15;                                                 // 0x150F8 (size: 0x4)
    float CallFunc_Array_Get_Item_16;                                                 // 0x150FC (size: 0x4)
    float CallFunc_Array_Get_Item_17;                                                 // 0x15100 (size: 0x4)
    float CallFunc_Array_Get_Item_18;                                                 // 0x15104 (size: 0x4)
    float CallFunc_Array_Get_Item_19;                                                 // 0x15108 (size: 0x4)
    float CallFunc_Array_Get_Item_20;                                                 // 0x1510C (size: 0x4)
    float CallFunc_Array_Get_Item_21;                                                 // 0x15110 (size: 0x4)
    float CallFunc_Array_Get_Item_22;                                                 // 0x15114 (size: 0x4)
    float CallFunc_Array_Get_Item_23;                                                 // 0x15118 (size: 0x4)
    float CallFunc_Array_Get_Item_24;                                                 // 0x1511C (size: 0x4)
    float CallFunc_Array_Get_Item_25;                                                 // 0x15120 (size: 0x4)
    float CallFunc_Array_Get_Item_26;                                                 // 0x15124 (size: 0x4)
    class USoundBase* Temp_object_Variable_222;                                       // 0x15128 (size: 0x8)
    class USoundBase* Temp_object_Variable_223;                                       // 0x15130 (size: 0x8)
    class USoundBase* Temp_object_Variable_224;                                       // 0x15138 (size: 0x8)
    class USoundBase* Temp_object_Variable_225;                                       // 0x15140 (size: 0x8)
    class USoundBase* Temp_object_Variable_226;                                       // 0x15148 (size: 0x8)
    class USoundBase* Temp_object_Variable_227;                                       // 0x15150 (size: 0x8)
    class USoundBase* Temp_object_Variable_228;                                       // 0x15158 (size: 0x8)
    class USoundBase* Temp_object_Variable_229;                                       // 0x15160 (size: 0x8)
    class USoundBase* Temp_object_Variable_230;                                       // 0x15168 (size: 0x8)
    class USoundBase* Temp_object_Variable_231;                                       // 0x15170 (size: 0x8)
    TEnumAsByte<EPhysicalSurface> Temp_byte_Variable_12;                              // 0x15178 (size: 0x1)
    class USoundBase* Temp_object_Variable_232;                                       // 0x15180 (size: 0x8)
    class USoundBase* Temp_object_Variable_233;                                       // 0x15188 (size: 0x8)
    float K2Node_CustomEvent_Ratio;                                                   // 0x15190 (size: 0x4)
    FABP_Cat_New_CK2Node_CreateDelegate_OutputDelegate_2 K2Node_CreateDelegate_OutputDelegate_2; // 0x15194 (size: 0x10)
    void InterpolatorTickOutputPin(float bpp__Ratio__pf);
    float K2Node_Event_DeltaTimeX;                                                    // 0x151A4 (size: 0x4)
    FABP_Cat_New_CK2Node_CreateDelegate_OutputDelegate_3 K2Node_CreateDelegate_OutputDelegate_3; // 0x151A8 (size: 0x10)
    void InterpolatorCompleteOutputPin();
    class ABP_CatPawn_C* K2Node_DynamicCast_AsBP_Cat_Pawn;                            // 0x151B8 (size: 0x8)
    bool K2Node_DynamicCast_bSuccess;                                                 // 0x151C0 (size: 0x1)
    bool Temp_bool_Has_Been_Initd_Variable_1;                                         // 0x151C1 (size: 0x1)
    FJumpBlock CallFunc_GetCurrentJumpBlock_ReturnValue;                              // 0x151D0 (size: 0xD0)
    bool Temp_bool_IsClosed_Variable_1;                                               // 0x152A0 (size: 0x1)
    FCustomAnimation CallFunc_GetCustomAnimation_ReturnValue;                         // 0x152B0 (size: 0x50)
    FCustomAnimation CallFunc_GetCustomAnimation_ReturnValue_1;                       // 0x15300 (size: 0x50)
    FName K2Node_Event_Name;                                                          // 0x15350 (size: 0x8)
    float K2Node_Event_Velocity;                                                      // 0x15358 (size: 0x4)
    bool K2Node_SwitchName_CmpSuccess;                                                // 0x1535C (size: 0x1)
    class USoundBase* Temp_object_Variable_234;                                       // 0x15360 (size: 0x8)
    FJumpData K2Node_Event__jumpData;                                                 // 0x15370 (size: 0x460)
    FJumpBlock CallFunc_GetCurrentJumpBlock_ReturnValue_1;                            // 0x157D0 (size: 0xD0)
    TArray<class AActor*> K2Node_MakeArray_Array;                                     // 0x158A0 (size: 0x10)
    TArray<class AActor*> K2Node_MakeArray_Array_1;                                   // 0x158B0 (size: 0x10)
    FHitResult CallFunc_LineTraceSingle_OutHit;                                       // 0x158C0 (size: 0x88)
    FHitResult CallFunc_LineTraceSingle_OutHit_1;                                     // 0x15948 (size: 0x88)
    bool CallFunc_BreakHitResult_bBlockingHit;                                        // 0x159D0 (size: 0x1)
    bool CallFunc_BreakHitResult_bInitialOverlap;                                     // 0x159D1 (size: 0x1)
    float CallFunc_BreakHitResult_Time;                                               // 0x159D4 (size: 0x4)
    float CallFunc_BreakHitResult_Distance;                                           // 0x159D8 (size: 0x4)
    FVector CallFunc_BreakHitResult_Location;                                         // 0x159DC (size: 0xC)
    FVector CallFunc_BreakHitResult_ImpactPoint;                                      // 0x159E8 (size: 0xC)
    FVector CallFunc_BreakHitResult_Normal;                                           // 0x159F4 (size: 0xC)
    FVector CallFunc_BreakHitResult_ImpactNormal;                                     // 0x15A00 (size: 0xC)
    class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat;                         // 0x15A10 (size: 0x8)
    class AActor* CallFunc_BreakHitResult_HitActor;                                   // 0x15A18 (size: 0x8)
    class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent;                  // 0x15A20 (size: 0x8)
    FName CallFunc_BreakHitResult_HitBoneName;                                        // 0x15A28 (size: 0x8)
    int32 CallFunc_BreakHitResult_HitItem;                                            // 0x15A30 (size: 0x4)
    int32 CallFunc_BreakHitResult_ElementIndex;                                       // 0x15A34 (size: 0x4)
    int32 CallFunc_BreakHitResult_FaceIndex;                                          // 0x15A38 (size: 0x4)
    FVector CallFunc_BreakHitResult_TraceStart;                                       // 0x15A3C (size: 0xC)
    FVector CallFunc_BreakHitResult_TraceEnd;                                         // 0x15A48 (size: 0xC)
    bool CallFunc_BreakHitResult_bBlockingHit_1;                                      // 0x15A54 (size: 0x1)
    bool CallFunc_BreakHitResult_bInitialOverlap_1;                                   // 0x15A55 (size: 0x1)
    float CallFunc_BreakHitResult_Time_1;                                             // 0x15A58 (size: 0x4)
    float CallFunc_BreakHitResult_Distance_1;                                         // 0x15A5C (size: 0x4)
    FVector CallFunc_BreakHitResult_Location_1;                                       // 0x15A60 (size: 0xC)
    FVector CallFunc_BreakHitResult_ImpactPoint_1;                                    // 0x15A6C (size: 0xC)
    FVector CallFunc_BreakHitResult_Normal_1;                                         // 0x15A78 (size: 0xC)
    FVector CallFunc_BreakHitResult_ImpactNormal_1;                                   // 0x15A84 (size: 0xC)
    class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat_1;                       // 0x15A90 (size: 0x8)
    class AActor* CallFunc_BreakHitResult_HitActor_1;                                 // 0x15A98 (size: 0x8)
    class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent_1;                // 0x15AA0 (size: 0x8)
    FName CallFunc_BreakHitResult_HitBoneName_1;                                      // 0x15AA8 (size: 0x8)
    int32 CallFunc_BreakHitResult_HitItem_1;                                          // 0x15AB0 (size: 0x4)
    int32 CallFunc_BreakHitResult_ElementIndex_1;                                     // 0x15AB4 (size: 0x4)
    int32 CallFunc_BreakHitResult_FaceIndex_1;                                        // 0x15AB8 (size: 0x4)
    FVector CallFunc_BreakHitResult_TraceStart_1;                                     // 0x15ABC (size: 0xC)
    FVector CallFunc_BreakHitResult_TraceEnd_1;                                       // 0x15AC8 (size: 0xC)
    class UParticleSystem* K2Node_Select_Default_6;                                   // 0x15AD8 (size: 0x8)
    class UParticleSystem* K2Node_Select_Default_7;                                   // 0x15AE0 (size: 0x8)
    TArray<class AActor*> K2Node_MakeArray_Array_2;                                   // 0x15AE8 (size: 0x10)
    TArray<class AActor*> K2Node_MakeArray_Array_3;                                   // 0x15AF8 (size: 0x10)
    FHitResult CallFunc_LineTraceSingle_OutHit_2;                                     // 0x15B08 (size: 0x88)
    FHitResult CallFunc_LineTraceSingle_OutHit_3;                                     // 0x15B90 (size: 0x88)
    bool CallFunc_BreakHitResult_bBlockingHit_2;                                      // 0x15C18 (size: 0x1)
    bool CallFunc_BreakHitResult_bInitialOverlap_2;                                   // 0x15C19 (size: 0x1)
    float CallFunc_BreakHitResult_Time_2;                                             // 0x15C1C (size: 0x4)
    float CallFunc_BreakHitResult_Distance_2;                                         // 0x15C20 (size: 0x4)
    FVector CallFunc_BreakHitResult_Location_2;                                       // 0x15C24 (size: 0xC)
    FVector CallFunc_BreakHitResult_ImpactPoint_2;                                    // 0x15C30 (size: 0xC)
    FVector CallFunc_BreakHitResult_Normal_2;                                         // 0x15C3C (size: 0xC)
    FVector CallFunc_BreakHitResult_ImpactNormal_2;                                   // 0x15C48 (size: 0xC)
    class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat_2;                       // 0x15C58 (size: 0x8)
    class AActor* CallFunc_BreakHitResult_HitActor_2;                                 // 0x15C60 (size: 0x8)
    class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent_2;                // 0x15C68 (size: 0x8)
    FName CallFunc_BreakHitResult_HitBoneName_2;                                      // 0x15C70 (size: 0x8)
    int32 CallFunc_BreakHitResult_HitItem_2;                                          // 0x15C78 (size: 0x4)
    int32 CallFunc_BreakHitResult_ElementIndex_2;                                     // 0x15C7C (size: 0x4)
    int32 CallFunc_BreakHitResult_FaceIndex_2;                                        // 0x15C80 (size: 0x4)
    FVector CallFunc_BreakHitResult_TraceStart_2;                                     // 0x15C84 (size: 0xC)
    FVector CallFunc_BreakHitResult_TraceEnd_2;                                       // 0x15C90 (size: 0xC)
    bool CallFunc_BreakHitResult_bBlockingHit_3;                                      // 0x15C9C (size: 0x1)
    bool CallFunc_BreakHitResult_bInitialOverlap_3;                                   // 0x15C9D (size: 0x1)
    float CallFunc_BreakHitResult_Time_3;                                             // 0x15CA0 (size: 0x4)
    float CallFunc_BreakHitResult_Distance_3;                                         // 0x15CA4 (size: 0x4)
    FVector CallFunc_BreakHitResult_Location_3;                                       // 0x15CA8 (size: 0xC)
    FVector CallFunc_BreakHitResult_ImpactPoint_3;                                    // 0x15CB4 (size: 0xC)
    FVector CallFunc_BreakHitResult_Normal_3;                                         // 0x15CC0 (size: 0xC)
    FVector CallFunc_BreakHitResult_ImpactNormal_3;                                   // 0x15CCC (size: 0xC)
    class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat_3;                       // 0x15CD8 (size: 0x8)
    class AActor* CallFunc_BreakHitResult_HitActor_3;                                 // 0x15CE0 (size: 0x8)
    class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent_3;                // 0x15CE8 (size: 0x8)
    FName CallFunc_BreakHitResult_HitBoneName_3;                                      // 0x15CF0 (size: 0x8)
    int32 CallFunc_BreakHitResult_HitItem_3;                                          // 0x15CF8 (size: 0x4)
    int32 CallFunc_BreakHitResult_ElementIndex_3;                                     // 0x15CFC (size: 0x4)
    int32 CallFunc_BreakHitResult_FaceIndex_3;                                        // 0x15D00 (size: 0x4)
    FVector CallFunc_BreakHitResult_TraceStart_3;                                     // 0x15D04 (size: 0xC)
    FVector CallFunc_BreakHitResult_TraceEnd_3;                                       // 0x15D10 (size: 0xC)
    class UParticleSystem* K2Node_Select_Default_8;                                   // 0x15D20 (size: 0x8)
    class UParticleSystem* K2Node_Select_Default_9;                                   // 0x15D28 (size: 0x8)
    class USoundBase* Temp_object_Variable_235;                                       // 0x15D30 (size: 0x8)
    class USoundBase* Temp_object_Variable_236;                                       // 0x15D38 (size: 0x8)
    float K2Node_CustomEvent_velocity_2;                                              // 0x15D40 (size: 0x4)
    class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x15D48 (size: 0x8)
    bool Temp_bool_Has_Been_Initd_Variable_2;                                         // 0x15D50 (size: 0x1)
    class USoundBase* Temp_object_Variable_237;                                       // 0x15D58 (size: 0x8)
    class USoundBase* Temp_object_Variable_238;                                       // 0x15D60 (size: 0x8)
    class USoundBase* Temp_object_Variable_239;                                       // 0x15D68 (size: 0x8)
    bool Temp_bool_IsClosed_Variable_2;                                               // 0x15D70 (size: 0x1)
    float K2Node_CustomEvent_velocity_1;                                              // 0x15D74 (size: 0x4)
    float K2Node_CustomEvent_velocity;                                                // 0x15D78 (size: 0x4)
    class USoundBase* Temp_object_Variable_240;                                       // 0x15D80 (size: 0x8)
    float CallFunc_BreakRotator_Roll_3;                                               // 0x15D88 (size: 0x4)
    float CallFunc_BreakRotator_Pitch_3;                                              // 0x15D8C (size: 0x4)
    float CallFunc_BreakRotator_Yaw_3;                                                // 0x15D90 (size: 0x4)
    class USoundBase* Temp_object_Variable_241;                                       // 0x15D98 (size: 0x8)
    float K2Node_CustomEvent_delta_time;                                              // 0x15DA0 (size: 0x4)
    TScriptInterface<class II_notifiable_by_footstep_C> K2Node_DynamicCast_AsI_Notifiable_By_Footstep; // 0x15DA8 (size: 0x10)
    bool K2Node_DynamicCast_bSuccess_1;                                               // 0x15DB8 (size: 0x1)
    class USoundBase* Temp_object_Variable_242;                                       // 0x15DC0 (size: 0x8)
    FCustomAnimation CallFunc_GetCustomAnimation_ReturnValue_2;                       // 0x15DD0 (size: 0x50)
    bool Temp_bool_Has_Been_Initd_Variable_3;                                         // 0x15E20 (size: 0x1)
    class USoundBase* Temp_object_Variable_243;                                       // 0x15E28 (size: 0x8)
    class USoundBase* Temp_object_Variable_244;                                       // 0x15E30 (size: 0x8)
    float CallFunc_BreakRotator_Roll_4;                                               // 0x15E38 (size: 0x4)
    float CallFunc_BreakRotator_Pitch_4;                                              // 0x15E3C (size: 0x4)
    float CallFunc_BreakRotator_Yaw_4;                                                // 0x15E40 (size: 0x4)
    float CallFunc_BreakVector_X;                                                     // 0x15E44 (size: 0x4)
    float CallFunc_BreakVector_Y;                                                     // 0x15E48 (size: 0x4)
    float CallFunc_BreakVector_Z;                                                     // 0x15E4C (size: 0x4)
    float CallFunc_BreakVector_X_1;                                                   // 0x15E50 (size: 0x4)
    float CallFunc_BreakVector_Y_1;                                                   // 0x15E54 (size: 0x4)
    float CallFunc_BreakVector_Z_1;                                                   // 0x15E58 (size: 0x4)
    class USoundBase* Temp_object_Variable_245;                                       // 0x15E60 (size: 0x8)
    E_UTurnType CallFunc_ComputeTurningType_TurnType;                                 // 0x15E68 (size: 0x1)
    class AAudioManager* CallFunc_GetAudioManager_AudioManager;                       // 0x15E70 (size: 0x8)
    bool CallFunc_is_cat_in_a_discretion_zone_is_discretion_zone;                     // 0x15E78 (size: 0x1)
    float CallFunc_BreakRotator_Roll_5;                                               // 0x15E7C (size: 0x4)
    float CallFunc_BreakRotator_Pitch_5;                                              // 0x15E80 (size: 0x4)
    float CallFunc_BreakRotator_Yaw_5;                                                // 0x15E84 (size: 0x4)
    float CallFunc_BreakRotator_Roll_6;                                               // 0x15E88 (size: 0x4)
    float CallFunc_BreakRotator_Pitch_6;                                              // 0x15E8C (size: 0x4)
    float CallFunc_BreakRotator_Yaw_6;                                                // 0x15E90 (size: 0x4)
    FVector K2Node_Select_Default_10;                                                 // 0x15E94 (size: 0xC)
    class UHKAnimInstance* K2Node_DynamicCast_AsABP_Cat_Paw_Push;                     // 0x15EA0 (size: 0x8)
    bool K2Node_DynamicCast_bSuccess_2;                                               // 0x15EA8 (size: 0x1)
    FVector K2Node_Select_Default_11;                                                 // 0x15EAC (size: 0xC)
    bool Temp_bool_IsClosed_Variable_3;                                               // 0x15EB8 (size: 0x1)
    FCustomAnimation K2Node_Select_Default_12;                                        // 0x15EC0 (size: 0x50)
    FCustomAnimation K2Node_Select_Default_13;                                        // 0x15F10 (size: 0x50)
    class USoundBase* Temp_object_Variable_246;                                       // 0x15F60 (size: 0x8)
    class USoundBase* Temp_object_Variable_247;                                       // 0x15F68 (size: 0x8)
    class USoundBase* Temp_object_Variable_248;                                       // 0x15F70 (size: 0x8)
    class USoundBase* Temp_object_Variable_249;                                       // 0x15F78 (size: 0x8)
    class USoundBase* Temp_object_Variable_250;                                       // 0x15F80 (size: 0x8)
    int32 CallFunc_InternalBreakableDelay_ReturnValue_2;                              // 0x15F88 (size: 0x4)
    bool CallFunc_InternalBreakBreakableDelay_ReturnValue_2;                          // 0x15F8C (size: 0x1)
    class UAnimSequence* K2Node_Event__interpolateAnimation;                          // 0x15F90 (size: 0x8)
    class UAnimSequence* K2Node_Select_Default_14;                                    // 0x15F98 (size: 0x8)
    int32 CallFunc_InternalBreakableDelay_ReturnValue_3;                              // 0x15FA0 (size: 0x4)
    class USoundBase* Temp_object_Variable_251;                                       // 0x15FA8 (size: 0x8)
    class USoundBase* Temp_object_Variable_252;                                       // 0x15FB0 (size: 0x8)
    int32 CallFunc_InternalBreakableDelay_ReturnValue_4;                              // 0x15FB8 (size: 0x4)
    class USoundBase* Temp_object_Variable_253;                                       // 0x15FC0 (size: 0x8)
    class USoundBase* Temp_object_Variable_254;                                       // 0x15FC8 (size: 0x8)
    FJumpData CallFunc_GetCurrentJumpData_ReturnValue;                                // 0x15FD0 (size: 0x460)
    int32 CallFunc_InternalBreakableDelay_ReturnValue_5;                              // 0x16430 (size: 0x4)
    bool CallFunc_InternalBreakBreakableDelay_ReturnValue_5;                          // 0x16434 (size: 0x1)
    FJumpData CallFunc_GetCurrentJumpData_ReturnValue_1;                              // 0x16440 (size: 0x460)
    E_MainPaw K2Node_CustomEvent_Paw;                                                 // 0x168A0 (size: 0x1)
    E_MainPaw K2Node_Select_Default_15;                                               // 0x168A1 (size: 0x1)
    class UHKAnimInstance* K2Node_DynamicCast_AsABP_Cat_Cage;                         // 0x168A8 (size: 0x8)
    bool K2Node_DynamicCast_bSuccess_3;                                               // 0x168B0 (size: 0x1)
    FCustomAnimation K2Node_Select_Default_16;                                        // 0x168C0 (size: 0x50)
    class UCatMoveToUsableComponent* K2Node_DynamicCast_AsCOMP_Cat_Scratchable_Component; // 0x16910 (size: 0x8)
    bool K2Node_DynamicCast_bSuccess_4;                                               // 0x16918 (size: 0x1)
    class USoundBase* Temp_object_Variable_255;                                       // 0x16920 (size: 0x8)
    FLinearColor K2Node_Select_Default_17;                                            // 0x16928 (size: 0x10)
    class AActor* K2Node_DynamicCast_AsBP_Cat_Button_Pushable_Paint_Bucket;           // 0x16938 (size: 0x8)
    bool K2Node_DynamicCast_bSuccess_5;                                               // 0x16940 (size: 0x1)
    float K2Node_Select_Default_18;                                                   // 0x16944 (size: 0x4)
    class AActor* K2Node_DynamicCast_AsBP_Simple_Paint_Splat;                         // 0x16948 (size: 0x8)
    bool K2Node_DynamicCast_bSuccess_6;                                               // 0x16950 (size: 0x1)
    float K2Node_Select_Default_19;                                                   // 0x16954 (size: 0x4)
    float K2Node_Select_Default_20;                                                   // 0x16958 (size: 0x4)
    class USoundBase* K2Node_Select_Default_21;                                       // 0x16960 (size: 0x8)
    TScriptInterface<class II_notifiable_by_footstep_C> K2Node_DynamicCast_AsI_Notifiable_By_Footstep_1; // 0x16968 (size: 0x10)
    bool K2Node_DynamicCast_bSuccess_7;                                               // 0x16978 (size: 0x1)
    class USoundBase* K2Node_Select_Default_22;                                       // 0x16980 (size: 0x8)
    class USoundBase* K2Node_Select_Default_23;                                       // 0x16988 (size: 0x8)
    class USoundBase* Temp_object_Variable_256;                                       // 0x16990 (size: 0x8)
    class USoundBase* K2Node_Select_Default_24;                                       // 0x16998 (size: 0x8)
    int32 K2Node_Select_Default_25;                                                   // 0x169A0 (size: 0x4)
    float CallFunc_BreakVector_X_2;                                                   // 0x169A4 (size: 0x4)
    float CallFunc_BreakVector_Y_2;                                                   // 0x169A8 (size: 0x4)
    float CallFunc_BreakVector_Z_2;                                                   // 0x169AC (size: 0x4)
    FJumpBlock CallFunc_GetCurrentJumpBlock_ReturnValue_2;                            // 0x169B0 (size: 0xD0)
    float CallFunc_BreakVector2D_X_1;                                                 // 0x16A80 (size: 0x4)
    float CallFunc_BreakVector2D_Y_1;                                                 // 0x16A84 (size: 0x4)

    void Update Shake();
    void Update sfx(float bpp__deltaxtime__pfT);
    void Update Look At();
    void Update Idles();
    void Update FootStep Material();
    void Update Eyes();
    void Update Ears();
    void Update CinematicBlend();
    void Update Breath();
    void Update Blink();
    void Update Bend();
    void UpdateWalk();
    void UpdateUTurn();
    void UpdateScriptedJump();
    void UpdateJump();
    void UpdateInterpolate();
    void UpdateHanging();
    void UpdateDeath();
    void UpdateCustomAnimation();
    void UpdateAttitude();
    void Tick_6246EF4646E19036986D72BA83CC9956(float bpp__Ratio__pf);
    void Tick_6246EF4646E19036986D72BA0F3696AA(float bpp__Ratio__pf);
    void Tail Anim();
    void SyncJumpPlayRate();
    void sfxLand(float bpp__velocity__pf);
    void sfxJump(float bpp__velocity__pf);
    void sfxFootstep(float bpp__velocity__pf);
