#ifndef UE4SS_SDK_B12Flat_BP_HPP
#define UE4SS_SDK_B12Flat_BP_HPP

class AB12Flat_BP_C : public AActor
{
    class UStaticMeshComponent* B12Flat_Living_Room;                                  // 0x0228 (size: 0x8)
    class UStaticMeshComponent* B12Flat_Hidden_Lab;                                   // 0x0230 (size: 0x8)
    class UStaticMeshComponent* B12Flat_Hall;                                         // 0x0238 (size: 0x8)
    class UStaticMeshComponent* B12Flat_Ext;                                          // 0x0240 (size: 0x8)
    class UStaticMeshComponent* B12Flat_Computer_Room;                                // 0x0248 (size: 0x8)
    class UStaticMeshComponent* B12Flat_Bedoom;                                       // 0x0250 (size: 0x8)
    class UStaticMeshComponent* B12_Flat_Chamfer;                                     // 0x0258 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0260 (size: 0x8)

}; // Size: 0x268

#endif
