#ifndef UE4SS_SDK_BP_Bat_Random_HPP
#define UE4SS_SDK_BP_Bat_Random_HPP

class ABP_Bat_Random_C : public AActor
{
    class UStaticMeshComponent* StaticMesh30;                                         // 0x0228 (size: 0x8)
    class UStaticMeshComponent* StaticMesh29;                                         // 0x0230 (size: 0x8)
    class UStaticMeshComponent* StaticMesh28;                                         // 0x0238 (size: 0x8)
    class UStaticMeshComponent* StaticMesh27;                                         // 0x0240 (size: 0x8)
    class UStaticMeshComponent* StaticMesh26;                                         // 0x0248 (size: 0x8)
    class UStaticMeshComponent* StaticMesh25;                                         // 0x0250 (size: 0x8)
    class UStaticMeshComponent* StaticMesh24;                                         // 0x0258 (size: 0x8)
    class UStaticMeshComponent* StaticMesh23;                                         // 0x0260 (size: 0x8)
    class UStaticMeshComponent* StaticMesh22;                                         // 0x0268 (size: 0x8)
    class UStaticMeshComponent* StaticMesh21;                                         // 0x0270 (size: 0x8)
    class UStaticMeshComponent* StaticMesh20;                                         // 0x0278 (size: 0x8)
    class UStaticMeshComponent* StaticMesh19;                                         // 0x0280 (size: 0x8)
    class UStaticMeshComponent* StaticMesh18;                                         // 0x0288 (size: 0x8)
    class UStaticMeshComponent* StaticMesh17;                                         // 0x0290 (size: 0x8)
    class UStaticMeshComponent* StaticMesh16;                                         // 0x0298 (size: 0x8)
    class UStaticMeshComponent* StaticMesh15;                                         // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh14;                                         // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh13;                                         // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh12;                                         // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh11;                                         // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0300 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0308 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0310 (size: 0x8)
    class UStaticMeshComponent* Bat;                                                  // 0x0318 (size: 0x8)
    TArray<class UStaticMesh*> Windows_100x80;                                        // 0x0320 (size: 0x10)
    TArray<class UStaticMesh*> Windows_130x130;                                       // 0x0330 (size: 0x10)
    TArray<class UStaticMesh*> Windows_130x50;                                        // 0x0340 (size: 0x10)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_1;                                     // 0x0350 (size: 0x1)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_2;                                     // 0x0351 (size: 0x1)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_3;                                     // 0x0352 (size: 0x1)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_4;                                     // 0x0353 (size: 0x1)
    int32 MeshesIndex_1;                                                              // 0x0354 (size: 0x4)
    TArray<class UStaticMesh*> Nothing;                                               // 0x0358 (size: 0x10)
    FRandomStream Random;                                                             // 0x0368 (size: 0x8)
    bool New_Seed;                                                                    // 0x0370 (size: 0x1)
    int32 MeshesIndex_2;                                                              // 0x0374 (size: 0x4)
    int32 MeshesIndex_3;                                                              // 0x0378 (size: 0x4)
    int32 MeshesIndex_4;                                                              // 0x037C (size: 0x4)
    TArray<class UStaticMesh*> Curtains;                                              // 0x0380 (size: 0x10)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_5;                                     // 0x0390 (size: 0x1)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_6;                                     // 0x0391 (size: 0x1)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_7;                                     // 0x0392 (size: 0x1)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_8;                                     // 0x0393 (size: 0x1)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_9;                                     // 0x0394 (size: 0x1)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_10;                                    // 0x0395 (size: 0x1)
    int32 MeshesIndex_5;                                                              // 0x0398 (size: 0x4)
    int32 MeshesIndex_6;                                                              // 0x039C (size: 0x4)
    int32 MeshesIndex_7;                                                              // 0x03A0 (size: 0x4)
    int32 MeshesIndex_8;                                                              // 0x03A4 (size: 0x4)
    int32 MeshesIndex_9;                                                              // 0x03A8 (size: 0x4)
    int32 MeshesIndex_10;                                                             // 0x03AC (size: 0x4)
    TArray<class UStaticMesh*> Grid_100x80;                                           // 0x03B0 (size: 0x10)
    TArray<class UStaticMesh*> Grid_130x130;                                          // 0x03C0 (size: 0x10)
    TArray<class UStaticMesh*> Grid_130x50;                                           // 0x03D0 (size: 0x10)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_11;                                    // 0x03E0 (size: 0x1)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_12;                                    // 0x03E1 (size: 0x1)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_13;                                    // 0x03E2 (size: 0x1)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_14;                                    // 0x03E3 (size: 0x1)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_15;                                    // 0x03E4 (size: 0x1)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_16;                                    // 0x03E5 (size: 0x1)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_17;                                    // 0x03E6 (size: 0x1)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_18;                                    // 0x03E7 (size: 0x1)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_19;                                    // 0x03E8 (size: 0x1)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_20;                                    // 0x03E9 (size: 0x1)
    int32 MeshesIndex_11;                                                             // 0x03EC (size: 0x4)
    int32 MeshesIndex_12;                                                             // 0x03F0 (size: 0x4)
    int32 MeshesIndex_13;                                                             // 0x03F4 (size: 0x4)
    int32 MeshesIndex_14;                                                             // 0x03F8 (size: 0x4)
    int32 MeshesIndex_15;                                                             // 0x03FC (size: 0x4)
    int32 MeshesIndex_16;                                                             // 0x0400 (size: 0x4)
    int32 MeshesIndex_17;                                                             // 0x0404 (size: 0x4)
    int32 MeshesIndex_18;                                                             // 0x0408 (size: 0x4)
    int32 MeshesIndex_19;                                                             // 0x040C (size: 0x4)
    int32 MeshesIndex_20;                                                             // 0x0410 (size: 0x4)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_21;                                    // 0x0414 (size: 0x1)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_22;                                    // 0x0415 (size: 0x1)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_23;                                    // 0x0416 (size: 0x1)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_24;                                    // 0x0417 (size: 0x1)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_25;                                    // 0x0418 (size: 0x1)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_26;                                    // 0x0419 (size: 0x1)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_27;                                    // 0x041A (size: 0x1)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_28;                                    // 0x041B (size: 0x1)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_29;                                    // 0x041C (size: 0x1)
    TEnumAsByte<BP_Bat_Random_MeshEnum> Meshes_30;                                    // 0x041D (size: 0x1)
    int32 MeshesIndex_21;                                                             // 0x0420 (size: 0x4)
    int32 MeshesIndex_22;                                                             // 0x0424 (size: 0x4)
    int32 MeshesIndex_23;                                                             // 0x0428 (size: 0x4)
    int32 MeshesIndex_24;                                                             // 0x042C (size: 0x4)
    int32 MeshesIndex_25;                                                             // 0x0430 (size: 0x4)
    int32 MeshesIndex_26;                                                             // 0x0434 (size: 0x4)
    int32 MeshesIndex_27;                                                             // 0x0438 (size: 0x4)
    int32 MeshesIndex_28;                                                             // 0x043C (size: 0x4)
    int32 MeshesIndex_29;                                                             // 0x0440 (size: 0x4)
    int32 MeshesIndex_30;                                                             // 0x0444 (size: 0x4)
    class UMaterialInstance* Bat_Material;                                            // 0x0448 (size: 0x8)

    void UserConstructionScript();
}; // Size: 0x450

#endif
