#ifndef UE4SS_SDK_BP_base_bat_HPP
#define UE4SS_SDK_BP_base_bat_HPP

class ABP_base_bat_C : public AStaticMeshActor
{
    class UStaticMeshComponent* Chamfer_mesh;                                         // 0x0238 (size: 0x8)
    FName Collision Batiment;                                                         // 0x0240 (size: 0x8)
    FName Collision Doors;                                                            // 0x0248 (size: 0x8)
    class UStaticMesh* Batiment;                                                      // 0x0250 (size: 0x8)
    TArray<class UMaterialInstance*> Batiment_Material_inst;                          // 0x0258 (size: 0x10)
    class UStaticMesh* Chamfer;                                                       // 0x0268 (size: 0x8)
    class UMaterialInstance* Chamfer_Material_inst;                                   // 0x0270 (size: 0x8)
    bool New Seed ?;                                                                  // 0x0278 (size: 0x1)
    TArray<float> SI_Power;                                                           // 0x0280 (size: 0x10)
    TArray<FLinearColor> SI_colors;                                                   // 0x0290 (size: 0x10)
    FRandomStream Random_Stream;                                                      // 0x02A0 (size: 0x8)
    FString R_550;                                                                    // 0x02A8 (size: 0x10)
    FString W_150x500;                                                                // 0x02B8 (size: 0x10)
    FString W_120x60;                                                                 // 0x02C8 (size: 0x10)
    FString W_120x120;                                                                // 0x02D8 (size: 0x10)
    FString W_150x130;                                                                // 0x02E8 (size: 0x10)
    FString W_180x90;                                                                 // 0x02F8 (size: 0x10)
    FString W_180x180;                                                                // 0x0308 (size: 0x10)
    FString W_100x80;                                                                 // 0x0318 (size: 0x10)
    FString W_180x360;                                                                // 0x0328 (size: 0x10)
    FString W_Corner_180x550;                                                         // 0x0338 (size: 0x10)
    FString W_end_180x180;                                                            // 0x0348 (size: 0x10)
    FString W_start_180x180;                                                          // 0x0358 (size: 0x10)
    FString D_0365x120;                                                               // 0x0368 (size: 0x10)
    FString S_open_250x350;                                                           // 0x0378 (size: 0x10)
    FString S_open_200x250;                                                           // 0x0388 (size: 0x10)
    FString S_open_250x125;                                                           // 0x0398 (size: 0x10)
    FString S_250x350;                                                                // 0x03A8 (size: 0x10)
    FString S_200x250;                                                                // 0x03B8 (size: 0x10)
    FString S_250x125;                                                                // 0x03C8 (size: 0x10)
    FString W_cornerA_180x180;                                                        // 0x03D8 (size: 0x10)
    FString W_cornerB_180x180;                                                        // 0x03E8 (size: 0x10)
    FString W_cornerC_180x180;                                                        // 0x03F8 (size: 0x10)
    FString W_cornerD_180x180;                                                        // 0x0408 (size: 0x10)
    TArray<class UStaticMesh*> R_550_meshes;                                          // 0x0418 (size: 0x10)
    TArray<class UStaticMesh*> W_150x500_meshes;                                      // 0x0428 (size: 0x10)
    TArray<class UStaticMesh*> W_120x60_meshes;                                       // 0x0438 (size: 0x10)
    TArray<class UStaticMesh*> W_120x120_meshes;                                      // 0x0448 (size: 0x10)
    TArray<class UStaticMesh*> W_150x130_meshes;                                      // 0x0458 (size: 0x10)
    TArray<class UStaticMesh*> W_180x90_meshes;                                       // 0x0468 (size: 0x10)
    TArray<class UStaticMesh*> W_180x180_meshes;                                      // 0x0478 (size: 0x10)
    TArray<class UStaticMesh*> W_100x80_meshes;                                       // 0x0488 (size: 0x10)
    TArray<class UStaticMesh*> W_Corner_180x550_meshes;                               // 0x0498 (size: 0x10)
    TArray<class UStaticMesh*> W_180x360_meshes;                                      // 0x04A8 (size: 0x10)
    TArray<class UStaticMesh*> W_start_180x180_meshes;                                // 0x04B8 (size: 0x10)
    TArray<class UStaticMesh*> W_end_180x180_meshes;                                  // 0x04C8 (size: 0x10)
    TArray<class UStaticMesh*> W_cornerA_180x180_meshes;                              // 0x04D8 (size: 0x10)
    TArray<class UStaticMesh*> W_cornerB_180x180_meshes;                              // 0x04E8 (size: 0x10)
    TArray<class UStaticMesh*> W_cornerC_180x180_meshes;                              // 0x04F8 (size: 0x10)
    TArray<class UStaticMesh*> W_cornerD_180x180_meshes;                              // 0x0508 (size: 0x10)
    TArray<class UStaticMesh*> G_120x120_meshes;                                      // 0x0518 (size: 0x10)
    TArray<class UStaticMesh*> G_120x60_meshes;                                       // 0x0528 (size: 0x10)
    TArray<class UStaticMesh*> G_150x130_meshes;                                      // 0x0538 (size: 0x10)
    TArray<class UStaticMesh*> G_180x90_meshes;                                       // 0x0548 (size: 0x10)
    TArray<class UStaticMesh*> G_180x180_meshes;                                      // 0x0558 (size: 0x10)
    TArray<class UStaticMesh*> G_100x80_meshes;                                       // 0x0568 (size: 0x10)
    TArray<class UStaticMesh*> G_180x360_meshes;                                      // 0x0578 (size: 0x10)
    TArray<class UStaticMesh*> G_Corner_180x550_meshes;                               // 0x0588 (size: 0x10)
    TArray<class UStaticMesh*> G_start_180x180_meshes;                                // 0x0598 (size: 0x10)
    TArray<class UStaticMesh*> G_end_180x180_meshes;                                  // 0x05A8 (size: 0x10)
    TArray<class UStaticMesh*> I_120x60_meshes;                                       // 0x05B8 (size: 0x10)
    TArray<class UStaticMesh*> I_120x120_meshes;                                      // 0x05C8 (size: 0x10)
    TArray<class UStaticMesh*> I_150x130_meshes;                                      // 0x05D8 (size: 0x10)
    TArray<class UStaticMesh*> I_100x80_meshes;                                       // 0x05E8 (size: 0x10)
    TArray<class UStaticMesh*> I_180x180_meshes;                                      // 0x05F8 (size: 0x10)
    TArray<class UStaticMesh*> I_180x360_meshes;                                      // 0x0608 (size: 0x10)
    TArray<class UStaticMesh*> I_180x90_meshes;                                       // 0x0618 (size: 0x10)
    TArray<class UStaticMesh*> I_Corner_180x550_meshes;                               // 0x0628 (size: 0x10)
    TArray<class UStaticMesh*> I_start_180x180_meshes;                                // 0x0638 (size: 0x10)
    TArray<class UStaticMesh*> I_end_180x180_meshes;                                  // 0x0648 (size: 0x10)
    TArray<class UStaticMesh*> I_cornerA_180x180_meshes;                              // 0x0658 (size: 0x10)
    TArray<class UStaticMesh*> I_cornerB_180x180_meshes;                              // 0x0668 (size: 0x10)
    TArray<class UStaticMesh*> I_cornerC_180x180_meshes;                              // 0x0678 (size: 0x10)
    TArray<class UStaticMesh*> I_cornerD_180x180_meshes;                              // 0x0688 (size: 0x10)
    TArray<class UStaticMesh*> D_0365x120_meshes;                                     // 0x0698 (size: 0x10)
    TArray<class UStaticMesh*> S_open_200x250_meshes;                                 // 0x06A8 (size: 0x10)
    TArray<class UStaticMesh*> S_open_250x125_meshes;                                 // 0x06B8 (size: 0x10)
    TArray<class UStaticMesh*> S_open_250x350_meshes;                                 // 0x06C8 (size: 0x10)
    TArray<class UStaticMesh*> S_250x350_meshes;                                      // 0x06D8 (size: 0x10)
    TArray<class UStaticMesh*> S_200x250_meshes;                                      // 0x06E8 (size: 0x10)
    TArray<class UStaticMesh*> S_250x125_meshes;                                      // 0x06F8 (size: 0x10)
    TArray<class UTexture*> Interior_Textures;                                        // 0x0708 (size: 0x10)
    TArray<class UTexture*> Curtain_color_Textures;                                   // 0x0718 (size: 0x10)

    void Random_Interior(class UMaterialInstanceDynamic* Mat_Instance, float SI Power);
    void UserConstructionScript();
}; // Size: 0x728

#endif
