#ifndef UE4SS_SDK_BP_DeadEnd_Module_Kowloon_800_C_07_HPP
#define UE4SS_SDK_BP_DeadEnd_Module_Kowloon_800_C_07_HPP

class ABP_DeadEnd_Module_Kowloon_800_C_07_C : public AActor
{
    class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh3; // 0x0228 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh2; // 0x0230 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh1; // 0x0238 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh; // 0x0240 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0248 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0250 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0258 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0260 (size: 0x8)

}; // Size: 0x268

#endif
