#ifndef UE4SS_SDK_BP_Follow_Appart01_670x670_Full_Large_HPP
#define UE4SS_SDK_BP_Follow_Appart01_670x670_Full_Large_HPP

class ABP_Follow_Appart01_670x670_Full_Large_C : public AActor
{
    class UStaticMeshComponent* Follow_Appart_670x670_Full_Int_Chamfer;               // 0x0228 (size: 0x8)
    class UStaticMeshComponent* Windows_100x80_01_Windows_100x80_03;                  // 0x0230 (size: 0x8)
    class UStaticMeshComponent* Windows_100x80_01_Windows_100x80_01;                  // 0x0238 (size: 0x8)
    class UStaticMeshComponent* Follow_Appart01_670x530_Stairs3;                      // 0x0240 (size: 0x8)
    class UStaticMeshComponent* Follow_Appart01_670x530_Stairs2;                      // 0x0248 (size: 0x8)
    class UStaticMeshComponent* Follow_Appart01_670x530_Stairs1;                      // 0x0250 (size: 0x8)
    class UStaticMeshComponent* Follow_Appart01_670x530_Stairs;                       // 0x0258 (size: 0x8)
    class UStaticMeshComponent* Follow_Appart01_670x530_Interior;                     // 0x0260 (size: 0x8)
    class UStaticMeshComponent* Follow_Appart01_670x530;                              // 0x0268 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0270 (size: 0x8)

}; // Size: 0x278

#endif
