#ifndef UE4SS_SDK_BP_Ground_rythm02_HPP
#define UE4SS_SDK_BP_Ground_rythm02_HPP

class ABP_Ground_rythm02_C : public AActor
{
    class UStaticMeshComponent* StaticMesh11;                                         // 0x0228 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x0230 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x0238 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x0240 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0248 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0250 (size: 0x8)
    class UStaticMeshComponent* Cube;                                                 // 0x0258 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent03;                                // 0x0260 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent02;                                // 0x0268 (size: 0x8)
    class USceneComponent* SharedRoot;                                                // 0x0270 (size: 0x8)

}; // Size: 0x278

#endif
