#ifndef UE4SS_SDK_BP_Jumpstarter_05_HPP
#define UE4SS_SDK_BP_Jumpstarter_05_HPP

class ABP_Jumpstarter_05_C : public AActor
{
    class UStaticMeshComponent* Plate_Rusty_d;                                        // 0x0228 (size: 0x8)
    class UStaticMeshComponent* PG_Plasticbox_static;                                 // 0x0230 (size: 0x8)
    class UStaticMeshComponent* PG_Plasticbox_static1;                                // 0x0238 (size: 0x8)
    class UStaticMeshComponent* PG_Plasticbox_static2;                                // 0x0240 (size: 0x8)
    class UStaticMeshComponent* Plastic_Crate4;                                       // 0x0248 (size: 0x8)
    class UStaticMeshComponent* PG_Plasticbox_static7;                                // 0x0250 (size: 0x8)
    class UStaticMeshComponent* Plastic_Crate;                                        // 0x0258 (size: 0x8)
    class UStaticMeshComponent* Plastic_Crate1;                                       // 0x0260 (size: 0x8)
    class UStaticMeshComponent* PG_Plasticbox_static6;                                // 0x0268 (size: 0x8)
    class USplineRailComponent* SplineRail;                                           // 0x0270 (size: 0x8)
    class USceneComponent* SharedRoot;                                                // 0x0278 (size: 0x8)

}; // Size: 0x280

#endif
