#ifndef UE4SS_SDK_BP_Jumpstarter_12_HPP
#define UE4SS_SDK_BP_Jumpstarter_12_HPP

class ABP_Jumpstarter_12_C : public AActor
{
    class UStaticMeshComponent* Plastic_Bag_c1;                                       // 0x0228 (size: 0x8)
    class UStaticMeshComponent* PG_Plasticbox_static;                                 // 0x0230 (size: 0x8)
    class UStaticMeshComponent* PG_Plasticbox_static1;                                // 0x0238 (size: 0x8)
    class UStaticMeshComponent* PG_Plasticbox_static2;                                // 0x0240 (size: 0x8)
    class UStaticMeshComponent* Plastic_Bag_c;                                        // 0x0248 (size: 0x8)
    class UStaticMeshComponent* Plastic_Crate;                                        // 0x0250 (size: 0x8)
    class UStaticMeshComponent* Plastic_Crate1;                                       // 0x0258 (size: 0x8)
    class UStaticMeshComponent* Plate_Rusty_d;                                        // 0x0260 (size: 0x8)
    class UStaticMeshComponent* Plate_Rusty_d1;                                       // 0x0268 (size: 0x8)
    class UStaticMeshComponent* Plate_Rusty_d2;                                       // 0x0270 (size: 0x8)
    class UStaticMeshComponent* Plate_Rusty_d5;                                       // 0x0278 (size: 0x8)
    class UStaticMeshComponent* PropsGround_carton_1;                                 // 0x0280 (size: 0x8)
    class UStaticMeshComponent* Plastic_Crate2;                                       // 0x0288 (size: 0x8)
    class USplineRailComponent* SplineRail;                                           // 0x0290 (size: 0x8)
    class USceneComponent* SharedRoot;                                                // 0x0298 (size: 0x8)

}; // Size: 0x2A0

#endif
