#ifndef UE4SS_SDK_BP_Jumpstarter_10_HPP
#define UE4SS_SDK_BP_Jumpstarter_10_HPP

class ABP_Jumpstarter_10_C : public AActor
{
    class UStaticMeshComponent* Plastic_Crate4;                                       // 0x0228 (size: 0x8)
    class UStaticMeshComponent* trash_Palettes_1;                                     // 0x0230 (size: 0x8)
    class UStaticMeshComponent* PG_Plasticbox_static;                                 // 0x0238 (size: 0x8)
    class UStaticMeshComponent* Plastic_Crate1;                                       // 0x0240 (size: 0x8)
    class UStaticMeshComponent* Plastic_Crate2;                                       // 0x0248 (size: 0x8)
    class UStaticMeshComponent* Plastic_Crate3;                                       // 0x0250 (size: 0x8)
    class UStaticMeshComponent* PropsGround01_00;                                     // 0x0258 (size: 0x8)
    class UStaticMeshComponent* PropsGround01_06;                                     // 0x0260 (size: 0x8)
    class UStaticMeshComponent* PropsGround01_03;                                     // 0x0268 (size: 0x8)
    class UStaticMeshComponent* PropsGround_TrashBag_04;                              // 0x0270 (size: 0x8)
    class UStaticMeshComponent* PropsGround01_14;                                     // 0x0278 (size: 0x8)
    class UStaticMeshComponent* PropsGround01_15;                                     // 0x0280 (size: 0x8)
    class UStaticMeshComponent* PropsGround01_16;                                     // 0x0288 (size: 0x8)
    class UStaticMeshComponent* PropsGround01_12;                                     // 0x0290 (size: 0x8)
    class UStaticMeshComponent* PropsGround01_11;                                     // 0x0298 (size: 0x8)
    class UStaticMeshComponent* PropsGround01_10;                                     // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* PropsGround_TrashBag_01;                              // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* PropsGround01_01;                                     // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* Plastic_Crate;                                        // 0x02B8 (size: 0x8)
    class USplineRailComponent* SplineRail;                                           // 0x02C0 (size: 0x8)
    class USceneComponent* SharedRoot;                                                // 0x02C8 (size: 0x8)

}; // Size: 0x2D0

#endif
