#ifndef UE4SS_SDK_Bp_MetalHat_HPP
#define UE4SS_SDK_Bp_MetalHat_HPP

class ABp_MetalHat_C : public AActor
{
    class UChildActorComponent* BP_pearlcurtain9;                                     // 0x0228 (size: 0x8)
    class UChildActorComponent* BP_pearlcurtain16;                                    // 0x0230 (size: 0x8)
    class UChildActorComponent* BP_pearlcurtain15;                                    // 0x0238 (size: 0x8)
    class UChildActorComponent* BP_pearlcurtain14;                                    // 0x0240 (size: 0x8)
    class UChildActorComponent* BP_pearlcurtain13;                                    // 0x0248 (size: 0x8)
    class UChildActorComponent* BP_pearlcurtain12;                                    // 0x0250 (size: 0x8)
    class UChildActorComponent* BP_pearlcurtain11;                                    // 0x0258 (size: 0x8)
    class UChildActorComponent* BP_pearlcurtain10;                                    // 0x0260 (size: 0x8)
    class UChildActorComponent* BP_pearlcurtain17;                                    // 0x0268 (size: 0x8)
    class UChildActorComponent* BP_pearlcurtain24;                                    // 0x0270 (size: 0x8)
    class UChildActorComponent* BP_pearlcurtain23;                                    // 0x0278 (size: 0x8)
    class UChildActorComponent* BP_pearlcurtain2;                                     // 0x0280 (size: 0x8)
    class UChildActorComponent* BP_pearlcurtain21;                                    // 0x0288 (size: 0x8)
    class UChildActorComponent* BP_pearlcurtain20;                                    // 0x0290 (size: 0x8)
    class UChildActorComponent* BP_pearlcurtain19;                                    // 0x0298 (size: 0x8)
    class UChildActorComponent* BP_pearlcurtain18;                                    // 0x02A0 (size: 0x8)
    class UChildActorComponent* BP_pearlcurtain3;                                     // 0x02A8 (size: 0x8)
    class UChildActorComponent* BP_pearlcurtain4;                                     // 0x02B0 (size: 0x8)
    class UChildActorComponent* BP_pearlcurtain7;                                     // 0x02B8 (size: 0x8)
    class UChildActorComponent* BP_pearlcurtain8;                                     // 0x02C0 (size: 0x8)
    class UChildActorComponent* BP_pearlcurtain5;                                     // 0x02C8 (size: 0x8)
    class UChildActorComponent* BP_pearlcurtain6;                                     // 0x02D0 (size: 0x8)
    class UChildActorComponent* BP_pearlcurtain1;                                     // 0x02D8 (size: 0x8)
    class UChildActorComponent* BP_pearlcurtain22;                                    // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x02E8 (size: 0x8)

}; // Size: 0x2F0

#endif
