#ifndef UE4SS_SDK_BP_Metal_Scaffolding_HPP
#define UE4SS_SDK_BP_Metal_Scaffolding_HPP

class ABP_Metal_Scaffolding_C : public AActor
{
    class UBoxComponent* Box8;                                                        // 0x0228 (size: 0x8)
    class UBoxComponent* Box7;                                                        // 0x0230 (size: 0x8)
    class UBoxComponent* Box6;                                                        // 0x0238 (size: 0x8)
    class UBoxComponent* Box5;                                                        // 0x0240 (size: 0x8)
    class UBoxComponent* Box4;                                                        // 0x0248 (size: 0x8)
    class UBoxComponent* Box3;                                                        // 0x0250 (size: 0x8)
    class UBoxComponent* Box2;                                                        // 0x0258 (size: 0x8)
    class UBoxComponent* Box1;                                                        // 0x0260 (size: 0x8)
    class UStaticMeshComponent* SM_MERGED_BP_Metal_Scaffolding83;                     // 0x0268 (size: 0x8)
    class UBoxComponent* Box;                                                         // 0x0270 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0278 (size: 0x8)

}; // Size: 0x280

#endif
