#ifndef UE4SS_SDK_BP_porte_coulissante_cassee_HPP
#define UE4SS_SDK_BP_porte_coulissante_cassee_HPP

class ABP_porte_coulissante_cassee_C : public AStaticMeshActor
{
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0238 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0240 (size: 0x8)
    class UBoxComponent* Box3;                                                        // 0x0248 (size: 0x8)
    class UBoxComponent* Box6;                                                        // 0x0250 (size: 0x8)
    class UBoxComponent* Box5;                                                        // 0x0258 (size: 0x8)
    class UBoxComponent* Box2;                                                        // 0x0260 (size: 0x8)
    class UBoxComponent* Box1;                                                        // 0x0268 (size: 0x8)
    class UBoxComponent* Box;                                                         // 0x0270 (size: 0x8)

}; // Size: 0x278

#endif
