#ifndef UE4SS_SDK_BP_PanierOsier04_HPP
#define UE4SS_SDK_BP_PanierOsier04_HPP

class ABP_PanierOsier04_C : public AActor
{
    class UStaticMeshComponent* Cylinder;                                             // 0x0228 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0230 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0238 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent03;                                // 0x0240 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent02;                                // 0x0248 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent01;                                // 0x0250 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0;                                 // 0x0258 (size: 0x8)
    class USceneComponent* SharedRoot;                                                // 0x0260 (size: 0x8)

}; // Size: 0x268

#endif
