#ifndef UE4SS_SDK_BP_PoolTable_HPP
#define UE4SS_SDK_BP_PoolTable_HPP

class ABP_PoolTable_C : public AActor
{
    class UStaticMeshComponent* Plane;                                                // 0x0228 (size: 0x8)
    class UStaticMeshComponent* PoolTable_coll_01;                                    // 0x0230 (size: 0x8)
    class UStaticMeshComponent* PoolTable_coll_02;                                    // 0x0238 (size: 0x8)
    class UStaticMeshComponent* Cube21;                                               // 0x0240 (size: 0x8)
    class UStaticMeshComponent* Cube20;                                               // 0x0248 (size: 0x8)
    class UStaticMeshComponent* BlockAll;                                             // 0x0250 (size: 0x8)
    class UStaticMeshComponent* Walkable;                                             // 0x0258 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0260 (size: 0x8)

}; // Size: 0x268

#endif
