#ifndef UE4SS_SDK_BP_Residence_Bench_B2_HPP
#define UE4SS_SDK_BP_Residence_Bench_B2_HPP

class ABP_Residence_Bench_B2_C : public AActor
{
    class USplineRailComponent* SplineRail3;                                          // 0x0228 (size: 0x8)
    class USplineRailComponent* SplineRail2;                                          // 0x0230 (size: 0x8)
    class UStaticMeshComponent* Cube6;                                                // 0x0238 (size: 0x8)
    class UStaticMeshComponent* Cube5;                                                // 0x0240 (size: 0x8)
    class UStaticMeshComponent* Cube4;                                                // 0x0248 (size: 0x8)
    class UStaticMeshComponent* Cube3;                                                // 0x0250 (size: 0x8)
    class UStaticMeshComponent* Cube2;                                                // 0x0258 (size: 0x8)
    class UStaticMeshComponent* Cube1;                                                // 0x0260 (size: 0x8)
    class UStaticMeshComponent* Cube;                                                 // 0x0268 (size: 0x8)
    class USplineRailComponent* SplineRail;                                           // 0x0270 (size: 0x8)
    class UStaticMeshComponent* Midtown_Residence_Bench_B;                            // 0x0278 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0280 (size: 0x8)

}; // Size: 0x288

#endif
