#ifndef UE4SS_SDK_BP_Residence_Bench_A_HPP
#define UE4SS_SDK_BP_Residence_Bench_A_HPP

class ABP_Residence_Bench_A_C : public AActor
{
    class USplineRailComponent* SplineRail3;                                          // 0x0228 (size: 0x8)
    class USplineRailComponent* SplineRail2;                                          // 0x0230 (size: 0x8)
    class UStaticMeshComponent* Cube5;                                                // 0x0238 (size: 0x8)
    class UStaticMeshComponent* Cube4;                                                // 0x0240 (size: 0x8)
    class UStaticMeshComponent* Cube3;                                                // 0x0248 (size: 0x8)
    class UStaticMeshComponent* Cube2;                                                // 0x0250 (size: 0x8)
    class UStaticMeshComponent* Cube1;                                                // 0x0258 (size: 0x8)
    class UStaticMeshComponent* Cube;                                                 // 0x0260 (size: 0x8)
    class USplineRailComponent* SplineRail1;                                          // 0x0268 (size: 0x8)
    class USplineRailComponent* SplineRail;                                           // 0x0270 (size: 0x8)
    class UStaticMeshComponent* brush_06_08;                                          // 0x0278 (size: 0x8)
    class UStaticMeshComponent* brush_06_07;                                          // 0x0280 (size: 0x8)
    class UStaticMeshComponent* brush_06_06;                                          // 0x0288 (size: 0x8)
    class UStaticMeshComponent* brush_06_05;                                          // 0x0290 (size: 0x8)
    class UStaticMeshComponent* brush_06_04;                                          // 0x0298 (size: 0x8)
    class UStaticMeshComponent* brush_06_03;                                          // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* brush_06_01;                                          // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* Midtown_Residence_Planter_C;                          // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* Midtown_Residence_Bench_B;                            // 0x02B8 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x02C0 (size: 0x8)

}; // Size: 0x2C8

#endif
