#ifndef UE4SS_SDK_BP_Rat_Pawn_HPP
#define UE4SS_SDK_BP_Rat_Pawn_HPP

class ABP_Rat_Pawn_C : public APawn
{
    class UCOMP_simpleLooper_C* COMP_simpleLooper;                                    // 0x0288 (size: 0x8)
    class UCapsuleComponent* capsule;                                                 // 0x0290 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0298 (size: 0x8)
    class UFloatingPawnMovement* FloatingPawnMovement;                                // 0x02A0 (size: 0x8)
    class USkeletalMeshComponent* Mesh;                                               // 0x02A8 (size: 0x8)
    FRotator Smooth Rotation;                                                         // 0x02B0 (size: 0xC)
    float Max Walk Speed;                                                             // 0x02BC (size: 0x4)
    class AAIController* AI Controller;                                               // 0x02C0 (size: 0x8)
    class UAnimInstance* ABP Rat;                                                     // 0x02C8 (size: 0x8)
    float Max Run Speed;                                                              // 0x02D0 (size: 0x4)
    bool IsOnScreen;                                                                  // 0x02D4 (size: 0x1)
    bool Temp_bool_Has_Been_Initd_Variable;                                           // 0x02D5 (size: 0x1)
    bool Temp_bool_IsClosed_Variable;                                                 // 0x02D6 (size: 0x1)
    bool Temp_bool_Has_Been_Initd_Variable_1;                                         // 0x02D7 (size: 0x1)
    TArray<class AActor*> Temp_object_Variable;                                       // 0x02D8 (size: 0x10)
    float K2Node_Event_DeltaSeconds;                                                  // 0x02E8 (size: 0x4)
    float CallFunc_BreakRotator_Roll;                                                 // 0x02EC (size: 0x4)
    float CallFunc_BreakRotator_Pitch;                                                // 0x02F0 (size: 0x4)
    float CallFunc_BreakRotator_Yaw;                                                  // 0x02F4 (size: 0x4)
    class UAnimInstance* K2Node_DynamicCast_AsABP_Rat;                                // 0x02F8 (size: 0x8)
    bool K2Node_DynamicCast_bSuccess;                                                 // 0x0300 (size: 0x1)
    class AAIController* K2Node_DynamicCast_AsBP_Rat_AICtrl;                          // 0x0308 (size: 0x8)
    bool K2Node_DynamicCast_bSuccess_1;                                               // 0x0310 (size: 0x1)
    bool Temp_bool_IsClosed_Variable_1;                                               // 0x0311 (size: 0x1)
    class ABP_CatPawn_C* CallFunc_FindPlayerCatPawn_Cat;                              // 0x0318 (size: 0x8)
    TArray<TEnumAsByte<EObjectTypeQuery>> K2Node_MakeArray_Array;                     // 0x0320 (size: 0x10)
    float CallFunc_BreakVector_X;                                                     // 0x0330 (size: 0x4)
    float CallFunc_BreakVector_Y;                                                     // 0x0334 (size: 0x4)
    float CallFunc_BreakVector_Z;                                                     // 0x0338 (size: 0x4)
    float CallFunc_BreakRotator_Roll_1;                                               // 0x033C (size: 0x4)
    float CallFunc_BreakRotator_Pitch_1;                                              // 0x0340 (size: 0x4)
    float CallFunc_BreakRotator_Yaw_1;                                                // 0x0344 (size: 0x4)
    float CallFunc_BreakVector_X_1;                                                   // 0x0348 (size: 0x4)
    float CallFunc_BreakVector_Y_1;                                                   // 0x034C (size: 0x4)
    float CallFunc_BreakVector_Z_1;                                                   // 0x0350 (size: 0x4)
    FHitResult CallFunc_LineTraceSingleForObjects_OutHit;                             // 0x0354 (size: 0x88)
    bool CallFunc_BreakHitResult_bBlockingHit;                                        // 0x03DC (size: 0x1)
    bool CallFunc_BreakHitResult_bInitialOverlap;                                     // 0x03DD (size: 0x1)
    float CallFunc_BreakHitResult_Time;                                               // 0x03E0 (size: 0x4)
    float CallFunc_BreakHitResult_Distance;                                           // 0x03E4 (size: 0x4)
    FVector CallFunc_BreakHitResult_Location;                                         // 0x03E8 (size: 0xC)
    FVector CallFunc_BreakHitResult_ImpactPoint;                                      // 0x03F4 (size: 0xC)
    FVector CallFunc_BreakHitResult_Normal;                                           // 0x0400 (size: 0xC)
    FVector CallFunc_BreakHitResult_ImpactNormal;                                     // 0x040C (size: 0xC)
    class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat;                         // 0x0418 (size: 0x8)
    class AActor* CallFunc_BreakHitResult_HitActor;                                   // 0x0420 (size: 0x8)
    class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent;                  // 0x0428 (size: 0x8)
    FName CallFunc_BreakHitResult_HitBoneName;                                        // 0x0430 (size: 0x8)
    int32 CallFunc_BreakHitResult_HitItem;                                            // 0x0438 (size: 0x4)
    int32 CallFunc_BreakHitResult_ElementIndex;                                       // 0x043C (size: 0x4)
    int32 CallFunc_BreakHitResult_FaceIndex;                                          // 0x0440 (size: 0x4)
    FVector CallFunc_BreakHitResult_TraceStart;                                       // 0x0444 (size: 0xC)
    FVector CallFunc_BreakHitResult_TraceEnd;                                         // 0x0450 (size: 0xC)
    float CallFunc_BreakVector_X_2;                                                   // 0x045C (size: 0x4)
    float CallFunc_BreakVector_Y_2;                                                   // 0x0460 (size: 0x4)
    float CallFunc_BreakVector_Z_2;                                                   // 0x0464 (size: 0x4)
    float CallFunc_BreakRotator_Roll_2;                                               // 0x0468 (size: 0x4)
    float CallFunc_BreakRotator_Pitch_2;                                              // 0x046C (size: 0x4)
    float CallFunc_BreakRotator_Yaw_2;                                                // 0x0470 (size: 0x4)
    FHitResult CallFunc_K2_SetWorldLocation_SweepHitResult;                           // 0x0474 (size: 0x88)
    FHitResult CallFunc_K2_SetRelativeRotation_SweepHitResult;                        // 0x04FC (size: 0x88)

    void UserConstructionScript();
    void ReceiveTick(float bpp__DeltaSeconds__pf);
}; // Size: 0x588

#endif
