#ifndef UE4SS_SDK_BP_SAS_SafeZone_01_HPP
#define UE4SS_SDK_BP_SAS_SafeZone_01_HPP

class ABP_SAS_SafeZone_01_C : public AActor
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0228 (size: 0x8)
    class UStaticMeshComponent* Plate_Rusty_c;                                        // 0x0230 (size: 0x8)
    class UStaticMeshComponent* StaticMesh44;                                         // 0x0238 (size: 0x8)
    class UStaticMeshComponent* StaticMesh43;                                         // 0x0240 (size: 0x8)
    class UStaticMeshComponent* StaticMesh42;                                         // 0x0248 (size: 0x8)
    class UStaticMeshComponent* StaticMesh41;                                         // 0x0250 (size: 0x8)
    class UStaticMeshComponent* StaticMesh40;                                         // 0x0258 (size: 0x8)
    class UStaticMeshComponent* StaticMesh39;                                         // 0x0260 (size: 0x8)
    class UStaticMeshComponent* StaticMesh38;                                         // 0x0268 (size: 0x8)
    class UStaticMeshComponent* StaticMesh37;                                         // 0x0270 (size: 0x8)
    class UStaticMeshComponent* StaticMesh36;                                         // 0x0278 (size: 0x8)
    class UStaticMeshComponent* StaticMesh35;                                         // 0x0280 (size: 0x8)
    class UStaticMeshComponent* StaticMesh34;                                         // 0x0288 (size: 0x8)
    class UStaticMeshComponent* StaticMesh31;                                         // 0x0290 (size: 0x8)
    class UStaticMeshComponent* StaticMesh33;                                         // 0x0298 (size: 0x8)
    class UStaticMeshComponent* StaticMesh32;                                         // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh30;                                         // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* Metal_stuff_12;                                       // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh29;                                         // 0x02B8 (size: 0x8)
    class UChildActorComponent* ChildActor2;                                          // 0x02C0 (size: 0x8)
    class UChildActorComponent* BP_ElectricBox01_TWEAKZ+090;                          // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* Plate_Plaster_d;                                      // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh28;                                         // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh27;                                         // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* Metal_stuff_14;                                       // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0300 (size: 0x8)
    class UStaticMeshComponent* StaticMesh24;                                         // 0x0308 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x0310 (size: 0x8)
    class UStaticMeshComponent* Metal_stuff_11;                                       // 0x0318 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0320 (size: 0x8)
    class UStaticMeshComponent* StaticMesh26;                                         // 0x0328 (size: 0x8)
    class UStaticMeshComponent* StaticMesh13;                                         // 0x0330 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x0338 (size: 0x8)
    class UStaticMeshComponent* StaticMesh21;                                         // 0x0340 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x0348 (size: 0x8)
    class UStaticMeshComponent* StaticMesh11;                                         // 0x0350 (size: 0x8)
    class UStaticMeshComponent* StaticMesh19;                                         // 0x0358 (size: 0x8)
    class UStaticMeshComponent* StaticMesh12;                                         // 0x0360 (size: 0x8)
    class UStaticMeshComponent* StaticMesh22;                                         // 0x0368 (size: 0x8)
    class UStaticMeshComponent* Wood_Plank_d;                                         // 0x0370 (size: 0x8)
    class UStaticMeshComponent* Wood_Plank_c;                                         // 0x0378 (size: 0x8)
    class UStaticMeshComponent* WoodPlane01_TWEAKX-090Z-090;                          // 0x0380 (size: 0x8)
    class UStaticMeshComponent* Door;                                                 // 0x0388 (size: 0x8)
    class UStaticMeshComponent* StaticMesh25;                                         // 0x0390 (size: 0x8)
    class UStaticMeshComponent* StaticMesh14;                                         // 0x0398 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x03A0 (size: 0x8)
    class UBoxComponent* Box;                                                         // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh23;                                         // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh20;                                         // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh18;                                         // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh17;                                         // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh16;                                         // 0x03D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh15;                                         // 0x03D8 (size: 0x8)
    class UStaticMeshComponent* Metal_stuff_10;                                       // 0x03E0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x03E8 (size: 0x8)
    class UStaticMeshComponent* Metal_stuff_07;                                       // 0x03F0 (size: 0x8)
    class UStaticMeshComponent* Wood_Plank_a;                                         // 0x03F8 (size: 0x8)
    class UStaticMeshComponent* Wood_Plank_b;                                         // 0x0400 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0408 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0410 (size: 0x8)
    class UStaticMeshComponent* Structure;                                            // 0x0418 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0420 (size: 0x8)
    float Timeline_0_NewTrack_0_6E99B79949AB4187A34A69850FC32399;                     // 0x0428 (size: 0x4)
    TEnumAsByte<ETimelineDirection::Type> Timeline_0__Direction_6E99B79949AB4187A34A69850FC32399; // 0x042C (size: 0x1)
    class UTimelineComponent* Timeline_0;                                             // 0x0430 (size: 0x8)
    FRotator Rotation;                                                                // 0x0438 (size: 0xC)
    FRotator Base_Rotation;                                                           // 0x0444 (size: 0xC)
    FRotator Rotation_Current;                                                        // 0x0450 (size: 0xC)
    bool Open;                                                                        // 0x045C (size: 0x1)
    bool StartOpen;                                                                   // 0x045D (size: 0x1)

    void Timeline_0__FinishedFunc();
    void Timeline_0__UpdateFunc();
    void ReceiveBeginPlay();
    void LogicTrigger();
    void ExecuteUbergraph_BP_SAS_SafeZone_01(int32 EntryPoint);
}; // Size: 0x45E

#endif
