#ifndef UE4SS_SDK_BP_Shop_struct_Bamboo4_HPP
#define UE4SS_SDK_BP_Shop_struct_Bamboo4_HPP

class ABP_Shop_struct_Bamboo4_C : public AActor
{
    class UStaticMeshComponent* bambooAttach_017;                                     // 0x0228 (size: 0x8)
    class UStaticMeshComponent* bambooAttach_016;                                     // 0x0230 (size: 0x8)
    class UStaticMeshComponent* bambooAttach_015;                                     // 0x0238 (size: 0x8)
    class UStaticMeshComponent* bambooAttach_014;                                     // 0x0240 (size: 0x8)
    class UStaticMeshComponent* bambooAttach_013;                                     // 0x0248 (size: 0x8)
    class UStaticMeshComponent* bambooAttach_012;                                     // 0x0250 (size: 0x8)
    class UStaticMeshComponent* bambooAttach_011;                                     // 0x0258 (size: 0x8)
    class UStaticMeshComponent* bambooAttach_010;                                     // 0x0260 (size: 0x8)
    class UStaticMeshComponent* bambooAttach_09;                                      // 0x0268 (size: 0x8)
    class UStaticMeshComponent* bambooAttach_08;                                      // 0x0270 (size: 0x8)
    class UStaticMeshComponent* bambooAttach_07;                                      // 0x0278 (size: 0x8)
    class UStaticMeshComponent* bambooAttach_06;                                      // 0x0280 (size: 0x8)
    class UStaticMeshComponent* bambooAttach_05;                                      // 0x0288 (size: 0x8)
    class UStaticMeshComponent* bambooAttach_04;                                      // 0x0290 (size: 0x8)
    class UStaticMeshComponent* bambooAttach_03;                                      // 0x0298 (size: 0x8)
    class UStaticMeshComponent* bambooAttach_02;                                      // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* WoodPlane06;                                          // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* bamboo_bamboo01;                                      // 0x0300 (size: 0x8)
    class UStaticMeshComponent* bamboo_bamboo02;                                      // 0x0308 (size: 0x8)
    class UStaticMeshComponent* WoodPlane02;                                          // 0x0310 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0318 (size: 0x8)

}; // Size: 0x320

#endif
