#ifndef UE4SS_SDK_BP_Scaffolding04_HPP
#define UE4SS_SDK_BP_Scaffolding04_HPP

class ABP_Scaffolding04_C : public AActor
{
    class USceneComponent* Scene;                                                     // 0x0228 (size: 0x8)
    class UStaticMeshComponent* WoodPlane01;                                          // 0x0230 (size: 0x8)
    class UStaticMeshComponent* WoodPlane02;                                          // 0x0238 (size: 0x8)
    class UStaticMeshComponent* WoodPlane00;                                          // 0x0240 (size: 0x8)
    class UStaticMeshComponent* StaticMesh23;                                         // 0x0248 (size: 0x8)
    class UStaticMeshComponent* StaticMesh22;                                         // 0x0250 (size: 0x8)
    class UStaticMeshComponent* StaticMesh21;                                         // 0x0258 (size: 0x8)
    class UStaticMeshComponent* StaticMesh20;                                         // 0x0260 (size: 0x8)
    class UStaticMeshComponent* StaticMesh19;                                         // 0x0268 (size: 0x8)
    class UStaticMeshComponent* StaticMesh18;                                         // 0x0270 (size: 0x8)
    class UStaticMeshComponent* StaticMesh17;                                         // 0x0278 (size: 0x8)
    class UStaticMeshComponent* StaticMesh16;                                         // 0x0280 (size: 0x8)
    class UStaticMeshComponent* bamboo05;                                             // 0x0288 (size: 0x8)
    class UStaticMeshComponent* StaticMesh14;                                         // 0x0290 (size: 0x8)
    class UStaticMeshComponent* StaticMesh13;                                         // 0x0298 (size: 0x8)
    class UStaticMeshComponent* StaticMesh12;                                         // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh11;                                         // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh15;                                         // 0x02E0 (size: 0x8)

}; // Size: 0x2E8

#endif
