#ifndef UE4SS_SDK_BP_Tunnel_Pursuit_Pit_HoleB_HPP
#define UE4SS_SDK_BP_Tunnel_Pursuit_Pit_HoleB_HPP

class ABP_Tunnel_Pursuit_Pit_HoleB_C : public AActor
{
    class UStaticMeshComponent* Tunnel_Med_Rond_AirDuct1;                             // 0x0228 (size: 0x8)
    class UStaticMeshComponent* Tunnel_Med_Rond_AirDuct;                              // 0x0230 (size: 0x8)
    class UStaticMeshComponent* Tunnel_Med_Rond_A;                                    // 0x0238 (size: 0x8)
    class UStaticMeshComponent* Tunnel_Med_Rond_Border1;                              // 0x0240 (size: 0x8)
    class UStaticMeshComponent* Tunnel_Med_Rond_Border;                               // 0x0248 (size: 0x8)
    class UStaticMeshComponent* Tunnel_Med_Rond_A1;                                   // 0x0250 (size: 0x8)
    class UStaticMeshComponent* Tunnel_Pursuit_Pit;                                   // 0x0258 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0260 (size: 0x8)

}; // Size: 0x268

#endif
