#ifndef UE4SS_SDK_BP_windows02_HPP
#define UE4SS_SDK_BP_windows02_HPP

class ABP_windows02_C : public AActor
{
    class UStaticMeshComponent* StaticMesh;                                           // 0x0228 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent030;                               // 0x0230 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent029;                               // 0x0238 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent028;                               // 0x0240 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent025;                               // 0x0248 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent023;                               // 0x0250 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent015;                               // 0x0258 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent011;                               // 0x0260 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent06;                                // 0x0268 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent05;                                // 0x0270 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent04;                                // 0x0278 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent02;                                // 0x0280 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0;                                 // 0x0288 (size: 0x8)
    class USceneComponent* SharedRoot;                                                // 0x0290 (size: 0x8)

}; // Size: 0x298

#endif
