#ifndef UE4SS_SDK_BP_Wagon_HPP
#define UE4SS_SDK_BP_Wagon_HPP

class ABP_Wagon_C : public AActor
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0228 (size: 0x8)
    class USceneComponent* SWITCH;                                                    // 0x0230 (size: 0x8)
    class UStaticMeshComponent* Collision_Wall17;                                     // 0x0238 (size: 0x8)
    class UStaticMeshComponent* Cube;                                                 // 0x0240 (size: 0x8)
    class UStaticMeshComponent* Collision_Side1;                                      // 0x0248 (size: 0x8)
    class UStaticMeshComponent* Collision_banquette8;                                 // 0x0250 (size: 0x8)
    class UStaticMeshComponent* Collision_Wall16;                                     // 0x0258 (size: 0x8)
    class USceneComponent* Door_RightSide;                                            // 0x0260 (size: 0x8)
    class USceneComponent* Door_LeftSide;                                             // 0x0268 (size: 0x8)
    class UStaticMeshComponent* Cube3;                                                // 0x0270 (size: 0x8)
    class UStaticMeshComponent* Cube1;                                                // 0x0278 (size: 0x8)
    class UStaticMeshComponent* Cube2;                                                // 0x0280 (size: 0x8)
    class USceneComponent* SmallSeat_SplineRailAttach_02;                             // 0x0288 (size: 0x8)
    class USceneComponent* SmallSeat_SplineRailAttach_01;                             // 0x0290 (size: 0x8)
    class USceneComponent* SmallSeat_SplineRailAttach_00;                             // 0x0298 (size: 0x8)
    class USceneComponent* LargeSeat_SplineRailAttach_03;                             // 0x02A0 (size: 0x8)
    class USceneComponent* LargeSeat_SplineRailAttach_02;                             // 0x02A8 (size: 0x8)
    class USceneComponent* LargeSeat_SplineRailAttach_01;                             // 0x02B0 (size: 0x8)
    class USceneComponent* LargeSeat_SplineRailAttach_00;                             // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* sfx loc BL;                                           // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* sfx loc BR;                                           // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* sfx loc FL;                                           // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* sfx loc FR;                                           // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* Crowbar_01a;                                          // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* Seat_Pivot;                                           // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent42;                                // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent41;                                // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent40;                                // 0x0300 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent39;                                // 0x0308 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent38;                                // 0x0310 (size: 0x8)
    class UStaticMeshComponent* Wheel_06;                                             // 0x0318 (size: 0x8)
    class UStaticMeshComponent* Wheel_07;                                             // 0x0320 (size: 0x8)
    class UStaticMeshComponent* Wheel_03;                                             // 0x0328 (size: 0x8)
    class USceneComponent* SmallSeat_SplineRailAttach_03;                             // 0x0330 (size: 0x8)
    class UStaticMeshComponent* wheel_05;                                             // 0x0338 (size: 0x8)
    class UStaticMeshComponent* Wheel_08;                                             // 0x0340 (size: 0x8)
    class UStaticMeshComponent* Wheel_04;                                             // 0x0348 (size: 0x8)
    class UStaticMeshComponent* Wheel_01;                                             // 0x0350 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent29;                                // 0x0358 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent28;                                // 0x0360 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent26;                                // 0x0368 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent25;                                // 0x0370 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent23;                                // 0x0378 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent22;                                // 0x0380 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent21;                                // 0x0388 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent20;                                // 0x0390 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent19;                                // 0x0398 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent18;                                // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent17;                                // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent16;                                // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent15;                                // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent14;                                // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* FRONT;                                                // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent12;                                // 0x03D0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent11;                                // 0x03D8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent10;                                // 0x03E0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent9;                                 // 0x03E8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent8;                                 // 0x03F0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent7;                                 // 0x03F8 (size: 0x8)
    class UStaticMeshComponent* Dashboard;                                            // 0x0400 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent5;                                 // 0x0408 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent4;                                 // 0x0410 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent3;                                 // 0x0418 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent2;                                 // 0x0420 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent1;                                 // 0x0428 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent24;                                // 0x0430 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent27;                                // 0x0438 (size: 0x8)
    class UStaticMeshComponent* Wheel_02;                                             // 0x0440 (size: 0x8)
    class UStaticMeshComponent* wagon1;                                               // 0x0448 (size: 0x8)
    class USceneComponent* Collision;                                                 // 0x0450 (size: 0x8)
    class UStreamingComponent* Streaming;                                             // 0x0458 (size: 0x8)
    class USceneComponent* Seat_SplineRailAttach;                                     // 0x0460 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent73;                                // 0x0468 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent72;                                // 0x0470 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent71;                                // 0x0478 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent70;                                // 0x0480 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent69;                                // 0x0488 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent68;                                // 0x0490 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent67;                                // 0x0498 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent66;                                // 0x04A0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent65;                                // 0x04A8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent63;                                // 0x04B0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent62;                                // 0x04B8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent61;                                // 0x04C0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent59;                                // 0x04C8 (size: 0x8)
    class UStaticMeshComponent* Collision_banquette7;                                 // 0x04D0 (size: 0x8)
    class UStaticMeshComponent* Collision_banquette6;                                 // 0x04D8 (size: 0x8)
    class UStaticMeshComponent* Collision_Side;                                       // 0x04E0 (size: 0x8)
    class UStaticMeshComponent* Collision_banquette4;                                 // 0x04E8 (size: 0x8)
    class UStaticMeshComponent* Collision_banquette3;                                 // 0x04F0 (size: 0x8)
    class UStaticMeshComponent* Collision_banquette2;                                 // 0x04F8 (size: 0x8)
    class UStaticMeshComponent* Collision_banquette1;                                 // 0x0500 (size: 0x8)
    class UStaticMeshComponent* Collision_banquette;                                  // 0x0508 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent58;                                // 0x0510 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent55;                                // 0x0518 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent54;                                // 0x0520 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent53;                                // 0x0528 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent52;                                // 0x0530 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent57;                                // 0x0538 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent49;                                // 0x0540 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent47;                                // 0x0548 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent51;                                // 0x0550 (size: 0x8)
    class USpotLightComponent* SpotLight3;                                            // 0x0558 (size: 0x8)
    class USpotLightComponent* SpotLight2;                                            // 0x0560 (size: 0x8)
    class USpotLightComponent* SpotLight1;                                            // 0x0568 (size: 0x8)
    class USpotLightComponent* SpotLight;                                             // 0x0570 (size: 0x8)
    class UStaticMeshComponent* Wagon_Door05;                                         // 0x0578 (size: 0x8)
    class UStaticMeshComponent* Wagon_Door08;                                         // 0x0580 (size: 0x8)
    class UStaticMeshComponent* Wagon_Door07;                                         // 0x0588 (size: 0x8)
    class UStaticMeshComponent* Wagon_Door06;                                         // 0x0590 (size: 0x8)
    class UStaticMeshComponent* Wagon_Door01;                                         // 0x0598 (size: 0x8)
    class UStaticMeshComponent* Wagon_Door04;                                         // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* Wagon_Door03;                                         // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* Wagon_Door02;                                         // 0x05B0 (size: 0x8)
    class UMovingActorComponent* MovingActor;                                         // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* Wagon;                                                // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent44;                                // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent43;                                // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent45;                                // 0x05D8 (size: 0x8)
    bool Static;                                                                      // 0x05E0 (size: 0x1)
    TArray<class UStaticMeshComponent*> All_Door;                                     // 0x05E8 (size: 0x10)
    float close door Time;                                                            // 0x05F8 (size: 0x4)
    float Open door Time;                                                             // 0x05FC (size: 0x4)
    float Speed;                                                                      // 0x0600 (size: 0x4)
    bool Move;                                                                        // 0x0604 (size: 0x1)
    float Speed_Max;                                                                  // 0x0608 (size: 0x4)
    bool All_Doors_Open;                                                              // 0x060C (size: 0x1)
    TArray<class ABP_MovingSplineRail_C*> LargeSeat_SplineRails;                      // 0x0610 (size: 0x10)
    TArray<class ABP_MovingSplineRail_C*> SmallSeat_SplineRails;                      // 0x0620 (size: 0x10)
    class ABP_MovingSplineRail_C* Seat_SplineRail;                                    // 0x0630 (size: 0x8)
    class AActor* triggerSwitch;                                                      // 0x0638 (size: 0x8)

    void UserConstructionScript();
    void Complete_6246EF4646E19036986D72BA46DCD5DE();
    void Tick_6246EF4646E19036986D72BA46DCD5DE(float Ratio);
    void Complete_6246EF4646E19036986D72BA83E56412();
    void Tick_6246EF4646E19036986D72BA83E56412(float Ratio);
    void Complete_6246EF4646E19036986D72BA470CC24D();
    void Tick_6246EF4646E19036986D72BA470CC24D(float Ratio);
    void Complete_6246EF4646E19036986D72BAA49F4B14();
    void Tick_6246EF4646E19036986D72BAA49F4B14(float Ratio);
    void Complete_6246EF4646E19036986D72BA0F02BD47();
    void Tick_6246EF4646E19036986D72BA0F02BD47(float Ratio);
    void Complete_6246EF4646E19036986D72BA18A742D4();
    void Tick_6246EF4646E19036986D72BA18A742D4(float Ratio);
    void Complete_6246EF4646E19036986D72BA0440A91E();
    void Tick_6246EF4646E19036986D72BA0440A91E(float Ratio);
    void Complete_6246EF4646E19036986D72BA540DCAFF();
    void Tick_6246EF4646E19036986D72BA540DCAFF(float Ratio);
    void set_Movable();
    void set_static();
    void On();
    void CloseDoors();
    void OpenDoors();
    void SetDashboard_ON();
    void SetDashboard_OFF();
    void Light_ON();
    void Light_OFF();
    void StartMetro();
    void ReceiveTick(float DeltaSeconds);
    void Instant_CloseDoors();
    void Attach Rails();
    void BndEvt__BP_Wagon_Streaming_K2Node_ComponentBoundEvent_0_StreamingComponentDelegate__DelegateSignature(class UStreamingComponent* _component);
    void Instant_OpenDoors();
    void Activate Spline Rails(bool _enabled);
    void ExecuteUbergraph_BP_Wagon(int32 EntryPoint);
}; // Size: 0x640

#endif
