#ifndef UE4SS_SDK_BP_Zurg_Interest_Zone_TrashBag_HPP
#define UE4SS_SDK_BP_Zurg_Interest_Zone_TrashBag_HPP

class ABP_Zurg_Interest_Zone_TrashBag_C : public ABP_Zurg_Interest_Zone_C
{
    class UBP_Zurg_InterestPoint_C* BP_Zurg_InterestPoint6;                           // 0x0258 (size: 0x8)
    class UBP_Zurg_InterestPoint_C* BP_Zurg_InterestPoint5;                           // 0x0260 (size: 0x8)
    class UBP_Zurg_InterestPoint_C* BP_Zurg_InterestPoint4;                           // 0x0268 (size: 0x8)
    class UBP_Zurg_InterestPoint_C* BP_Zurg_InterestPoint3;                           // 0x0270 (size: 0x8)
    class UBP_Zurg_InterestPoint_C* BP_Zurg_InterestPoint2;                           // 0x0278 (size: 0x8)
    class UBP_Zurg_InterestPoint_C* BP_Zurg_InterestPoint1;                           // 0x0280 (size: 0x8)
    class UBP_Zurg_InterestPoint_C* BP_Zurg_InterestPoint;                            // 0x0288 (size: 0x8)
    class UStaticMeshComponent* PropsGround_TrashBag_03;                              // 0x0290 (size: 0x8)

}; // Size: 0x298

#endif
