#ifndef UE4SS_SDK_CACA_Slum_DirectionSign_HPP
#define UE4SS_SDK_CACA_Slum_DirectionSign_HPP

class ACACA_Slum_DirectionSign_C : public AActor
{
    class UDecalComponent* Laundry_decal;                                             // 0x0228 (size: 0x8)
    class UStaticMeshComponent* signalingpanel_attachronde01;                         // 0x0230 (size: 0x8)
    class UStaticMeshComponent* signalingpanel_attachronde03;                         // 0x0238 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0240 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0248 (size: 0x8)
    class UStaticMeshComponent* signalingpanel_attachronde06;                         // 0x0250 (size: 0x8)
    class UStaticMeshComponent* signalingpanel_attachronde02;                         // 0x0258 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0260 (size: 0x8)
    class UTalkableComponent* talkable;                                               // 0x0268 (size: 0x8)
    class UStaticMeshComponent* Elliot;                                               // 0x0270 (size: 0x8)
    class UStaticMeshComponent* Grandma;                                              // 0x0278 (size: 0x8)
    class UStaticMeshComponent* Laundry0;                                             // 0x0280 (size: 0x8)
    class UStaticMeshComponent* barterman;                                            // 0x0288 (size: 0x8)
    class UChildActorComponent* BP_Pole01;                                            // 0x0290 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0298 (size: 0x8)

}; // Size: 0x2A0

#endif
