#ifndef UE4SS_SDK_CACA_Midtown_DirectionSign_HPP
#define UE4SS_SDK_CACA_Midtown_DirectionSign_HPP

class ACACA_Midtown_DirectionSign_C : public AActor
{
    class UStaticMeshComponent* Tube_Light_b2;                                        // 0x0228 (size: 0x8)
    class UStaticMeshComponent* Tube_Light_b1;                                        // 0x0230 (size: 0x8)
    class UStaticMeshComponent* Tube_Light_b;                                         // 0x0238 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0240 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0248 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0250 (size: 0x8)
    class UStaticMeshComponent* signalingpanel_rect03_decal03;                        // 0x0258 (size: 0x8)
    class UStaticMeshComponent* signalingpanel_rect03_decal02;                        // 0x0260 (size: 0x8)
    class UStaticMeshComponent* signalingpanel_rect03_decal01;                        // 0x0268 (size: 0x8)
    class UStaticMeshComponent* signalingpanel_attachronde06;                         // 0x0270 (size: 0x8)
    class UStaticMeshComponent* signalingpanel_attachronde05;                         // 0x0278 (size: 0x8)
    class UStaticMeshComponent* signalingpanel_attachronde04;                         // 0x0280 (size: 0x8)
    class UStaticMeshComponent* signalingpanel_attachronde03;                         // 0x0288 (size: 0x8)
    class UStaticMeshComponent* signalingpanel_attachronde02;                         // 0x0290 (size: 0x8)
    class UStaticMeshComponent* Neko Corp;                                            // 0x0298 (size: 0x8)
    class UStaticMeshComponent* Shop Street;                                          // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* signalingpanel_attachronde01;                         // 0x02A8 (size: 0x8)
    class UTalkableComponent* talkable;                                               // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* Residency;                                            // 0x02B8 (size: 0x8)
    class UChildActorComponent* BP_Pole01;                                            // 0x02C0 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x02C8 (size: 0x8)

}; // Size: 0x2D0

#endif
