#ifndef UE4SS_SDK_Chariot_Platform_HPP
#define UE4SS_SDK_Chariot_Platform_HPP

class AChariot_Platform_C : public AActor
{
    class UMovingActorComponent* MovingActor;                                         // 0x0228 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0230 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0238 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0240 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0248 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0250 (size: 0x8)
    class UStaticMeshComponent* PropsGround_carton_2;                                 // 0x0258 (size: 0x8)
    class UStaticMeshComponent* PropsGround_carton_1;                                 // 0x0260 (size: 0x8)
    class UStaticMeshComponent* PropsGround01_00;                                     // 0x0268 (size: 0x8)
    class UStaticMeshComponent* PropsGround01_05;                                     // 0x0270 (size: 0x8)
    class UStaticMeshComponent* Cardboard_1;                                          // 0x0278 (size: 0x8)
    class UStaticMeshComponent* Chariot;                                              // 0x0280 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0288 (size: 0x8)

}; // Size: 0x290

#endif
