#ifndef UE4SS_SDK_ElectricPillar01_HPP
#define UE4SS_SDK_ElectricPillar01_HPP

class AElectricPillar01_C : public AActor
{
    class UStaticMeshComponent* ElectricPillar01_MetalBox;                            // 0x0228 (size: 0x8)
    class UStaticMeshComponent* ElectricPillar01_MetalBar;                            // 0x0230 (size: 0x8)
    class UStaticMeshComponent* ElectricPillar01_MetalAttachTile;                     // 0x0238 (size: 0x8)
    class UStaticMeshComponent* ElectricPillar01_Light;                               // 0x0240 (size: 0x8)
    class UStaticMeshComponent* ElectricPillar01_ElectricPlug;                        // 0x0248 (size: 0x8)
    class UStaticMeshComponent* ElectricPillar01_Cable_01;                            // 0x0250 (size: 0x8)
    class UStaticMeshComponent* ElectricPillar01_cableAlpha;                          // 0x0258 (size: 0x8)
    class UStaticMeshComponent* ElectricPillar01_Cable_06;                            // 0x0260 (size: 0x8)
    class UStaticMeshComponent* ElectricPillar01_Cable_05;                            // 0x0268 (size: 0x8)
    class UStaticMeshComponent* ElectricPillar01_Cable_04;                            // 0x0270 (size: 0x8)
    class UStaticMeshComponent* ElectricPillar01_Cable_02;                            // 0x0278 (size: 0x8)
    class UStaticMeshComponent* ElectricPillar01_ConcretPillar;                       // 0x0280 (size: 0x8)
    class UStaticMeshComponent* ElectricPillar01_MetalBoxAdditional;                  // 0x0288 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0290 (size: 0x8)

}; // Size: 0x298

#endif
