#ifndef UE4SS_SDK_FlowerPotGroup_4_HPP
#define UE4SS_SDK_FlowerPotGroup_4_HPP

class AFlowerPotGroup_4_C : public AActor
{
    class UStaticMeshComponent* EmptyFlowerPot_01;                                    // 0x0228 (size: 0x8)
    class UStaticMeshComponent* FlowerPot_01;                                         // 0x0230 (size: 0x8)
    class UStaticMeshComponent* FlowerPot_02;                                         // 0x0238 (size: 0x8)
    class UStaticMeshComponent* FlowerPot_04;                                         // 0x0240 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0248 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent01;                                // 0x0250 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent02;                                // 0x0258 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0;                                 // 0x0260 (size: 0x8)
    class USceneComponent* Scene4;                                                    // 0x0268 (size: 0x8)

}; // Size: 0x270

#endif
