#ifndef UE4SS_SDK_G_Int_Shop_Stuff04_HPP
#define UE4SS_SDK_G_Int_Shop_Stuff04_HPP

class AG_Int_Shop_Stuff04_C : public AActor
{
    class UStaticMeshComponent* StaticMeshComponent042;                               // 0x0228 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent041;                               // 0x0230 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent040;                               // 0x0238 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent039;                               // 0x0240 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent038;                               // 0x0248 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent037;                               // 0x0250 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent036;                               // 0x0258 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent035;                               // 0x0260 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent034;                               // 0x0268 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent033;                               // 0x0270 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent032;                               // 0x0278 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent031;                               // 0x0280 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent030;                               // 0x0288 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent029;                               // 0x0290 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent028;                               // 0x0298 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent027;                               // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent026;                               // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent025;                               // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent06;                                // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent023;                               // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent022;                               // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent021;                               // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent020;                               // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent019;                               // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent018;                               // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent017;                               // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent016;                               // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent015;                               // 0x0300 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent014;                               // 0x0308 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent013;                               // 0x0310 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent012;                               // 0x0318 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent011;                               // 0x0320 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent010;                               // 0x0328 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent07;                                // 0x0330 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent024;                               // 0x0338 (size: 0x8)
    class UInstancedStaticMeshComponent* InstancedStaticMesh;                         // 0x0340 (size: 0x8)
    class UStaticMeshComponent* StaticMesh26;                                         // 0x0348 (size: 0x8)
    class UStaticMeshComponent* StaticMesh25;                                         // 0x0350 (size: 0x8)
    class UStaticMeshComponent* StaticMesh24;                                         // 0x0358 (size: 0x8)
    class UStaticMeshComponent* StaticMesh23;                                         // 0x0360 (size: 0x8)
    class UStaticMeshComponent* StaticMesh22;                                         // 0x0368 (size: 0x8)
    class UStaticMeshComponent* StaticMesh21;                                         // 0x0370 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent05;                                // 0x0378 (size: 0x8)
    class UStaticMeshComponent* StaticMesh20;                                         // 0x0380 (size: 0x8)
    class UStaticMeshComponent* StaticMesh19;                                         // 0x0388 (size: 0x8)
    class UStaticMeshComponent* StaticMesh18;                                         // 0x0390 (size: 0x8)
    class UStaticMeshComponent* StaticMesh17;                                         // 0x0398 (size: 0x8)
    class UStaticMeshComponent* StaticMesh16;                                         // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh14;                                         // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh13;                                         // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh12;                                         // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh11;                                         // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x03D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x03D8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x03E0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x03E8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x03F0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x03F8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0400 (size: 0x8)
    class UStaticMeshComponent* StaticMesh15;                                         // 0x0408 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0;                                 // 0x0410 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent03;                                // 0x0418 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent02;                                // 0x0420 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent01;                                // 0x0428 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0430 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0438 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0440 (size: 0x8)
    class UStaticMeshComponent* meuble;                                               // 0x0448 (size: 0x8)
    class USceneComponent* DefaultSceneRoot1;                                         // 0x0450 (size: 0x8)
    class USceneComponent* SharedRoot;                                                // 0x0458 (size: 0x8)

}; // Size: 0x460

#endif
