#ifndef UE4SS_SDK_G_Plasticbox_02_HPP
#define UE4SS_SDK_G_Plasticbox_02_HPP

class AG_Plasticbox_02_C : public AActor
{
    class USplineRailComponent* SplineRail;                                           // 0x0228 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0230 (size: 0x8)
    class UStaticMeshComponent* Cube;                                                 // 0x0238 (size: 0x8)
    class UStaticMeshComponent* PropsGround_carton_1;                                 // 0x0240 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent05;                                // 0x0248 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent04;                                // 0x0250 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent02;                                // 0x0258 (size: 0x8)
    class USceneComponent* SharedRoot;                                                // 0x0260 (size: 0x8)

}; // Size: 0x268

#endif
