#ifndef UE4SS_SDK_G_Stairs_type_02_HPP
#define UE4SS_SDK_G_Stairs_type_02_HPP

class AG_Stairs_type_02_C : public AActor
{
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0228 (size: 0x8)
    class UStaticMeshComponent* Cube;                                                 // 0x0230 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0238 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent022;                               // 0x0240 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent016;                               // 0x0248 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent015;                               // 0x0250 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent014;                               // 0x0258 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent013;                               // 0x0260 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent012;                               // 0x0268 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent011;                               // 0x0270 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent03;                                // 0x0278 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent02;                                // 0x0280 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent01;                                // 0x0288 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0;                                 // 0x0290 (size: 0x8)
    class USceneComponent* SharedRoot;                                                // 0x0298 (size: 0x8)

}; // Size: 0x2A0

#endif
