#ifndef UE4SS_SDK_G_Stairs_type_06_HPP
#define UE4SS_SDK_G_Stairs_type_06_HPP

class AG_Stairs_type_06_C : public AActor
{
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0228 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0230 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0238 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0240 (size: 0x8)
    class UStaticMeshComponent* Collider_slope;                                       // 0x0248 (size: 0x8)
    class UStaticMeshComponent* Collider_top;                                         // 0x0250 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent09;                                // 0x0258 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent07;                                // 0x0260 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent06;                                // 0x0268 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent05;                                // 0x0270 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent04;                                // 0x0278 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent03;                                // 0x0280 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent02;                                // 0x0288 (size: 0x8)
    class USceneComponent* SharedRoot;                                                // 0x0290 (size: 0x8)

}; // Size: 0x298

#endif
