#ifndef UE4SS_SDK_Rooftop_Block_S_Sloped_HPP
#define UE4SS_SDK_Rooftop_Block_S_Sloped_HPP

class ARooftop_Block_S_Sloped_C : public AActor
{
    class UStaticMeshComponent* Porchroof_box_small;                                  // 0x0228 (size: 0x8)
    class UBoxComponent* Box1;                                                        // 0x0230 (size: 0x8)
    class UBoxComponent* Box;                                                         // 0x0238 (size: 0x8)
    class UStaticMeshComponent* WoodPlane_01;                                         // 0x0240 (size: 0x8)
    class UStaticMeshComponent* Door_A3_bat;                                          // 0x0248 (size: 0x8)
    class UStaticMeshComponent* Metel_vent_cap;                                       // 0x0250 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0258 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0260 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0268 (size: 0x8)

}; // Size: 0x270

#endif
