#ifndef UE4SS_SDK_Scaffoldings_blocker_02_HPP
#define UE4SS_SDK_Scaffoldings_blocker_02_HPP

class AScaffoldings_blocker_02_C : public AActor
{
    class UStaticMeshComponent* PropsGround01_09;                                     // 0x0228 (size: 0x8)
    class UStaticMeshComponent* PropsGround01_17;                                     // 0x0230 (size: 0x8)
    class UStaticMeshComponent* Plastic_packed_box_b2;                                // 0x0238 (size: 0x8)
    class UStaticMeshComponent* Plastic_Crate;                                        // 0x0240 (size: 0x8)
    class UStaticMeshComponent* PropsGround01_00;                                     // 0x0248 (size: 0x8)
    class UStaticMeshComponent* PropsGround01_06;                                     // 0x0250 (size: 0x8)
    class UStaticMeshComponent* PropsGround01_01;                                     // 0x0258 (size: 0x8)
    class UStaticMeshComponent* PropsGround01_02;                                     // 0x0260 (size: 0x8)
    class UStaticMeshComponent* PropsGround01_03;                                     // 0x0268 (size: 0x8)
    class UStaticMeshComponent* Plastic_packed_box_b;                                 // 0x0270 (size: 0x8)
    class UStaticMeshComponent* PropsGround01_04;                                     // 0x0278 (size: 0x8)
    class UStaticMeshComponent* PropsGround01_05;                                     // 0x0280 (size: 0x8)
    class UStaticMeshComponent* PropsGround01_12;                                     // 0x0288 (size: 0x8)
    class UStaticMeshComponent* PropsGround01_10;                                     // 0x0290 (size: 0x8)
    class UStaticMeshComponent* PropsGround01_11;                                     // 0x0298 (size: 0x8)
    class UStaticMeshComponent* PropsGround_carton_1;                                 // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* Plastic_packed_box_b1;                                // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* PropsGround01_08;                                     // 0x02B0 (size: 0x8)
    class UBoxComponent* Box;                                                         // 0x02B8 (size: 0x8)
    class USceneComponent* SharedRoot;                                                // 0x02C0 (size: 0x8)

}; // Size: 0x2C8

#endif
