#ifndef UE4SS_SDK_Washing_Machine_a_open_HPP
#define UE4SS_SDK_Washing_Machine_a_open_HPP

class AWashing_Machine_a_open_C : public AActor
{
    class UCOMP_CatSpot_C* COMP_CatSpot;                                              // 0x0228 (size: 0x8)
    class UChildActorComponent* ChildActor;                                           // 0x0230 (size: 0x8)
    class UStaticMeshComponent* Cube;                                                 // 0x0238 (size: 0x8)
    class UBoxComponent* Box5;                                                        // 0x0240 (size: 0x8)
    class UBoxComponent* Box1;                                                        // 0x0248 (size: 0x8)
    class UBoxComponent* Box4;                                                        // 0x0250 (size: 0x8)
    class UBoxComponent* Box3;                                                        // 0x0258 (size: 0x8)
    class UBoxComponent* Box2;                                                        // 0x0260 (size: 0x8)
    class UBoxComponent* Box;                                                         // 0x0268 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0270 (size: 0x8)

}; // Size: 0x278

#endif
