#ifndef UE4SS_SDK_ABP_Droid_HPP
#define UE4SS_SDK_ABP_Droid_HPP

class UABP_Droid_C : public UHKAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x02C0 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x02C8 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57;                     // 0x02F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56;                     // 0x0320 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55;                     // 0x0348 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54;                     // 0x0370 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53;                     // 0x0398 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52;                     // 0x03C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51;                     // 0x03E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50;                     // 0x0410 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49;                     // 0x0438 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48;                     // 0x0460 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47;                     // 0x0488 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46;                     // 0x04B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45;                     // 0x04D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44;                     // 0x0500 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43;                     // 0x0528 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_1;                                // 0x0550 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_3;        // 0x0618 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_2;        // 0x0710 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_1;                     // 0x0808 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42;                     // 0x0838 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41;                     // 0x0860 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x0888 (size: 0xC8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_1;        // 0x0950 (size: 0xF8)
    FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator;          // 0x0A48 (size: 0xF8)
    FAnimNode_StateResult AnimGraphNode_CustomTransitionResult;                       // 0x0B40 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40;                     // 0x0B70 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0x0B98 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x0BC0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x0BE8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x0C10 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x0C38 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x0C60 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_26;                               // 0x0C88 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x0CB8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_25;                               // 0x0D38 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x0D68 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_24;                               // 0x0DE8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4;                              // 0x0E18 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0x0EC8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x0EF8 (size: 0x80)
    FAnimNode_Slot AnimGraphNode_Slot_6;                                              // 0x0F78 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0x0FC0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x0FF0 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16;                       // 0x1070 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x1110 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x1190 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25;                           // 0x11C0 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x11E8 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24;                           // 0x1218 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x1240 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x1270 (size: 0x80)
    FAnimNode_Slot AnimGraphNode_Slot_5;                                              // 0x12F0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x1338 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x1368 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x1390 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x13B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x13E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x1408 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x1430 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x1458 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x1480 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x14A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x14D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x14F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x1520 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x1548 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x1570 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x1598 (size: 0x28)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8;                      // 0x15C0 (size: 0xE8)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x16A8 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23;                           // 0x16D8 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x1700 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x1730 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x1758 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x17D8 (size: 0x30)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7;                      // 0x1808 (size: 0xE8)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x18F0 (size: 0x30)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6;                      // 0x1920 (size: 0xE8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15;                       // 0x1A08 (size: 0xA0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5;                      // 0x1AA8 (size: 0xE8)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x1B90 (size: 0x30)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4;                      // 0x1BC0 (size: 0xE8)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x1CA8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0x1CD8 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x1D88 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22;                           // 0x1DB8 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x1DE0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x1E10 (size: 0xB0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9;                          // 0x1EC0 (size: 0x158)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;     // 0x2018 (size: 0x20)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8;                          // 0x2038 (size: 0x158)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x2190 (size: 0xB0)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;     // 0x2240 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;     // 0x2260 (size: 0x20)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2;                                    // 0x2280 (size: 0x1E0)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_1;                                    // 0x2460 (size: 0x1E0)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;     // 0x2640 (size: 0x20)
    FAnimNode_Slot AnimGraphNode_Slot_4;                                              // 0x2660 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7;                          // 0x26A8 (size: 0x158)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4;                                  // 0x2800 (size: 0x108)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_17;                                     // 0x2908 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_16;                                     // 0x29F8 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_15;                                     // 0x2AE8 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_14;                                     // 0x2BD8 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_13;                                     // 0x2CC8 (size: 0xF0)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;     // 0x2DB8 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3;                                  // 0x2DD8 (size: 0x108)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_12;                                     // 0x2EE0 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_11;                                     // 0x2FD0 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_10;                                     // 0x30C0 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_9;                                      // 0x31B0 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_8;                                      // 0x32A0 (size: 0xF0)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;     // 0x3390 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2;                                  // 0x33B0 (size: 0x108)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_7;                                      // 0x34B8 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_6;                                      // 0x35A8 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_5;                                      // 0x3698 (size: 0xF0)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x3788 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x37A8 (size: 0x20)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6;                          // 0x37C8 (size: 0x158)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x3920 (size: 0x108)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_4;                                      // 0x3A28 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_3;                                      // 0x3B18 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_2;                                      // 0x3C08 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_1;                                      // 0x3CF8 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone;                                        // 0x3DE8 (size: 0xF0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5;                          // 0x3ED8 (size: 0x158)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x4030 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x4058 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x4080 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x40A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x40D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x40F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x4120 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x4148 (size: 0x28)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;                      // 0x4170 (size: 0xE8)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0x4258 (size: 0xE8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21;                           // 0x4340 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6;                      // 0x4368 (size: 0xC0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14;                       // 0x4428 (size: 0xA0)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x44C8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x44F8 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13;                       // 0x4578 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x4618 (size: 0x80)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5;                      // 0x4698 (size: 0xC0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x4758 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20;                           // 0x47D8 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12;                       // 0x4800 (size: 0xA0)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x48A0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x48D0 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19;                           // 0x4950 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4;                      // 0x4978 (size: 0xC0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11;                       // 0x4A38 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x4AD8 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18;                           // 0x4B58 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x4B80 (size: 0xC0)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x4C40 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17;                           // 0x4C70 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10;                       // 0x4C98 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x4D38 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x4DB8 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16;                           // 0x4DE8 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9;                        // 0x4E10 (size: 0xA0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;                           // 0x4EB0 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x4ED8 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x4F98 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x4FC0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x4FF0 (size: 0xB0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x50A0 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x51F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x5220 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x5248 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x5270 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x5298 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x52C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x52E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x5310 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x5338 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x5360 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x5388 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x53B0 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8;                        // 0x5430 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x54D0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x5550 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x5580 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7;                        // 0x5600 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x56A0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x5720 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x5750 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6;                        // 0x57D0 (size: 0xA0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0x5870 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x5910 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x5990 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x5A30 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x5AB0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x5B30 (size: 0x30)
    FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot;                                // 0x5B60 (size: 0x90)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x5BF0 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x5C20 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x5C48 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x5C90 (size: 0xA0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x5D30 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x5DF0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x5E18 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x5E40 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x5E68 (size: 0xA0)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x5F08 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x5F38 (size: 0xB0)
    FAnimNode_Fabrik AnimGraphNode_Fabrik;                                            // 0x5FF0 (size: 0x190)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x6180 (size: 0x28)
    FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh;                        // 0x61A8 (size: 0x1D8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x6380 (size: 0x158)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x64D8 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x6520 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x6548 (size: 0x158)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x66A0 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x6740 (size: 0x80)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x67C0 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x6808 (size: 0x158)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x6960 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x69A8 (size: 0x158)
    FAnimNode_Inertialization AnimGraphNode_Inertialization;                          // 0x6B00 (size: 0x70)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x6B70 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x6B98 (size: 0x28)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x6BC0 (size: 0xE8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x6CA8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x6CD0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x6CF8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x6D20 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x6D48 (size: 0x28)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x6D70 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x6D90 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x6DB0 (size: 0x108)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK;                                      // 0x6EC0 (size: 0x1E0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x70A0 (size: 0xE8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x7188 (size: 0xC0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x7248 (size: 0xA0)
    class ABP_Droid_C* Droid;                                                         // 0x72E8 (size: 0x8)
    bool IsMoving;                                                                    // 0x72F0 (size: 0x1)
    bool bLookAtEnable;                                                               // 0x72F1 (size: 0x1)
    bool IsHoldingActor;                                                              // 0x72F2 (size: 0x1)
    bool IsAboutToStumble;                                                            // 0x72F3 (size: 0x1)
    bool IsStumbling;                                                                 // 0x72F4 (size: 0x1)
    bool HasStumbled;                                                                 // 0x72F5 (size: 0x1)
    bool IsRisingFromStumble;                                                         // 0x72F6 (size: 0x1)
    bool IsTalking;                                                                   // 0x72F7 (size: 0x1)
    class UAnimSequence* TalkingAnimation;                                            // 0x72F8 (size: 0x8)
    bool hasPlayingAnimation;                                                         // 0x7300 (size: 0x1)
    bool IsInRepelMode;                                                               // 0x7301 (size: 0x1)
    bool IsPhysio;                                                                    // 0x7302 (size: 0x1)
    bool IsRepellingCat;                                                              // 0x7303 (size: 0x1)
    class UAnimSequence* PlayingAnimation;                                            // 0x7308 (size: 0x8)
    bool IsPlayingAnimationLooping;                                                   // 0x7310 (size: 0x1)
    bool SkipIdleAnimationBlend;                                                      // 0x7311 (size: 0x1)
    FRotator LastHeadRotationDelta;                                                   // 0x7314 (size: 0xC)
    bool IsShowing;                                                                   // 0x7320 (size: 0x1)
    bool BlendShowDirectionWithIdle;                                                  // 0x7321 (size: 0x1)
    float ShowX;                                                                      // 0x7324 (size: 0x4)
    float ShowY;                                                                      // 0x7328 (size: 0x4)
    float smoothHeadSpeed;                                                            // 0x732C (size: 0x4)
    bool IsAudioInitialized;                                                          // 0x7330 (size: 0x1)
    class UAnimSequence* CurrentIdleAnimation;                                        // 0x7338 (size: 0x8)
    bool HasBegunPlay;                                                                // 0x7340 (size: 0x1)
    bool IsUsing;                                                                     // 0x7341 (size: 0x1)
    FVector LookAtTarget;                                                             // 0x7344 (size: 0xC)
    FVector LookAtTargetDirection;                                                    // 0x7350 (size: 0xC)
    FVector ShowDirectionTargetLocation;                                              // 0x735C (size: 0xC)
    EDroidLookAtType ActiveLookAtType;                                                // 0x7368 (size: 0x1)
    FRotator HeadLookAtDeltaRotator;                                                  // 0x736C (size: 0xC)
    float WalkTargetTurningAngle;                                                     // 0x7378 (size: 0x4)
    float WalkTargetMovementSpeed;                                                    // 0x737C (size: 0x4)
    FVector CurrentShowDirectionLocation;                                             // 0x7380 (size: 0xC)
    FRotator ShowDirectionLookAtRotator;                                              // 0x738C (size: 0xC)
    EDroidMovementState CurrentDroidMovementState;                                    // 0x7398 (size: 0x1)
    EDroidMovementState PreviousMovementState;                                        // 0x7399 (size: 0x1)
    bool bWalkInterupted;                                                             // 0x739A (size: 0x1)
    int32 StepTransitionNotify;                                                       // 0x739C (size: 0x4)
    bool bEnableFootstepTransition;                                                   // 0x73A0 (size: 0x1)
    FVector LookAtOffset;                                                             // 0x73A4 (size: 0xC)
    float RepositionDuration;                                                         // 0x73B0 (size: 0x4)
    int32 VB_Hips_Spine_Index;                                                        // 0x73B4 (size: 0x4)
    int32 VB_Head_Index;                                                              // 0x73B8 (size: 0x4)
    FFuzzyBool LookAtFuzzy;                                                           // 0x73BC (size: 0xC)
    FFuzzyBool LookAtRandomFuzzy;                                                     // 0x73C8 (size: 0xC)
    bool RandomiseLookAtEnable;                                                       // 0x73D4 (size: 0x1)
    FLookAtAnimationState LookAtState;                                                // 0x73D8 (size: 0x10)
    FVectorSpringState LookAtSpringState;                                             // 0x73E8 (size: 0x18)
    FLookAtAnimationState ShowDirectionLookAtState;                                   // 0x7400 (size: 0x10)
    FTimerHandle FirstLookAtTimerHandle;                                              // 0x7410 (size: 0x8)
    FTimerHandle LookAtRandomFlipTimerHandle;                                         // 0x7418 (size: 0x8)
    bool KeepIdleWhenMoving;                                                          // 0x7420 (size: 0x1)
    float servoIdealPitch;                                                            // 0x7424 (size: 0x4)
    class UAnimSequence* PreviousIdleAnimation;                                       // 0x7428 (size: 0x8)
    bool CustomIdleIsValid;                                                           // 0x7430 (size: 0x1)
    class UDroidUsableComponent* CurrentUsable;                                       // 0x7438 (size: 0x8)
    class USoundWave* servo base;                                                     // 0x7440 (size: 0x8)
    bool bIsStreamedIn;                                                               // 0x7448 (size: 0x1)
    float MovementStopingAngle;                                                       // 0x744C (size: 0x4)
    FTransform OnStopDroidTransform;                                                  // 0x7450 (size: 0x30)
    bool LeftFootLocking;                                                             // 0x7480 (size: 0x1)
    bool RightFootLocking;                                                            // 0x7481 (size: 0x1)
    FTransform LeftFootBoneFootLockingTransform;                                      // 0x7490 (size: 0x30)
    FTransform RightFootBoneFootLockingTransform;                                     // 0x74C0 (size: 0x30)
    float RightFootLockingBlendRatio;                                                 // 0x74F0 (size: 0x4)
    float LeftfootLockingBlendRatio;                                                  // 0x74F4 (size: 0x4)
    bool bCanExitWalk;                                                                // 0x74F8 (size: 0x1)
    float WalkTurnFactor;                                                             // 0x74FC (size: 0x4)
    bool bIsLeftFootUp;                                                               // 0x7500 (size: 0x1)
    class UDroidMovementAnimationSettings* CurrentMovementAnimationSetting;           // 0x7508 (size: 0x8)
    float TurnTurningAngle;                                                           // 0x7510 (size: 0x4)
    bool IsBlendingIdle;                                                              // 0x7514 (size: 0x1)
    bool bDroidIsInMoveTo;                                                            // 0x7515 (size: 0x1)
    float IdleBlendTime;                                                              // 0x7518 (size: 0x4)
    EDroidBehaviorState BehaviorState;                                                // 0x751C (size: 0x1)
    float DazzledYaw;                                                                 // 0x7520 (size: 0x4)
    float DazzledPitch;                                                               // 0x7524 (size: 0x4)
    class UAnimSequence* OnMeowedAnimation;                                           // 0x7528 (size: 0x8)
    bool bIsInRagdoll;                                                                // 0x7530 (size: 0x1)
    class UBlendSpace* CurrentDazzledBlendspace;                                      // 0x7538 (size: 0x8)
    bool bRagdollMode;                                                                // 0x7540 (size: 0x1)
    EDroidPosture CurrentDroidPosture;                                                // 0x7541 (size: 0x1)
    class UAnimSequence* CurrentStumbleAnimation;                                     // 0x7548 (size: 0x8)
    class UAnimSequence* CurrentRaiseFromFrontAnimation;                              // 0x7550 (size: 0x8)
    class UAnimSequence* CurrentFallingAnimation;                                     // 0x7558 (size: 0x8)
    class UAnimSequence* CurrentRaiseFromBackAnimation;                               // 0x7560 (size: 0x8)
    bool bStumbleAnimationIsValid;                                                    // 0x7568 (size: 0x1)
    bool RaiseFromBackAnimationIsValid;                                               // 0x7569 (size: 0x1)
    bool bRaiseFromFrontAnimationIsValid;                                             // 0x756A (size: 0x1)
    bool bFallingAnimationIsValid;                                                    // 0x756B (size: 0x1)
    bool bRagdollFrontSideDown;                                                       // 0x756C (size: 0x1)
    bool PreviousIdleIsValid;                                                         // 0x756D (size: 0x1)
    float PlayAnimationStartPosition;                                                 // 0x7570 (size: 0x4)
    int32 currentSoundingLateral;                                                     // 0x7574 (size: 0x4)
    class UAnimMontage* CurrentTalkingMontage;                                        // 0x7578 (size: 0x8)
    class UAnimSequence* PreviousPlayAnimation;                                       // 0x7580 (size: 0x8)
    class UAnimMontage* CurrentPlayAnimationMontage;                                  // 0x7588 (size: 0x8)
    float WalkStartingAngle;                                                          // 0x7590 (size: 0x4)
    bool CurrentUsableIsUsingAnimationLoop;                                           // 0x7594 (size: 0x1)
    bool CurrentUsableIsBeingUsed;                                                    // 0x7595 (size: 0x1)
    FABP_Droid_COnUpdateAnimation OnUpdateAnimation;                                  // 0x7598 (size: 0x10)
    void OnUpdateAnimation(float DeltaTime);
    FTimerHandle EndingLookAtTimer;                                                   // 0x75A8 (size: 0x8)
    FRotator LookAtAngleLimit;                                                        // 0x75B0 (size: 0xC)
    bool TurningReset;                                                                // 0x75BC (size: 0x1)
    float EnterTurningAngle;                                                          // 0x75C0 (size: 0x4)
    bool hasTalkingAnimation;                                                         // 0x75C4 (size: 0x1)
    FVector CustomHeadScale;                                                          // 0x75C8 (size: 0xC)
    int32 getAwayCounter;                                                             // 0x75D4 (size: 0x4)
    class UAnimSequence* CurrentThrowingObjectAnimation;                              // 0x75D8 (size: 0x8)
    bool ThrowingAnimationBlendWithIdle;                                              // 0x75E0 (size: 0x1)
    class UAnimMontage* CurrentIdleMontage;                                           // 0x75E8 (size: 0x8)
    bool PlayingAnimationShouldLoop;                                                  // 0x75F0 (size: 0x1)
    class USoundBase* sfx footstep base;                                              // 0x75F8 (size: 0x8)
    class UBlendSpace* ShowDirectionBlendSpace;                                       // 0x7600 (size: 0x8)
    class USkeletalMeshComponent* SkeletalMeshComponent;                              // 0x7608 (size: 0x8)

    void AnimGraph(FPoseLink& AnimGraph);
    void GetDialogCurrentLineInfo(class UAnimSequence*& Animation, bool& Advanced_IsSynchronized, bool& Advanced_LoopAnimation, bool& IsLastIndex);
    FRotator FindLookAtRotator_NonPure(FLookAtAnimationState& _lookAtState, bool _lookAtEnable, FVector _lookAtLocation, float _angleLimit, float _hysteresis, int32 _virtualBoneBaseEffector, int32 _virtualBoneEndEffector, float _speed, bool& _enable);
    void GetShowDirectionLookAtLocation(FVector TargetLocation, FName From Bone, float Angle Limit, float Speed, bool& _enable, bool& _isInSight, FRotator& LookAt Rotator);
    void GetShowDirectionCoordinates(bool bDrawDebug, float& X, float& Y);
    void GetVirtualBoneIndex(FName Bone Name, int32& Bone Index);
    void SetDroid(class ABP_Droid_C* Droid);
    void Tick_6246EF4646E19036986D72BAA17E607B(float Ratio);
