#ifndef UE4SS_SDK_BP_550_balcon_open_01_HPP
#define UE4SS_SDK_BP_550_balcon_open_01_HPP

class ABP_550_balcon_open_01_C : public AActor
{
    class UStaticMeshComponent* SoundCollision_03;                                    // 0x0228 (size: 0x8)
    class UStaticMeshComponent* SoundCollision_02;                                    // 0x0230 (size: 0x8)
    class UStaticMeshComponent* SoundCollision_01;                                    // 0x0238 (size: 0x8)
    class USplineRailComponent* SplineRail1;                                          // 0x0240 (size: 0x8)
    class UStaticMeshComponent* 550_balcon_open_01_grid;                              // 0x0248 (size: 0x8)
    class UStaticMeshComponent* Porchroof_box;                                        // 0x0250 (size: 0x8)
    class UBoxComponent* Box3;                                                        // 0x0258 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0260 (size: 0x8)

}; // Size: 0x268

#endif
