#ifndef UE4SS_SDK_BP_Grille_01_HPP
#define UE4SS_SDK_BP_Grille_01_HPP

class ABP_Grille_01_C : public AActor
{
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0228 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0230 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0238 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0240 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0248 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0250 (size: 0x8)
    class UStaticMeshComponent* Metal_stuff_11;                                       // 0x0258 (size: 0x8)
    class UStaticMeshComponent* Metal_stuff_10;                                       // 0x0260 (size: 0x8)
    class UStaticMeshComponent* Grillage_450x200;                                     // 0x0268 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0270 (size: 0x8)

}; // Size: 0x278

#endif
