#ifndef UE4SS_SDK_BP_Sewers_Door_B_HPP
#define UE4SS_SDK_BP_Sewers_Door_B_HPP

class ABP_Sewers_Door_B_C : public AActor
{
    class UStaticMeshComponent* Sewers_Door_B_08_02;                                  // 0x0228 (size: 0x8)
    class UStaticMeshComponent* Sewers_Door_B_07_02;                                  // 0x0230 (size: 0x8)
    class UStaticMeshComponent* Sewers_Door_B_04_02;                                  // 0x0238 (size: 0x8)
    class UStaticMeshComponent* Sewers_Door_B_03_02;                                  // 0x0240 (size: 0x8)
    class UStaticMeshComponent* Sewers_Door_B_02_03;                                  // 0x0248 (size: 0x8)
    class UStaticMeshComponent* Sewers_Door_B_02_04;                                  // 0x0250 (size: 0x8)
    class UStaticMeshComponent* Sewers_Door_B_02_02;                                  // 0x0258 (size: 0x8)
    class UStaticMeshComponent* Sewers_Door_B_08;                                     // 0x0260 (size: 0x8)
    class UStaticMeshComponent* Sewers_Door_B_07;                                     // 0x0268 (size: 0x8)
    class UStaticMeshComponent* Sewers_Door_B_06;                                     // 0x0270 (size: 0x8)
    class UStaticMeshComponent* Sewers_Door_B_05;                                     // 0x0278 (size: 0x8)
    class UStaticMeshComponent* Sewers_Door_B_04;                                     // 0x0280 (size: 0x8)
    class UStaticMeshComponent* Sewers_Door_B_03;                                     // 0x0288 (size: 0x8)
    class UStaticMeshComponent* Sewers_Door_B_02;                                     // 0x0290 (size: 0x8)
    class UStaticMeshComponent* Sewers_Door_B_01;                                     // 0x0298 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x02A0 (size: 0x8)

}; // Size: 0x2A8

#endif
