#ifndef UE4SS_SDK_BP_Sewers_Door_A_HPP
#define UE4SS_SDK_BP_Sewers_Door_A_HPP

class ABP_Sewers_Door_A_C : public AActor
{
    class UStaticMeshComponent* Sewers_Door_A_04_02;                                  // 0x0228 (size: 0x8)
    class UStaticMeshComponent* Sewers_Door_A_03_02;                                  // 0x0230 (size: 0x8)
    class UStaticMeshComponent* Sewers_Door_A_02_04;                                  // 0x0238 (size: 0x8)
    class UStaticMeshComponent* Sewers_Door_A_02_03;                                  // 0x0240 (size: 0x8)
    class UStaticMeshComponent* Sewers_Door_A_02_02;                                  // 0x0248 (size: 0x8)
    class UStaticMeshComponent* Sewers_Door_A_08_02;                                  // 0x0250 (size: 0x8)
    class UStaticMeshComponent* Sewers_Door_A_07_02;                                  // 0x0258 (size: 0x8)
    class UStaticMeshComponent* Sewers_Door_A_08;                                     // 0x0260 (size: 0x8)
    class UStaticMeshComponent* Sewers_Door_A_07;                                     // 0x0268 (size: 0x8)
    class UStaticMeshComponent* Sewers_Door_A_06;                                     // 0x0270 (size: 0x8)
    class UStaticMeshComponent* Sewers_Door_A_05;                                     // 0x0278 (size: 0x8)
    class UStaticMeshComponent* Sewers_Door_A_04;                                     // 0x0280 (size: 0x8)
    class UStaticMeshComponent* Sewers_Door_A_03;                                     // 0x0288 (size: 0x8)
    class UStaticMeshComponent* Sewers_Door_A_02;                                     // 0x0290 (size: 0x8)
    class UStaticMeshComponent* Sewers_Door_A_01;                                     // 0x0298 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x02A0 (size: 0x8)

}; // Size: 0x2A8

#endif
