#ifndef UE4SS_SDK_Engine_HPP
#define UE4SS_SDK_Engine_HPP

#include "Engine_enums.hpp"

struct FTickFunction
{
    TEnumAsByte<ETickingGroup> TickGroup;                                             // 0x0008 (size: 0x1)
    TEnumAsByte<ETickingGroup> EndTickGroup;                                          // 0x0009 (size: 0x1)
    uint8 bTickEvenWhenPaused;                                                        // 0x000A (size: 0x1)
    uint8 bCanEverTick;                                                               // 0x000A (size: 0x1)
    uint8 bStartWithTickEnabled;                                                      // 0x000A (size: 0x1)
    uint8 bAllowTickOnDedicatedServer;                                                // 0x000A (size: 0x1)
    float TickInterval;                                                               // 0x000C (size: 0x4)

}; // Size: 0x28

struct FActorTickFunction : public FTickFunction
{
}; // Size: 0x30

struct FRepMovement
{
    FVector LinearVelocity;                                                           // 0x0000 (size: 0xC)
    FVector AngularVelocity;                                                          // 0x000C (size: 0xC)
    FVector Location;                                                                 // 0x0018 (size: 0xC)
    FRotator Rotation;                                                                // 0x0024 (size: 0xC)
    uint8 bSimulatedPhysicSleep;                                                      // 0x0030 (size: 0x1)
    uint8 bRepPhysics;                                                                // 0x0030 (size: 0x1)
    EVectorQuantization LocationQuantizationLevel;                                    // 0x0031 (size: 0x1)
    EVectorQuantization VelocityQuantizationLevel;                                    // 0x0032 (size: 0x1)
    ERotatorQuantization RotationQuantizationLevel;                                   // 0x0033 (size: 0x1)

}; // Size: 0x34

struct FVector_NetQuantize100 : public FVector
{
}; // Size: 0xC

struct FRepAttachment
{
    class AActor* AttachParent;                                                       // 0x0000 (size: 0x8)
    FVector_NetQuantize100 LocationOffset;                                            // 0x0008 (size: 0xC)
    FVector_NetQuantize100 RelativeScale3D;                                           // 0x0014 (size: 0xC)
    FRotator RotationOffset;                                                          // 0x0020 (size: 0xC)
    FName AttachSocket;                                                               // 0x002C (size: 0x8)
    class USceneComponent* AttachComponent;                                           // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FVector_NetQuantize : public FVector
{
}; // Size: 0xC

struct FVector_NetQuantizeNormal : public FVector
{
}; // Size: 0xC

struct FHitResult
{
    int32 FaceIndex;                                                                  // 0x0000 (size: 0x4)
    float Time;                                                                       // 0x0004 (size: 0x4)
    float Distance;                                                                   // 0x0008 (size: 0x4)
    FVector_NetQuantize Location;                                                     // 0x000C (size: 0xC)
    FVector_NetQuantize ImpactPoint;                                                  // 0x0018 (size: 0xC)
    FVector_NetQuantizeNormal Normal;                                                 // 0x0024 (size: 0xC)
    FVector_NetQuantizeNormal ImpactNormal;                                           // 0x0030 (size: 0xC)
    FVector_NetQuantize TraceStart;                                                   // 0x003C (size: 0xC)
    FVector_NetQuantize TraceEnd;                                                     // 0x0048 (size: 0xC)
    float PenetrationDepth;                                                           // 0x0054 (size: 0x4)
    int32 Item;                                                                       // 0x0058 (size: 0x4)
    uint8 ElementIndex;                                                               // 0x005C (size: 0x1)
    uint8 bBlockingHit;                                                               // 0x005D (size: 0x1)
    uint8 bStartPenetrating;                                                          // 0x005D (size: 0x1)
    TWeakObjectPtr<class UPhysicalMaterial> PhysMaterial;                             // 0x0060 (size: 0x8)
    TWeakObjectPtr<class AActor> Actor;                                               // 0x0068 (size: 0x8)
    TWeakObjectPtr<class UPrimitiveComponent> Component;                              // 0x0070 (size: 0x8)
    FName BoneName;                                                                   // 0x0078 (size: 0x8)
    FName MyBoneName;                                                                 // 0x0080 (size: 0x8)

}; // Size: 0x88

class AActor : public UObject
{
    FActorTickFunction PrimaryActorTick;                                              // 0x0030 (size: 0x30)
    uint8 bNetTemporary;                                                              // 0x0060 (size: 0x1)
    uint8 bNetStartup;                                                                // 0x0060 (size: 0x1)
    uint8 bOnlyRelevantToOwner;                                                       // 0x0060 (size: 0x1)
    uint8 bAlwaysRelevant;                                                            // 0x0060 (size: 0x1)
    uint8 bReplicateMovement;                                                         // 0x0060 (size: 0x1)
    uint8 bHidden;                                                                    // 0x0060 (size: 0x1)
    uint8 bTearOff;                                                                   // 0x0060 (size: 0x1)
    uint8 bForceNetAddressable;                                                       // 0x0060 (size: 0x1)
    uint8 bExchangedRoles;                                                            // 0x0061 (size: 0x1)
    uint8 bNetLoadOnClient;                                                           // 0x0061 (size: 0x1)
    uint8 bNetUseOwnerRelevancy;                                                      // 0x0061 (size: 0x1)
    uint8 bRelevantForNetworkReplays;                                                 // 0x0061 (size: 0x1)
    uint8 bRelevantForLevelBounds;                                                    // 0x0061 (size: 0x1)
    uint8 bReplayRewindable;                                                          // 0x0061 (size: 0x1)
    uint8 bAllowTickBeforeBeginPlay;                                                  // 0x0061 (size: 0x1)
    uint8 bAutoDestroyWhenFinished;                                                   // 0x0061 (size: 0x1)
    uint8 bCanBeDamaged;                                                              // 0x0062 (size: 0x1)
    uint8 bBlockInput;                                                                // 0x0062 (size: 0x1)
    uint8 bCollideWhenPlacing;                                                        // 0x0062 (size: 0x1)
    uint8 bFindCameraComponentWhenViewTarget;                                         // 0x0062 (size: 0x1)
    uint8 bGenerateOverlapEventsDuringLevelStreaming;                                 // 0x0062 (size: 0x1)
    uint8 bIgnoresOriginShifting;                                                     // 0x0062 (size: 0x1)
    uint8 bEnableAutoLODGeneration;                                                   // 0x0062 (size: 0x1)
    uint8 bIsEditorOnlyActor;                                                         // 0x0062 (size: 0x1)
    uint8 bActorSeamlessTraveled;                                                     // 0x0063 (size: 0x1)
    uint8 bReplicates;                                                                // 0x0063 (size: 0x1)
    uint8 bCanBeInCluster;                                                            // 0x0063 (size: 0x1)
    uint8 bAllowReceiveTickEventOnDedicatedServer;                                    // 0x0063 (size: 0x1)
    uint8 bActorEnableCollision;                                                      // 0x0064 (size: 0x1)
    uint8 bActorIsBeingDestroyed;                                                     // 0x0064 (size: 0x1)
    EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming;              // 0x0065 (size: 0x1)
    EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming;       // 0x0066 (size: 0x1)
    TEnumAsByte<ENetRole> RemoteRole;                                                 // 0x0067 (size: 0x1)
    FRepMovement ReplicatedMovement;                                                  // 0x0068 (size: 0x34)
    float InitialLifeSpan;                                                            // 0x009C (size: 0x4)
    float CustomTimeDilation;                                                         // 0x00A0 (size: 0x4)
    FRepAttachment AttachmentReplication;                                             // 0x00A8 (size: 0x40)
    class AActor* Owner;                                                              // 0x00E8 (size: 0x8)
    FName NetDriverName;                                                              // 0x00F0 (size: 0x8)
    TEnumAsByte<ENetRole> Role;                                                       // 0x00F8 (size: 0x1)
    TEnumAsByte<ENetDormancy> NetDormancy;                                            // 0x00F9 (size: 0x1)
    ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod;                  // 0x00FA (size: 0x1)
    TEnumAsByte<EAutoReceiveInput::Type> AutoReceiveInput;                            // 0x00FB (size: 0x1)
    int32 InputPriority;                                                              // 0x00FC (size: 0x4)
    class UInputComponent* InputComponent;                                            // 0x0100 (size: 0x8)
    float NetCullDistanceSquared;                                                     // 0x0108 (size: 0x4)
    int32 NetTag;                                                                     // 0x010C (size: 0x4)
    float NetUpdateFrequency;                                                         // 0x0110 (size: 0x4)
    float MinNetUpdateFrequency;                                                      // 0x0114 (size: 0x4)
    float NetPriority;                                                                // 0x0118 (size: 0x4)
    class APawn* Instigator;                                                          // 0x0120 (size: 0x8)
    TArray<class AActor*> Children;                                                   // 0x0128 (size: 0x10)
    class USceneComponent* RootComponent;                                             // 0x0138 (size: 0x8)
    TArray<class AMatineeActor*> ControllingMatineeActors;                            // 0x0140 (size: 0x10)
    TArray<FName> Layers;                                                             // 0x0158 (size: 0x10)
    TWeakObjectPtr<class UChildActorComponent> ParentComponent;                       // 0x0168 (size: 0x8)
    TArray<FName> Tags;                                                               // 0x0178 (size: 0x10)
    FActorOnTakeAnyDamage OnTakeAnyDamage;                                            // 0x0188 (size: 0x1)
    void TakeAnyDamageSignature(class AActor* DamagedActor, float Damage, const class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
    FActorOnTakePointDamage OnTakePointDamage;                                        // 0x0189 (size: 0x1)
    void TakePointDamageSignature(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, FVector HitLocation, class UPrimitiveComponent* FHitComponent, FName BoneName, FVector ShotFromDirection, const class UDamageType* DamageType, class AActor* DamageCauser);
    FActorOnTakeRadialDamage OnTakeRadialDamage;                                      // 0x018A (size: 0x1)
    void TakeRadialDamageSignature(class AActor* DamagedActor, float Damage, const class UDamageType* DamageType, FVector Origin, FHitResult HitInfo, class AController* InstigatedBy, class AActor* DamageCauser);
    FActorOnActorBeginOverlap OnActorBeginOverlap;                                    // 0x018B (size: 0x1)
    void ActorBeginOverlapSignature(class AActor* OverlappedActor, class AActor* OtherActor);
    FActorOnActorEndOverlap OnActorEndOverlap;                                        // 0x018C (size: 0x1)
    void ActorEndOverlapSignature(class AActor* OverlappedActor, class AActor* OtherActor);
    FActorOnBeginCursorOver OnBeginCursorOver;                                        // 0x018D (size: 0x1)
    void ActorBeginCursorOverSignature(class AActor* TouchedActor);
    FActorOnEndCursorOver OnEndCursorOver;                                            // 0x018E (size: 0x1)
    void ActorEndCursorOverSignature(class AActor* TouchedActor);
    FActorOnClicked OnClicked;                                                        // 0x018F (size: 0x1)
    void ActorOnClickedSignature(class AActor* TouchedActor, FKey ButtonPressed);
    FActorOnReleased OnReleased;                                                      // 0x0190 (size: 0x1)
    void ActorOnReleasedSignature(class AActor* TouchedActor, FKey ButtonReleased);
    FActorOnInputTouchBegin OnInputTouchBegin;                                        // 0x0191 (size: 0x1)
    void ActorOnInputTouchBeginSignature(TEnumAsByte<ETouchIndex::Type> FingerIndex, class AActor* TouchedActor);
    FActorOnInputTouchEnd OnInputTouchEnd;                                            // 0x0192 (size: 0x1)
    void ActorOnInputTouchEndSignature(TEnumAsByte<ETouchIndex::Type> FingerIndex, class AActor* TouchedActor);
    FActorOnInputTouchEnter OnInputTouchEnter;                                        // 0x0193 (size: 0x1)
    void ActorBeginTouchOverSignature(TEnumAsByte<ETouchIndex::Type> FingerIndex, class AActor* TouchedActor);
    FActorOnInputTouchLeave OnInputTouchLeave;                                        // 0x0194 (size: 0x1)
    void ActorEndTouchOverSignature(TEnumAsByte<ETouchIndex::Type> FingerIndex, class AActor* TouchedActor);
    FActorOnActorHit OnActorHit;                                                      // 0x0195 (size: 0x1)
    void ActorHitSignature(class AActor* SelfActor, class AActor* OtherActor, FVector NormalImpulse, const FHitResult& Hit);
    FActorOnDestroyed OnDestroyed;                                                    // 0x0196 (size: 0x1)
    void ActorDestroyedSignature(class AActor* DestroyedActor);
    FActorOnEndPlay OnEndPlay;                                                        // 0x0197 (size: 0x1)
    void ActorEndPlaySignature(class AActor* Actor, TEnumAsByte<EEndPlayReason::Type> EndPlayReason);
    TArray<class UActorComponent*> InstanceComponents;                                // 0x01F8 (size: 0x10)
    TArray<class UActorComponent*> BlueprintCreatedComponents;                        // 0x0208 (size: 0x10)

    bool WasRecentlyRendered(float Tolerance);
    void UserConstructionScript();
    void TearOff();
    void SnapRootComponentTo(class AActor* InParentActor, FName InSocketName);
    void SetTickGroup(TEnumAsByte<ETickingGroup> NewTickGroup);
    void SetTickableWhenPaused(bool bTickableWhenPaused);
    void SetReplicates(bool bInReplicates);
    void SetReplicateMovement(bool bInReplicateMovement);
    void SetOwner(class AActor* NewOwner);
    void SetNetDormancy(TEnumAsByte<ENetDormancy> NewDormancy);
    void SetLifeSpan(float InLifespan);
    void SetAutoDestroyWhenFinished(bool bVal);
    void SetActorTickInterval(float TickInterval);
    void SetActorTickEnabled(bool bEnabled);
    void SetActorScale3D(FVector NewScale3D);
    void SetActorRelativeScale3D(FVector NewRelativeScale);
    void SetActorHiddenInGame(bool bNewHidden);
    void SetActorEnableCollision(bool bNewActorEnableCollision);
    void RemoveTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
    void RemoveTickPrerequisiteActor(class AActor* PrerequisiteActor);
    void ReceiveTick(float DeltaSeconds);
    void ReceiveRadialDamage(float DamageReceived, const class UDamageType* DamageType, FVector Origin, const FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser);
    void ReceivePointDamage(float Damage, const class UDamageType* DamageType, FVector HitLocation, FVector HitNormal, class UPrimitiveComponent* HitComponent, FName BoneName, FVector ShotFromDirection, class AController* InstigatedBy, class AActor* DamageCauser, const FHitResult& HitInfo);
    void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, FVector HitLocation, FVector HitNormal, FVector NormalImpulse, const FHitResult& Hit);
    void ReceiveEndPlay(TEnumAsByte<EEndPlayReason::Type> EndPlayReason);
    void ReceiveDestroyed();
    void ReceiveBeginPlay();
    void ReceiveAnyDamage(float Damage, const class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
    void ReceiveActorOnReleased(FKey ButtonReleased);
    void ReceiveActorOnInputTouchLeave(const TEnumAsByte<ETouchIndex::Type> FingerIndex);
    void ReceiveActorOnInputTouchEnter(const TEnumAsByte<ETouchIndex::Type> FingerIndex);
    void ReceiveActorOnInputTouchEnd(const TEnumAsByte<ETouchIndex::Type> FingerIndex);
    void ReceiveActorOnInputTouchBegin(const TEnumAsByte<ETouchIndex::Type> FingerIndex);
    void ReceiveActorOnClicked(FKey ButtonPressed);
    void ReceiveActorEndOverlap(class AActor* OtherActor);
    void ReceiveActorEndCursorOver();
    void ReceiveActorBeginOverlap(class AActor* OtherActor);
    void ReceiveActorBeginCursorOver();
    void PrestreamTextures(float Seconds, bool bEnableStreaming, int32 CinematicTextureGroups);
    void OnRep_ReplicateMovement();
    void OnRep_ReplicatedMovement();
    void OnRep_Owner();
    void OnRep_Instigator();
    void OnRep_AttachmentReplication();
    void MakeNoise(float Loudness, class APawn* NoiseInstigator, FVector NoiseLocation, float MaxRange, FName Tag);
    class UMaterialInstanceDynamic* MakeMIDForMaterial(class UMaterialInterface* Parent);
    bool K2_TeleportTo(FVector DestLocation, FRotator DestRotation);
    bool K2_SetActorTransform(const FTransform& NewTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    bool K2_SetActorRotation(FRotator NewRotation, bool bTeleportPhysics);
    void K2_SetActorRelativeTransform(const FTransform& NewRelativeTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    void K2_SetActorRelativeRotation(FRotator NewRelativeRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    void K2_SetActorRelativeLocation(FVector NewRelativeLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    bool K2_SetActorLocationAndRotation(FVector NewLocation, FRotator NewRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    bool K2_SetActorLocation(FVector NewLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    void K2_OnReset();
    void K2_OnEndViewTarget(class APlayerController* PC);
    void K2_OnBecomeViewTarget(class APlayerController* PC);
    class USceneComponent* K2_GetRootComponent();
    TArray<class UActorComponent*> K2_GetComponentsByClass(TSubclassOf<class UActorComponent> ComponentClass);
    FRotator K2_GetActorRotation();
    FVector K2_GetActorLocation();
    void K2_DetachFromActor(EDetachmentRule LocationRule, EDetachmentRule RotationRule, EDetachmentRule ScaleRule);
    void K2_DestroyComponent(class UActorComponent* Component);
    void K2_DestroyActor();
    void K2_AttachToComponent(class USceneComponent* Parent, FName SocketName, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);
    void K2_AttachToActor(class AActor* ParentActor, FName SocketName, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);
    void K2_AttachRootComponentToActor(class AActor* InParentActor, FName InSocketName, TEnumAsByte<EAttachLocation::Type> AttachLocationType, bool bWeldSimulatedBodies);
    void K2_AttachRootComponentTo(class USceneComponent* InParent, FName InSocketName, TEnumAsByte<EAttachLocation::Type> AttachLocationType, bool bWeldSimulatedBodies);
    void K2_AddActorWorldTransformKeepScale(const FTransform& DeltaTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    void K2_AddActorWorldTransform(const FTransform& DeltaTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    void K2_AddActorWorldRotation(FRotator DeltaRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    void K2_AddActorWorldOffset(FVector DeltaLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    void K2_AddActorLocalTransform(const FTransform& NewTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    void K2_AddActorLocalRotation(FRotator DeltaRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    void K2_AddActorLocalOffset(FVector DeltaLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    bool IsOverlappingActor(const class AActor* Other);
    bool IsChildActor();
    bool IsActorTickEnabled();
    bool IsActorBeingDestroyed();
    bool HasAuthority();
    float GetVerticalDistanceTo(const class AActor* OtherActor);
    FVector GetVelocity();
    FTransform GetTransform();
    bool GetTickableWhenPaused();
    float GetSquaredHorizontalDistanceTo(const class AActor* OtherActor);
    float GetSquaredDistanceTo(const class AActor* OtherActor);
    TEnumAsByte<ENetRole> GetRemoteRole();
    class UChildActorComponent* GetParentComponent();
    class AActor* GetParentActor();
    class AActor* GetOwner();
    void GetOverlappingComponents(TArray<class UPrimitiveComponent*>& OverlappingComponents);
    void GetOverlappingActors(TArray<class AActor*>& OverlappingActors, TSubclassOf<class AActor> ClassFilter);
    TEnumAsByte<ENetRole> GetLocalRole();
    float GetLifeSpan();
    class AController* GetInstigatorController();
    class APawn* GetInstigator();
    FVector GetInputVectorAxisValue(const FKey InputAxisKey);
    float GetInputAxisValue(const FName InputAxisName);
    float GetInputAxisKeyValue(const FKey InputAxisKey);
    float GetHorizontalDotProductTo(const class AActor* OtherActor);
    float GetHorizontalDistanceTo(const class AActor* OtherActor);
    float GetGameTimeSinceCreation();
    float GetDotProductTo(const class AActor* OtherActor);
    float GetDistanceTo(const class AActor* OtherActor);
    TArray<class UActorComponent*> GetComponentsByTag(TSubclassOf<class UActorComponent> ComponentClass, FName Tag);
    TArray<class UActorComponent*> GetComponentsByInterface(TSubclassOf<class UInterface> Interface);
    class UActorComponent* GetComponentByClass(TSubclassOf<class UActorComponent> ComponentClass);
    FName GetAttachParentSocketName();
    class AActor* GetAttachParentActor();
    void GetAttachedActors(TArray<class AActor*>& OutActors, bool bResetArray);
    void GetAllChildActors(TArray<class AActor*>& ChildActors, bool bIncludeDescendants);
    FVector GetActorUpVector();
    float GetActorTimeDilation();
    float GetActorTickInterval();
    FVector GetActorScale3D();
    FVector GetActorRightVector();
    FVector GetActorRelativeScale3D();
    FVector GetActorForwardVector();
    void GetActorEyesViewPoint(FVector& OutLocation, FRotator& OutRotation);
    bool GetActorEnableCollision();
    void GetActorBounds(bool bOnlyCollidingComponents, FVector& Origin, FVector& BoxExtent, bool bIncludeFromChildActors);
    void ForceNetUpdate();
    void FlushNetDormancy();
    void FinishAddComponent(class UActorComponent* Component, bool bManualAttachment, const FTransform& RelativeTransform);
    void EnableInput(class APlayerController* PlayerController);
    void DisableInput(class APlayerController* PlayerController);
    void DetachRootComponentFromParent(bool bMaintainWorldPosition);
    void AddTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
    void AddTickPrerequisiteActor(class AActor* PrerequisiteActor);
    class UActorComponent* AddComponentByClass(TSubclassOf<class UActorComponent> Class, bool bManualAttachment, const FTransform& RelativeTransform, bool bDeferredFinish);
    class UActorComponent* AddComponent(FName TemplateName, bool bManualAttachment, const FTransform& RelativeTransform, const class UObject* ComponentTemplateContext, bool bDeferredFinish);
    bool ActorHasTag(FName Tag);
}; // Size: 0x228

struct FActorComponentTickFunction : public FTickFunction
{
}; // Size: 0x30

struct FSimpleMemberReference
{
    class UObject* MemberParent;                                                      // 0x0000 (size: 0x8)
    FName MemberName;                                                                 // 0x0008 (size: 0x8)
    FGuid MemberGuid;                                                                 // 0x0010 (size: 0x10)

}; // Size: 0x20

class UActorComponent : public UObject
{
    FActorComponentTickFunction PrimaryComponentTick;                                 // 0x0030 (size: 0x30)
    TArray<FName> ComponentTags;                                                      // 0x0060 (size: 0x10)
    TArray<class UAssetUserData*> AssetUserData;                                      // 0x0070 (size: 0x10)
    int32 UCSSerializationIndex;                                                      // 0x0084 (size: 0x4)
    uint8 bNetAddressable;                                                            // 0x0088 (size: 0x1)
    uint8 bReplicates;                                                                // 0x0088 (size: 0x1)
    uint8 bAutoActivate;                                                              // 0x0089 (size: 0x1)
    uint8 bIsActive;                                                                  // 0x008A (size: 0x1)
    uint8 bEditableWhenInherited;                                                     // 0x008A (size: 0x1)
    uint8 bCanEverAffectNavigation;                                                   // 0x008A (size: 0x1)
    uint8 bIsEditorOnly;                                                              // 0x008A (size: 0x1)
    EComponentCreationMethod CreationMethod;                                          // 0x008C (size: 0x1)
    FActorComponentOnComponentActivated OnComponentActivated;                         // 0x008D (size: 0x1)
    void ActorComponentActivatedSignature(class UActorComponent* Component, bool bReset);
    FActorComponentOnComponentDeactivated OnComponentDeactivated;                     // 0x008E (size: 0x1)
    void ActorComponentDeactivateSignature(class UActorComponent* Component);
    TArray<FSimpleMemberReference> UCSModifiedProperties;                             // 0x0090 (size: 0x10)

    void ToggleActive();
    void SetTickGroup(TEnumAsByte<ETickingGroup> NewTickGroup);
    void SetTickableWhenPaused(bool bTickableWhenPaused);
    void SetIsReplicated(bool ShouldReplicate);
    void SetComponentTickIntervalAndCooldown(float TickInterval);
    void SetComponentTickInterval(float TickInterval);
    void SetComponentTickEnabled(bool bEnabled);
    void SetAutoActivate(bool bNewAutoActivate);
    void SetActive(bool bNewActive, bool bReset);
    void RemoveTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
    void RemoveTickPrerequisiteActor(class AActor* PrerequisiteActor);
    void ReceiveTick(float DeltaSeconds);
    void ReceiveEndPlay(TEnumAsByte<EEndPlayReason::Type> EndPlayReason);
    void ReceiveBeginPlay();
    void OnRep_IsActive();
    void K2_DestroyComponent(class UObject* Object);
    bool IsComponentTickEnabled();
    bool IsBeingDestroyed();
    bool IsActive();
    class AActor* GetOwner();
    float GetComponentTickInterval();
    void Deactivate();
    bool ComponentHasTag(FName Tag);
    void AddTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
    void AddTickPrerequisiteActor(class AActor* PrerequisiteActor);
    void Activate(bool bReset);
}; // Size: 0xB0

class USceneComponent : public UActorComponent
{
    TWeakObjectPtr<class APhysicsVolume> PhysicsVolume;                               // 0x00B8 (size: 0x8)
    class USceneComponent* AttachParent;                                              // 0x00C0 (size: 0x8)
    FName AttachSocketName;                                                           // 0x00C8 (size: 0x8)
    TArray<class USceneComponent*> AttachChildren;                                    // 0x00D0 (size: 0x10)
    TArray<class USceneComponent*> ClientAttachedChildren;                            // 0x00E0 (size: 0x10)
    FVector RelativeLocation;                                                         // 0x011C (size: 0xC)
    FRotator RelativeRotation;                                                        // 0x0128 (size: 0xC)
    FVector RelativeScale3D;                                                          // 0x0134 (size: 0xC)
    FVector ComponentVelocity;                                                        // 0x0140 (size: 0xC)
    uint8 bComponentToWorldUpdated;                                                   // 0x014C (size: 0x1)
    uint8 bAbsoluteLocation;                                                          // 0x014C (size: 0x1)
    uint8 bAbsoluteRotation;                                                          // 0x014C (size: 0x1)
    uint8 bAbsoluteScale;                                                             // 0x014C (size: 0x1)
    uint8 bVisible;                                                                   // 0x014C (size: 0x1)
    uint8 bShouldBeAttached;                                                          // 0x014C (size: 0x1)
    uint8 bShouldSnapLocationWhenAttached;                                            // 0x014C (size: 0x1)
    uint8 bShouldSnapRotationWhenAttached;                                            // 0x014D (size: 0x1)
    uint8 bShouldUpdatePhysicsVolume;                                                 // 0x014D (size: 0x1)
    uint8 bHiddenInGame;                                                              // 0x014D (size: 0x1)
    uint8 bBoundsChangeTriggersStreamingDataRebuild;                                  // 0x014D (size: 0x1)
    uint8 bUseAttachParentBound;                                                      // 0x014D (size: 0x1)
    TEnumAsByte<EComponentMobility::Type> Mobility;                                   // 0x014F (size: 0x1)
    TEnumAsByte<EDetailMode> DetailMode;                                              // 0x0150 (size: 0x1)
    FSceneComponentPhysicsVolumeChangedDelegate PhysicsVolumeChangedDelegate;         // 0x0151 (size: 0x1)
    void PhysicsVolumeChanged(class APhysicsVolume* NewVolume);

    void ToggleVisibility(bool bPropagateToChildren);
    bool SnapTo(class USceneComponent* InParent, FName InSocketName);
    void SetWorldScale3D(FVector NewScale);
    void SetVisibility(bool bNewVisibility, bool bPropagateToChildren);
    void SetShouldUpdatePhysicsVolume(bool bInShouldUpdatePhysicsVolume);
    void SetRelativeScale3D(FVector NewScale3D);
    void SetMobility(TEnumAsByte<EComponentMobility::Type> NewMobility);
    void SetHiddenInGame(bool NewHidden, bool bPropagateToChildren);
    void SetAbsolute(bool bNewAbsoluteLocation, bool bNewAbsoluteRotation, bool bNewAbsoluteScale);
    void ResetRelativeTransform();
    void OnRep_Visibility(bool OldValue);
    void OnRep_Transform();
    void OnRep_AttachSocketName();
    void OnRep_AttachParent();
    void OnRep_AttachChildren();
    void K2_SetWorldTransform(const FTransform& NewTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    void K2_SetWorldRotation(FRotator NewRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    void K2_SetWorldLocationAndRotation(FVector NewLocation, FRotator NewRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    void K2_SetWorldLocation(FVector NewLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    void K2_SetRelativeTransform(const FTransform& NewTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    void K2_SetRelativeRotation(FRotator NewRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    void K2_SetRelativeLocationAndRotation(FVector NewLocation, FRotator NewRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    void K2_SetRelativeLocation(FVector NewLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    FTransform K2_GetComponentToWorld();
    FVector K2_GetComponentScale();
    FRotator K2_GetComponentRotation();
    FVector K2_GetComponentLocation();
    void K2_DetachFromComponent(EDetachmentRule LocationRule, EDetachmentRule RotationRule, EDetachmentRule ScaleRule, bool bCallModify);
    bool K2_AttachToComponent(class USceneComponent* Parent, FName SocketName, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);
    bool K2_AttachTo(class USceneComponent* InParent, FName InSocketName, TEnumAsByte<EAttachLocation::Type> AttachType, bool bWeldSimulatedBodies);
    void K2_AddWorldTransformKeepScale(const FTransform& DeltaTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    void K2_AddWorldTransform(const FTransform& DeltaTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    void K2_AddWorldRotation(FRotator DeltaRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    void K2_AddWorldOffset(FVector DeltaLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    void K2_AddRelativeRotation(FRotator DeltaRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    void K2_AddRelativeLocation(FVector DeltaLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    void K2_AddLocalTransform(const FTransform& DeltaTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    void K2_AddLocalRotation(FRotator DeltaRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    void K2_AddLocalOffset(FVector DeltaLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);
    bool IsVisible();
    bool IsSimulatingPhysics(FName BoneName);
    bool IsAnySimulatingPhysics();
    FVector GetUpVector();
    FTransform GetSocketTransform(FName InSocketName, TEnumAsByte<ERelativeTransformSpace> TransformSpace);
    FRotator GetSocketRotation(FName InSocketName);
    FQuat GetSocketQuaternion(FName InSocketName);
    FVector GetSocketLocation(FName InSocketName);
    bool GetShouldUpdatePhysicsVolume();
    FVector GetRightVector();
    FTransform GetRelativeTransform();
    class APhysicsVolume* GetPhysicsVolume();
    void GetParentComponents(TArray<class USceneComponent*>& Parents);
    int32 GetNumChildrenComponents();
    FVector GetForwardVector();
    FVector GetComponentVelocity();
    void GetChildrenComponents(bool bIncludeAllDescendants, TArray<class USceneComponent*>& Children);
    class USceneComponent* GetChildComponent(int32 ChildIndex);
    FName GetAttachSocketName();
    class USceneComponent* GetAttachParent();
    TArray<FName> GetAllSocketNames();
    bool DoesSocketExist(FName InSocketName);
    void DetachFromParent(bool bMaintainWorldPosition, bool bCallModify);
}; // Size: 0x200

struct FLightingChannels
{
    uint8 bChannel0;                                                                  // 0x0000 (size: 0x1)
    uint8 bChannel1;                                                                  // 0x0000 (size: 0x1)
    uint8 bChannel2;                                                                  // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FCustomPrimitiveData
{
    TArray<float> Data;                                                               // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FCollisionResponseContainer
{
    TEnumAsByte<ECollisionResponse> WorldStatic;                                      // 0x0000 (size: 0x1)
    TEnumAsByte<ECollisionResponse> WorldDynamic;                                     // 0x0001 (size: 0x1)
    TEnumAsByte<ECollisionResponse> Pawn;                                             // 0x0002 (size: 0x1)
    TEnumAsByte<ECollisionResponse> Visibility;                                       // 0x0003 (size: 0x1)
    TEnumAsByte<ECollisionResponse> Camera;                                           // 0x0004 (size: 0x1)
    TEnumAsByte<ECollisionResponse> PhysicsBody;                                      // 0x0005 (size: 0x1)
    TEnumAsByte<ECollisionResponse> Vehicle;                                          // 0x0006 (size: 0x1)
    TEnumAsByte<ECollisionResponse> Destructible;                                     // 0x0007 (size: 0x1)
    TEnumAsByte<ECollisionResponse> EngineTraceChannel1;                              // 0x0008 (size: 0x1)
    TEnumAsByte<ECollisionResponse> EngineTraceChannel2;                              // 0x0009 (size: 0x1)
    TEnumAsByte<ECollisionResponse> EngineTraceChannel3;                              // 0x000A (size: 0x1)
    TEnumAsByte<ECollisionResponse> EngineTraceChannel4;                              // 0x000B (size: 0x1)
    TEnumAsByte<ECollisionResponse> EngineTraceChannel5;                              // 0x000C (size: 0x1)
    TEnumAsByte<ECollisionResponse> EngineTraceChannel6;                              // 0x000D (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel1;                                // 0x000E (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel2;                                // 0x000F (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel3;                                // 0x0010 (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel4;                                // 0x0011 (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel5;                                // 0x0012 (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel6;                                // 0x0013 (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel7;                                // 0x0014 (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel8;                                // 0x0015 (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel9;                                // 0x0016 (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel10;                               // 0x0017 (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel11;                               // 0x0018 (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel12;                               // 0x0019 (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel13;                               // 0x001A (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel14;                               // 0x001B (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel15;                               // 0x001C (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel16;                               // 0x001D (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel17;                               // 0x001E (size: 0x1)
    TEnumAsByte<ECollisionResponse> GameTraceChannel18;                               // 0x001F (size: 0x1)

}; // Size: 0x20

struct FResponseChannel
{
    FName Channel;                                                                    // 0x0000 (size: 0x8)
    TEnumAsByte<ECollisionResponse> Response;                                         // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FCollisionResponse
{
    FCollisionResponseContainer ResponseToChannels;                                   // 0x0000 (size: 0x20)
    TArray<FResponseChannel> ResponseArray;                                           // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FWalkableSlopeOverride
{
    TEnumAsByte<EWalkableSlopeBehavior> WalkableSlopeBehavior;                        // 0x0000 (size: 0x1)
    float WalkableSlopeAngle;                                                         // 0x0004 (size: 0x4)

}; // Size: 0x10

struct FBodyInstance : public FBodyInstanceCore
{
    TEnumAsByte<ECollisionChannel> ObjectType;                                        // 0x001E (size: 0x1)
    TEnumAsByte<ECollisionEnabled::Type> CollisionEnabled;                            // 0x0020 (size: 0x1)
    ESleepFamily SleepFamily;                                                         // 0x0059 (size: 0x1)
    TEnumAsByte<EDOFMode::Type> DOFMode;                                              // 0x005A (size: 0x1)
    uint8 bUseCCD;                                                                    // 0x005B (size: 0x1)
    uint8 bIgnoreAnalyticCollisions;                                                  // 0x005B (size: 0x1)
    uint8 bNotifyRigidBodyCollision;                                                  // 0x005B (size: 0x1)
    uint8 bLockTranslation;                                                           // 0x005B (size: 0x1)
    uint8 bLockRotation;                                                              // 0x005B (size: 0x1)
    uint8 bLockXTranslation;                                                          // 0x005B (size: 0x1)
    uint8 bLockYTranslation;                                                          // 0x005B (size: 0x1)
    uint8 bLockZTranslation;                                                          // 0x005C (size: 0x1)
    uint8 bLockXRotation;                                                             // 0x005C (size: 0x1)
    uint8 bLockYRotation;                                                             // 0x005C (size: 0x1)
    uint8 bLockZRotation;                                                             // 0x005C (size: 0x1)
    uint8 bOverrideMaxAngularVelocity;                                                // 0x005C (size: 0x1)
    uint8 bOverrideMaxDepenetrationVelocity;                                          // 0x005C (size: 0x1)
    uint8 bOverrideWalkableSlopeOnInstance;                                           // 0x005D (size: 0x1)
    uint8 bInterpolateWhenSubStepping;                                                // 0x005D (size: 0x1)
    FName CollisionProfileName;                                                       // 0x006C (size: 0x8)
    uint8 PositionSolverIterationCount;                                               // 0x0074 (size: 0x1)
    uint8 VelocitySolverIterationCount;                                               // 0x0075 (size: 0x1)
    FCollisionResponse CollisionResponses;                                            // 0x0078 (size: 0x30)
    float MaxDepenetrationVelocity;                                                   // 0x00A8 (size: 0x4)
    float MassInKgOverride;                                                           // 0x00AC (size: 0x4)
    float LinearDamping;                                                              // 0x00B8 (size: 0x4)
    float AngularDamping;                                                             // 0x00BC (size: 0x4)
    FVector CustomDOFPlaneNormal;                                                     // 0x00C0 (size: 0xC)
    FVector COMNudge;                                                                 // 0x00CC (size: 0xC)
    float MassScale;                                                                  // 0x00D8 (size: 0x4)
    FVector InertiaTensorScale;                                                       // 0x00DC (size: 0xC)
    FWalkableSlopeOverride WalkableSlopeOverride;                                     // 0x00F8 (size: 0x10)
    class UPhysicalMaterial* PhysMaterialOverride;                                    // 0x0108 (size: 0x8)
    float MaxAngularVelocity;                                                         // 0x0110 (size: 0x4)
    float CustomSleepThresholdMultiplier;                                             // 0x0114 (size: 0x4)
    float StabilizationThresholdMultiplier;                                           // 0x0118 (size: 0x4)
    float PhysicsBlendWeight;                                                         // 0x011C (size: 0x4)

}; // Size: 0x158

class UPrimitiveComponent : public USceneComponent
{
    float MinDrawDistance;                                                            // 0x0200 (size: 0x4)
    float LDMaxDrawDistance;                                                          // 0x0204 (size: 0x4)
    float CachedMaxDrawDistance;                                                      // 0x0208 (size: 0x4)
    TEnumAsByte<ESceneDepthPriorityGroup> DepthPriorityGroup;                         // 0x020C (size: 0x1)
    TEnumAsByte<ESceneDepthPriorityGroup> ViewOwnerDepthPriorityGroup;                // 0x020D (size: 0x1)
    TEnumAsByte<EIndirectLightingCacheQuality> IndirectLightingCacheQuality;          // 0x020E (size: 0x1)
    ELightmapType LightmapType;                                                       // 0x020F (size: 0x1)
    uint8 bUseMaxLODAsImposter;                                                       // 0x0210 (size: 0x1)
    uint8 bBatchImpostersAsInstances;                                                 // 0x0210 (size: 0x1)
    uint8 bNeverDistanceCull;                                                         // 0x0210 (size: 0x1)
    uint8 bAlwaysCreatePhysicsState;                                                  // 0x0210 (size: 0x1)
    uint8 bGenerateOverlapEvents;                                                     // 0x0211 (size: 0x1)
    uint8 bMultiBodyOverlap;                                                          // 0x0211 (size: 0x1)
    uint8 bTraceComplexOnMove;                                                        // 0x0211 (size: 0x1)
    uint8 bReturnMaterialOnMove;                                                      // 0x0211 (size: 0x1)
    uint8 bUseViewOwnerDepthPriorityGroup;                                            // 0x0211 (size: 0x1)
    uint8 bAllowCullDistanceVolume;                                                   // 0x0211 (size: 0x1)
    uint8 bHasMotionBlurVelocityMeshes;                                               // 0x0211 (size: 0x1)
    uint8 bVisibleInReflectionCaptures;                                               // 0x0211 (size: 0x1)
    uint8 bVisibleInRealTimeSkyCaptures;                                              // 0x0212 (size: 0x1)
    uint8 bVisibleInRayTracing;                                                       // 0x0212 (size: 0x1)
    uint8 bRenderInMainPass;                                                          // 0x0212 (size: 0x1)
    uint8 bRenderInDepthPass;                                                         // 0x0212 (size: 0x1)
    uint8 bReceivesDecals;                                                            // 0x0212 (size: 0x1)
    uint8 bOwnerNoSee;                                                                // 0x0212 (size: 0x1)
    uint8 bOnlyOwnerSee;                                                              // 0x0212 (size: 0x1)
    uint8 bTreatAsBackgroundForOcclusion;                                             // 0x0212 (size: 0x1)
    uint8 bUseAsOccluder;                                                             // 0x0213 (size: 0x1)
    uint8 bSelectable;                                                                // 0x0213 (size: 0x1)
    uint8 bForceMipStreaming;                                                         // 0x0213 (size: 0x1)
    uint8 bHasPerInstanceHitProxies;                                                  // 0x0213 (size: 0x1)
    uint8 CastShadow;                                                                 // 0x0213 (size: 0x1)
    uint8 bAffectDynamicIndirectLighting;                                             // 0x0213 (size: 0x1)
    uint8 bAffectDistanceFieldLighting;                                               // 0x0213 (size: 0x1)
    uint8 bCastDynamicShadow;                                                         // 0x0213 (size: 0x1)
    uint8 bCastStaticShadow;                                                          // 0x0214 (size: 0x1)
    uint8 bCastVolumetricTranslucentShadow;                                           // 0x0214 (size: 0x1)
    uint8 bCastContactShadow;                                                         // 0x0214 (size: 0x1)
    uint8 bSelfShadowOnly;                                                            // 0x0214 (size: 0x1)
    uint8 bCastFarShadow;                                                             // 0x0214 (size: 0x1)
    uint8 bCastInsetShadow;                                                           // 0x0214 (size: 0x1)
    uint8 bCastCinematicShadow;                                                       // 0x0214 (size: 0x1)
    uint8 bCastHiddenShadow;                                                          // 0x0214 (size: 0x1)
    uint8 bCastShadowAsTwoSided;                                                      // 0x0215 (size: 0x1)
    uint8 bLightAsIfStatic;                                                           // 0x0215 (size: 0x1)
    uint8 bLightAttachmentsAsGroup;                                                   // 0x0215 (size: 0x1)
    uint8 bExcludeFromLightAttachmentGroup;                                           // 0x0215 (size: 0x1)
    uint8 bReceiveMobileCSMShadows;                                                   // 0x0215 (size: 0x1)
    uint8 bSingleSampleShadowFromStationaryLights;                                    // 0x0215 (size: 0x1)
    uint8 bIgnoreRadialImpulse;                                                       // 0x0215 (size: 0x1)
    uint8 bIgnoreRadialForce;                                                         // 0x0215 (size: 0x1)
    uint8 bApplyImpulseOnDamage;                                                      // 0x0216 (size: 0x1)
    uint8 bReplicatePhysicsToAutonomousProxy;                                         // 0x0216 (size: 0x1)
    uint8 bFillCollisionUnderneathForNavmesh;                                         // 0x0216 (size: 0x1)
    uint8 AlwaysLoadOnClient;                                                         // 0x0216 (size: 0x1)
    uint8 AlwaysLoadOnServer;                                                         // 0x0216 (size: 0x1)
    uint8 bUseEditorCompositing;                                                      // 0x0216 (size: 0x1)
    uint8 bRenderCustomDepth;                                                         // 0x0216 (size: 0x1)
    uint8 bVisibleInSceneCaptureOnly;                                                 // 0x0216 (size: 0x1)
    uint8 bHiddenInSceneCapture;                                                      // 0x0217 (size: 0x1)
    TEnumAsByte<EHasCustomNavigableGeometry::Type> bHasCustomNavigableGeometry;       // 0x0218 (size: 0x1)
    TEnumAsByte<ECanBeCharacterBase> CanCharacterStepUpOn;                            // 0x021A (size: 0x1)
    FLightingChannels LightingChannels;                                               // 0x021B (size: 0x1)
    ERendererStencilMask CustomDepthStencilWriteMask;                                 // 0x021C (size: 0x1)
    int32 CustomDepthStencilValue;                                                    // 0x0220 (size: 0x4)
    FCustomPrimitiveData CustomPrimitiveData;                                         // 0x0228 (size: 0x10)
    FCustomPrimitiveData CustomPrimitiveDataInternal;                                 // 0x0238 (size: 0x10)
    int32 TranslucencySortPriority;                                                   // 0x0250 (size: 0x4)
    float TranslucencySortDistanceOffset;                                             // 0x0254 (size: 0x4)
    int32 VisibilityId;                                                               // 0x0258 (size: 0x4)
    TArray<class URuntimeVirtualTexture*> RuntimeVirtualTextures;                     // 0x0260 (size: 0x10)
    int8 VirtualTextureLodBias;                                                       // 0x0270 (size: 0x1)
    int8 VirtualTextureCullMips;                                                      // 0x0271 (size: 0x1)
    int8 VirtualTextureMinCoverage;                                                   // 0x0272 (size: 0x1)
    ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType;                  // 0x0273 (size: 0x1)
    float LpvBiasMultiplier;                                                          // 0x0278 (size: 0x4)
    float BoundsScale;                                                                // 0x0284 (size: 0x4)
    TArray<class AActor*> MoveIgnoreActors;                                           // 0x0298 (size: 0x10)
    TArray<class UPrimitiveComponent*> MoveIgnoreComponents;                          // 0x02A8 (size: 0x10)
    FBodyInstance BodyInstance;                                                       // 0x02C8 (size: 0x158)
    FPrimitiveComponentOnComponentHit OnComponentHit;                                 // 0x0420 (size: 0x1)
    void ComponentHitSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, FVector NormalImpulse, const FHitResult& Hit);
    FPrimitiveComponentOnComponentBeginOverlap OnComponentBeginOverlap;               // 0x0421 (size: 0x1)
    void ComponentBeginOverlapSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const FHitResult& SweepResult);
    FPrimitiveComponentOnComponentEndOverlap OnComponentEndOverlap;                   // 0x0422 (size: 0x1)
    void ComponentEndOverlapSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
    FPrimitiveComponentOnComponentWake OnComponentWake;                               // 0x0423 (size: 0x1)
    void ComponentWakeSignature(class UPrimitiveComponent* WakingComponent, FName BoneName);
    FPrimitiveComponentOnComponentSleep OnComponentSleep;                             // 0x0424 (size: 0x1)
    void ComponentSleepSignature(class UPrimitiveComponent* SleepingComponent, FName BoneName);
    FPrimitiveComponentOnBeginCursorOver OnBeginCursorOver;                           // 0x0426 (size: 0x1)
    void ComponentBeginCursorOverSignature(class UPrimitiveComponent* TouchedComponent);
    FPrimitiveComponentOnEndCursorOver OnEndCursorOver;                               // 0x0427 (size: 0x1)
    void ComponentEndCursorOverSignature(class UPrimitiveComponent* TouchedComponent);
    FPrimitiveComponentOnClicked OnClicked;                                           // 0x0428 (size: 0x1)
    void ComponentOnClickedSignature(class UPrimitiveComponent* TouchedComponent, FKey ButtonPressed);
    FPrimitiveComponentOnReleased OnReleased;                                         // 0x0429 (size: 0x1)
    void ComponentOnReleasedSignature(class UPrimitiveComponent* TouchedComponent, FKey ButtonReleased);
    FPrimitiveComponentOnInputTouchBegin OnInputTouchBegin;                           // 0x042A (size: 0x1)
    void ComponentOnInputTouchBeginSignature(TEnumAsByte<ETouchIndex::Type> FingerIndex, class UPrimitiveComponent* TouchedComponent);
    FPrimitiveComponentOnInputTouchEnd OnInputTouchEnd;                               // 0x042B (size: 0x1)
    void ComponentOnInputTouchEndSignature(TEnumAsByte<ETouchIndex::Type> FingerIndex, class UPrimitiveComponent* TouchedComponent);
    FPrimitiveComponentOnInputTouchEnter OnInputTouchEnter;                           // 0x042C (size: 0x1)
    void ComponentBeginTouchOverSignature(TEnumAsByte<ETouchIndex::Type> FingerIndex, class UPrimitiveComponent* TouchedComponent);
    FPrimitiveComponentOnInputTouchLeave OnInputTouchLeave;                           // 0x042D (size: 0x1)
    void ComponentEndTouchOverSignature(TEnumAsByte<ETouchIndex::Type> FingerIndex, class UPrimitiveComponent* TouchedComponent);
    class UPrimitiveComponent* LODParentPrimitive;                                    // 0x0448 (size: 0x8)

    bool WasRecentlyRendered(float Tolerance);
    void WakeRigidBody(FName BoneName);
    void WakeAllRigidBodies();
    void SetWalkableSlopeOverride(const FWalkableSlopeOverride& NewOverride);
    void SetVisibleInSceneCaptureOnly(bool bValue);
    void SetUseCCD(bool InUseCCD, FName BoneName);
    void SetTranslucentSortPriority(int32 NewTranslucentSortPriority);
    void SetTranslucencySortDistanceOffset(float NewTranslucencySortDistanceOffset);
    void SetSingleSampleShadowFromStationaryLights(bool bNewSingleSampleShadowFromStationaryLights);
    void SetSimulatePhysics(bool bSimulate);
    void SetRenderInMainPass(bool bValue);
    void SetRenderCustomDepth(bool bValue);
    void SetReceivesDecals(bool bNewReceivesDecals);
    void SetPhysMaterialOverride(class UPhysicalMaterial* NewPhysMaterial);
    void SetPhysicsMaxAngularVelocityInRadians(float NewMaxAngVel, bool bAddToCurrent, FName BoneName);
    void SetPhysicsMaxAngularVelocityInDegrees(float NewMaxAngVel, bool bAddToCurrent, FName BoneName);
    void SetPhysicsMaxAngularVelocity(float NewMaxAngVel, bool bAddToCurrent, FName BoneName);
    void SetPhysicsLinearVelocity(FVector NewVel, bool bAddToCurrent, FName BoneName);
    void SetPhysicsAngularVelocityInRadians(FVector NewAngVel, bool bAddToCurrent, FName BoneName);
    void SetPhysicsAngularVelocityInDegrees(FVector NewAngVel, bool bAddToCurrent, FName BoneName);
    void SetPhysicsAngularVelocity(FVector NewAngVel, bool bAddToCurrent, FName BoneName);
    void SetOwnerNoSee(bool bNewOwnerNoSee);
    void SetOnlyOwnerSee(bool bNewOnlyOwnerSee);
    void SetNotifyRigidBodyCollision(bool bNewNotifyRigidBodyCollision);
    void SetMaterialByName(FName MaterialSlotName, class UMaterialInterface* Material);
    void SetMaterial(int32 ElementIndex, class UMaterialInterface* Material);
    void SetMassScale(FName BoneName, float InMassScale);
    void SetMassOverrideInKg(FName BoneName, float MassInKg, bool bOverrideMass);
    void SetLinearDamping(float InDamping);
    void SetLightingChannels(bool bChannel0, bool bChannel1, bool bChannel2);
    void SetLightAttachmentsAsGroup(bool bInLightAttachmentsAsGroup);
    void SetHiddenInSceneCapture(bool bValue);
    void SetGenerateOverlapEvents(bool bInGenerateOverlapEvents);
    void SetExcludeFromLightAttachmentGroup(bool bInExcludeFromLightAttachmentGroup);
    void SetEnableGravity(bool bGravityEnabled);
    void SetDefaultCustomPrimitiveDataVector4(int32 DataIndex, FVector4 Value);
    void SetDefaultCustomPrimitiveDataVector3(int32 DataIndex, FVector Value);
    void SetDefaultCustomPrimitiveDataVector2(int32 DataIndex, FVector2D Value);
    void SetDefaultCustomPrimitiveDataFloat(int32 DataIndex, float Value);
    void SetCustomPrimitiveDataVector4(int32 DataIndex, FVector4 Value);
    void SetCustomPrimitiveDataVector3(int32 DataIndex, FVector Value);
    void SetCustomPrimitiveDataVector2(int32 DataIndex, FVector2D Value);
    void SetCustomPrimitiveDataFloat(int32 DataIndex, float Value);
    void SetCustomDepthStencilWriteMask(ERendererStencilMask WriteMaskBit);
    void SetCustomDepthStencilValue(int32 Value);
    void SetCullDistance(float NewCullDistance);
    void SetConstraintMode(TEnumAsByte<EDOFMode::Type> ConstraintMode);
    void SetCollisionResponseToChannel(TEnumAsByte<ECollisionChannel> Channel, TEnumAsByte<ECollisionResponse> NewResponse);
    void SetCollisionResponseToAllChannels(TEnumAsByte<ECollisionResponse> NewResponse);
    void SetCollisionProfileName(FName InCollisionProfileName, bool bUpdateOverlaps);
    void SetCollisionObjectType(TEnumAsByte<ECollisionChannel> Channel);
    void SetCollisionEnabled(TEnumAsByte<ECollisionEnabled::Type> NewType);
    void SetCenterOfMass(FVector CenterOfMassOffset, FName BoneName);
    void SetCastShadow(bool NewCastShadow);
    void SetCastInsetShadow(bool bInCastInsetShadow);
    void SetCastHiddenShadow(bool NewCastHiddenShadow);
    void SetBoundsScale(float NewBoundsScale);
    void SetAngularDamping(float InDamping);
    void SetAllUseCCD(bool InUseCCD);
    void SetAllPhysicsLinearVelocity(FVector NewVel, bool bAddToCurrent);
    void SetAllPhysicsAngularVelocityInRadians(const FVector& NewAngVel, bool bAddToCurrent);
    void SetAllPhysicsAngularVelocityInDegrees(const FVector& NewAngVel, bool bAddToCurrent);
    void SetAllMassScale(float InMassScale);
    FVector ScaleByMomentOfInertia(FVector InputVector, FName BoneName);
    void PutRigidBodyToSleep(FName BoneName);
    bool K2_SphereTraceComponent(FVector TraceStart, FVector TraceEnd, float SphereRadius, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, FVector& HitLocation, FVector& HitNormal, FName& BoneName, FHitResult& OutHit);
    bool K2_SphereOverlapComponent(FVector InSphereCentre, float InSphereRadius, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, FVector& HitLocation, FVector& HitNormal, FName& BoneName, FHitResult& OutHit);
    bool K2_LineTraceComponent(FVector TraceStart, FVector TraceEnd, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, FVector& HitLocation, FVector& HitNormal, FName& BoneName, FHitResult& OutHit);
    bool K2_IsQueryCollisionEnabled();
    bool K2_IsPhysicsCollisionEnabled();
    bool K2_IsCollisionEnabled();
    bool K2_BoxOverlapComponent(FVector InBoxCentre, const FBox InBox, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, FVector& HitLocation, FVector& HitNormal, FName& BoneName, FHitResult& OutHit);
    bool IsOverlappingComponent(const class UPrimitiveComponent* OtherComp);
    bool IsOverlappingActor(const class AActor* Other);
    bool IsGravityEnabled();
    bool IsAnyRigidBodyAwake();
    void IgnoreComponentWhenMoving(class UPrimitiveComponent* Component, bool bShouldIgnore);
    void IgnoreActorWhenMoving(class AActor* Actor, bool bShouldIgnore);
    FWalkableSlopeOverride GetWalkableSlopeOverride();
    FVector GetPhysicsLinearVelocityAtPoint(FVector Point, FName BoneName);
    FVector GetPhysicsLinearVelocity(FName BoneName);
    FVector GetPhysicsAngularVelocityInRadians(FName BoneName);
    FVector GetPhysicsAngularVelocityInDegrees(FName BoneName);
    FVector GetPhysicsAngularVelocity(FName BoneName);
    void GetOverlappingComponents(TArray<class UPrimitiveComponent*>& OutOverlappingComponents);
    void GetOverlappingActors(TArray<class AActor*>& OverlappingActors, TSubclassOf<class AActor> ClassFilter);
    int32 GetNumMaterials();
    class UMaterialInterface* GetMaterialFromCollisionFaceIndex(int32 FaceIndex, int32& SectionIndex);
    class UMaterialInterface* GetMaterial(int32 ElementIndex);
    float GetMassScale(FName BoneName);
    float GetMass();
    float GetLinearDamping();
    FVector GetInertiaTensor(FName BoneName);
    bool GetGenerateOverlapEvents();
    TEnumAsByte<ECollisionResponse> GetCollisionResponseToChannel(TEnumAsByte<ECollisionChannel> Channel);
    FName GetCollisionProfileName();
    TEnumAsByte<ECollisionChannel> GetCollisionObjectType();
    TEnumAsByte<ECollisionEnabled::Type> GetCollisionEnabled();
    float GetClosestPointOnCollision(const FVector& Point, FVector& OutPointOnBody, FName BoneName);
    FVector GetCenterOfMass(FName BoneName);
    float GetAngularDamping();
    class UMaterialInstanceDynamic* CreateDynamicMaterialInstance(int32 ElementIndex, class UMaterialInterface* SourceMaterial, FName OptionalName);
    class UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamicFromMaterial(int32 ElementIndex, class UMaterialInterface* Parent);
    class UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamic(int32 ElementIndex);
    TArray<class UPrimitiveComponent*> CopyArrayOfMoveIgnoreComponents();
    TArray<class AActor*> CopyArrayOfMoveIgnoreActors();
    void ClearMoveIgnoreComponents();
    void ClearMoveIgnoreActors();
    bool CanCharacterStepUp(class APawn* Pawn);
    void AddTorqueInRadians(FVector Torque, FName BoneName, bool bAccelChange);
    void AddTorqueInDegrees(FVector Torque, FName BoneName, bool bAccelChange);
    void AddTorque(FVector Torque, FName BoneName, bool bAccelChange);
    void AddRadialImpulse(FVector Origin, float Radius, float Strength, TEnumAsByte<ERadialImpulseFalloff> Falloff, bool bVelChange);
    void AddRadialForce(FVector Origin, float Radius, float Strength, TEnumAsByte<ERadialImpulseFalloff> Falloff, bool bAccelChange);
    void AddImpulseAtLocation(FVector Impulse, FVector Location, FName BoneName);
    void AddImpulse(FVector Impulse, FName BoneName, bool bVelChange);
    void AddForceAtLocationLocal(FVector Force, FVector Location, FName BoneName);
    void AddForceAtLocation(FVector Force, FVector Location, FName BoneName);
    void AddForce(FVector Force, FName BoneName, bool bAccelChange);
    void AddAngularImpulseInRadians(FVector Impulse, FName BoneName, bool bVelChange);
    void AddAngularImpulseInDegrees(FVector Impulse, FName BoneName, bool bVelChange);
    void AddAngularImpulse(FVector Impulse, FName BoneName, bool bVelChange);
}; // Size: 0x450

struct FDirectoryPath
{
    FString Path;                                                                     // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FMeshBuildSettings
{
    uint8 bUseMikkTSpace;                                                             // 0x0000 (size: 0x1)
    uint8 bRecomputeNormals;                                                          // 0x0000 (size: 0x1)
    uint8 bRecomputeTangents;                                                         // 0x0000 (size: 0x1)
    uint8 bComputeWeightedNormals;                                                    // 0x0000 (size: 0x1)
    uint8 bRemoveDegenerates;                                                         // 0x0000 (size: 0x1)
    uint8 bBuildAdjacencyBuffer;                                                      // 0x0000 (size: 0x1)
    uint8 bBuildReversedIndexBuffer;                                                  // 0x0000 (size: 0x1)
    uint8 bUseHighPrecisionTangentBasis;                                              // 0x0000 (size: 0x1)
    uint8 bUseFullPrecisionUVs;                                                       // 0x0001 (size: 0x1)
    uint8 bGenerateLightmapUVs;                                                       // 0x0001 (size: 0x1)
    uint8 bGenerateDistanceFieldAsIfTwoSided;                                         // 0x0001 (size: 0x1)
    uint8 bSupportFaceRemap;                                                          // 0x0001 (size: 0x1)
    int32 MinLightmapResolution;                                                      // 0x0004 (size: 0x4)
    int32 SrcLightmapIndex;                                                           // 0x0008 (size: 0x4)
    int32 DstLightmapIndex;                                                           // 0x000C (size: 0x4)
    float BuildScale;                                                                 // 0x0010 (size: 0x4)
    FVector BuildScale3D;                                                             // 0x0014 (size: 0xC)
    float DistanceFieldResolutionScale;                                               // 0x0020 (size: 0x4)
    class UStaticMesh* DistanceFieldReplacementMesh;                                  // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FTimerHandle
{
    uint64 Handle;                                                                    // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FMeshUVChannelInfo
{
    bool bInitialized;                                                                // 0x0000 (size: 0x1)
    bool bOverrideDensities;                                                          // 0x0001 (size: 0x1)
    float LocalUVDensities;                                                           // 0x0004 (size: 0x10)

}; // Size: 0x14

struct FStaticMaterial
{
    class UMaterialInterface* MaterialInterface;                                      // 0x0000 (size: 0x8)
    FName MaterialSlotName;                                                           // 0x0008 (size: 0x8)
    FName ImportedMaterialSlotName;                                                   // 0x0010 (size: 0x8)
    FMeshUVChannelInfo UVChannelData;                                                 // 0x0018 (size: 0x14)

}; // Size: 0x30

class UMeshComponent : public UPrimitiveComponent
{
    TArray<class UMaterialInterface*> OverrideMaterials;                              // 0x0450 (size: 0x10)
    uint8 bEnableMaterialParameterCaching;                                            // 0x0470 (size: 0x1)

    void SetVectorParameterValueOnMaterials(const FName ParameterName, const FVector ParameterValue);
    void SetScalarParameterValueOnMaterials(const FName ParameterName, const float ParameterValue);
    void PrestreamTextures(float Seconds, bool bPrioritizeCharacterTextures, int32 CinematicTextureGroups);
    bool IsMaterialSlotNameValid(FName MaterialSlotName);
    TArray<FName> GetMaterialSlotNames();
    TArray<class UMaterialInterface*> GetMaterials();
    int32 GetMaterialIndex(FName MaterialSlotName);
}; // Size: 0x480

struct FVertexOffsetUsage
{
    int32 Usage;                                                                      // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FSkelMeshComponentLODInfo
{
    TArray<bool> HiddenMaterials;                                                     // 0x0000 (size: 0x10)

}; // Size: 0x48

struct FSkelMeshSkinWeightInfo
{
    int32 Bones;                                                                      // 0x0000 (size: 0x30)
    uint8 Weights;                                                                    // 0x0030 (size: 0xC)

}; // Size: 0x3C

class USkinnedMeshComponent : public UMeshComponent
{
    class USkeletalMesh* SkeletalMesh;                                                // 0x0480 (size: 0x8)
    TWeakObjectPtr<class USkinnedMeshComponent> MasterPoseComponent;                  // 0x0488 (size: 0x8)
    TArray<ESkinCacheUsage> SkinCacheUsage;                                           // 0x0490 (size: 0x10)
    TArray<FVertexOffsetUsage> VertexOffsetUsage;                                     // 0x04A0 (size: 0x10)
    class UPhysicsAsset* PhysicsAssetOverride;                                        // 0x05A8 (size: 0x8)
    int32 ForcedLodModel;                                                             // 0x05B0 (size: 0x4)
    int32 MinLodModel;                                                                // 0x05B4 (size: 0x4)
    float StreamingDistanceMultiplier;                                                // 0x05C0 (size: 0x4)
    TArray<FSkelMeshComponentLODInfo> LODInfo;                                        // 0x05D0 (size: 0x10)
    EVisibilityBasedAnimTickOption VisibilityBasedAnimTickOption;                     // 0x0604 (size: 0x1)
    uint8 bOverrideMinLod;                                                            // 0x0606 (size: 0x1)
    uint8 bUseBoundsFromMasterPoseComponent;                                          // 0x0606 (size: 0x1)
    uint8 bForceWireframe;                                                            // 0x0606 (size: 0x1)
    uint8 bDisplayBones;                                                              // 0x0606 (size: 0x1)
    uint8 bDisableMorphTarget;                                                        // 0x0606 (size: 0x1)
    uint8 bHideSkin;                                                                  // 0x0607 (size: 0x1)
    uint8 bPerBoneMotionBlur;                                                         // 0x0607 (size: 0x1)
    uint8 bComponentUseFixedSkelBounds;                                               // 0x0607 (size: 0x1)
    uint8 bConsiderAllBodiesForBounds;                                                // 0x0607 (size: 0x1)
    uint8 bSyncAttachParentLOD;                                                       // 0x0607 (size: 0x1)
    uint8 bCanHighlightSelectedSections;                                              // 0x0607 (size: 0x1)
    uint8 bRecentlyRendered;                                                          // 0x0607 (size: 0x1)
    uint8 bCastCapsuleDirectShadow;                                                   // 0x0607 (size: 0x1)
    uint8 bCastCapsuleIndirectShadow;                                                 // 0x0608 (size: 0x1)
    uint8 bCPUSkinning;                                                               // 0x0608 (size: 0x1)
    uint8 bEnableUpdateRateOptimizations;                                             // 0x0608 (size: 0x1)
    uint8 bDisplayDebugUpdateRateOptimizations;                                       // 0x0608 (size: 0x1)
    uint8 bRenderStatic;                                                              // 0x0608 (size: 0x1)
    uint8 bIgnoreMasterPoseComponentLOD;                                              // 0x0608 (size: 0x1)
    uint8 bCachedLocalBoundsUpToDate;                                                 // 0x0609 (size: 0x1)
    uint8 bForceMeshObjectUpdate;                                                     // 0x0609 (size: 0x1)
    float CapsuleIndirectShadowMinVisibility;                                         // 0x060C (size: 0x4)
    FBoxSphereBounds CachedWorldSpaceBounds;                                          // 0x0620 (size: 0x1C)
    FMatrix CachedWorldToLocalTransform;                                              // 0x0640 (size: 0x40)

    void UnloadSkinWeightProfile(FName InProfileName);
    void UnHideBoneByName(FName BoneName);
    void TransformToBoneSpace(FName BoneName, FVector InPosition, FRotator InRotation, FVector& OutPosition, FRotator& OutRotation);
    void TransformFromBoneSpace(FName BoneName, FVector InPosition, FRotator InRotation, FVector& OutPosition, FRotator& OutRotation);
    void ShowMaterialSection(int32 MaterialID, int32 SectionIndex, bool bShow, int32 LODIndex);
    void ShowAllMaterialSections(int32 LODIndex);
    void SetVertexOffsetUsage(int32 LODIndex, int32 Usage);
    void SetVertexColorOverride_LinearColor(int32 LODIndex, const TArray<FLinearColor>& VertexColors);
    bool SetSkinWeightProfile(FName InProfileName);
    void SetSkinWeightOverride(int32 LODIndex, const TArray<FSkelMeshSkinWeightInfo>& SkinWeights);
    void SetSkeletalMesh(class USkeletalMesh* NewMesh, bool bReinitPose);
    void SetRenderStatic(bool bNewValue);
    void SetPreSkinningOffsets(int32 LODIndex, TArray<FVector> Offsets);
    void SetPostSkinningOffsets(int32 LODIndex, TArray<FVector> Offsets);
    void SetPhysicsAsset(class UPhysicsAsset* NewPhysicsAsset, bool bForceReInit);
    void SetMinLOD(int32 InNewMinLOD);
    void SetMasterPoseComponent(class USkinnedMeshComponent* NewMasterBoneComponent, bool bForceUpdate);
    void SetForcedLOD(int32 InNewForcedLOD);
    void SetCastCapsuleIndirectShadow(bool bNewValue);
    void SetCastCapsuleDirectShadow(bool bNewValue);
    void SetCapsuleIndirectShadowMinVisibility(float newValue);
    bool IsUsingSkinWeightProfile();
    bool IsMaterialSectionShown(int32 MaterialID, int32 LODIndex);
    bool IsBoneHiddenByName(FName BoneName);
    void HideBoneByName(FName BoneName, TEnumAsByte<EPhysBodyOp> PhysBodyOption);
    int32 GetVertexOffsetUsage(int32 LODIndex);
    bool GetTwistAndSwingAngleOfDeltaRotationFromRefPose(FName BoneName, float& OutTwistAngle, float& OutSwingAngle);
    FName GetSocketBoneName(FName InSocketName);
    FVector GetRefPosePosition(int32 BoneIndex);
    FName GetParentBone(FName BoneName);
    int32 GetNumLODs();
    int32 GetNumBones();
    int32 GetForcedLOD();
    FTransform GetDeltaTransformFromRefPose(FName BoneName, FName BaseName);
    FName GetCurrentSkinWeightProfileName();
    FName GetBoneName(int32 BoneIndex);
    int32 GetBoneIndex(FName BoneName);
    FName FindClosestBone_K2(FVector TestLocation, FVector& BoneLocation, float IgnoreScale, bool bRequirePhysicsAsset);
    void ClearVertexColorOverride(int32 LODIndex);
    void ClearSkinWeightProfile();
    void ClearSkinWeightOverride(int32 LODIndex);
    bool BoneIsChildOf(FName BoneName, FName ParentBoneName);
}; // Size: 0x6A0

struct FFractureEffect
{
    class UParticleSystem* ParticleSystem;                                            // 0x0000 (size: 0x8)
    class USoundBase* Sound;                                                          // 0x0008 (size: 0x8)

}; // Size: 0x10

class UStreamableRenderAsset : public UObject
{
    double ForceMipLevelsToBeResidentTimestamp;                                       // 0x0040 (size: 0x8)
    int32 NumCinematicMipLevels;                                                      // 0x0048 (size: 0x4)
    int32 StreamingIndex;                                                             // 0x004C (size: 0x4)
    int32 CachedCombinedLODBias;                                                      // 0x0050 (size: 0x4)
    uint8 NeverStream;                                                                // 0x0054 (size: 0x1)
    uint8 bGlobalForceMipLevelsToBeResident;                                          // 0x0054 (size: 0x1)
    uint8 bHasStreamingUpdatePending;                                                 // 0x0054 (size: 0x1)
    uint8 bForceMiplevelsToBeResident;                                                // 0x0054 (size: 0x1)
    uint8 bIgnoreStreamingMipBias;                                                    // 0x0054 (size: 0x1)
    uint8 bUseCinematicMipLevels;                                                     // 0x0054 (size: 0x1)

}; // Size: 0x60

struct FSkeletalMaterial
{
    class UMaterialInterface* MaterialInterface;                                      // 0x0000 (size: 0x8)
    FName MaterialSlotName;                                                           // 0x0008 (size: 0x8)
    FMeshUVChannelInfo UVChannelData;                                                 // 0x0010 (size: 0x14)

}; // Size: 0x28

struct FBoneMirrorInfo
{
    int32 SourceIndex;                                                                // 0x0000 (size: 0x4)
    TEnumAsByte<EAxis::Type> BoneFlipAxis;                                            // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FPerPlatformFloat
{
    float Default;                                                                    // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FSkeletalMeshBuildSettings
{
    uint8 bRecomputeNormals;                                                          // 0x0000 (size: 0x1)
    uint8 bRecomputeTangents;                                                         // 0x0000 (size: 0x1)
    uint8 bUseMikkTSpace;                                                             // 0x0000 (size: 0x1)
    uint8 bComputeWeightedNormals;                                                    // 0x0000 (size: 0x1)
    uint8 bRemoveDegenerates;                                                         // 0x0000 (size: 0x1)
    uint8 bUseHighPrecisionTangentBasis;                                              // 0x0000 (size: 0x1)
    uint8 bUseFullPrecisionUVs;                                                       // 0x0000 (size: 0x1)
    uint8 bBuildAdjacencyBuffer;                                                      // 0x0000 (size: 0x1)
    float ThresholdPosition;                                                          // 0x0004 (size: 0x4)
    float ThresholdTangentNormal;                                                     // 0x0008 (size: 0x4)
    float ThresholdUV;                                                                // 0x000C (size: 0x4)
    float MorphThresholdPosition;                                                     // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FSkeletalMeshOptimizationSettings
{
    TEnumAsByte<SkeletalMeshTerminationCriterion> TerminationCriterion;               // 0x0000 (size: 0x1)
    float NumOfTrianglesPercentage;                                                   // 0x0004 (size: 0x4)
    float NumOfVertPercentage;                                                        // 0x0008 (size: 0x4)
    uint32 MaxNumOfTriangles;                                                         // 0x000C (size: 0x4)
    uint32 MaxNumOfVerts;                                                             // 0x0010 (size: 0x4)
    float MaxDeviationPercentage;                                                     // 0x0014 (size: 0x4)
    TEnumAsByte<SkeletalMeshOptimizationType> ReductionMethod;                        // 0x0018 (size: 0x1)
    TEnumAsByte<SkeletalMeshOptimizationImportance> SilhouetteImportance;             // 0x0019 (size: 0x1)
    TEnumAsByte<SkeletalMeshOptimizationImportance> TextureImportance;                // 0x001A (size: 0x1)
    TEnumAsByte<SkeletalMeshOptimizationImportance> ShadingImportance;                // 0x001B (size: 0x1)
    TEnumAsByte<SkeletalMeshOptimizationImportance> SkinningImportance;               // 0x001C (size: 0x1)
    uint8 bRemapMorphTargets;                                                         // 0x001D (size: 0x1)
    uint8 bRecalcNormals;                                                             // 0x001D (size: 0x1)
    float WeldingThreshold;                                                           // 0x0020 (size: 0x4)
    float NormalsThreshold;                                                           // 0x0024 (size: 0x4)
    int32 MaxBonesPerVertex;                                                          // 0x0028 (size: 0x4)
    uint8 bEnforceBoneBoundaries;                                                     // 0x002C (size: 0x1)
    float VolumeImportance;                                                           // 0x0030 (size: 0x4)
    uint8 bLockEdges;                                                                 // 0x0034 (size: 0x1)
    uint8 bLockColorBounaries;                                                        // 0x0034 (size: 0x1)
    int32 BaseLOD;                                                                    // 0x0038 (size: 0x4)

}; // Size: 0x3C

struct FBoneReference
{
    FName BoneName;                                                                   // 0x0000 (size: 0x8)

}; // Size: 0x10

struct FSkeletalMeshLODInfo
{
    FPerPlatformFloat ScreenSize;                                                     // 0x0000 (size: 0x4)
    float LODHysteresis;                                                              // 0x0004 (size: 0x4)
    TArray<int32> LODMaterialMap;                                                     // 0x0008 (size: 0x10)
    FSkeletalMeshBuildSettings BuildSettings;                                         // 0x0018 (size: 0x14)
    FSkeletalMeshOptimizationSettings ReductionSettings;                              // 0x002C (size: 0x3C)
    TArray<FBoneReference> BonesToRemove;                                             // 0x0068 (size: 0x10)
    TArray<FBoneReference> BonesToPrioritize;                                         // 0x0078 (size: 0x10)
    float WeightOfPrioritization;                                                     // 0x0088 (size: 0x4)
    class UAnimSequence* BakePose;                                                    // 0x0090 (size: 0x8)
    class UAnimSequence* BakePoseOverride;                                            // 0x0098 (size: 0x8)
    FString SourceImportFilename;                                                     // 0x00A0 (size: 0x10)
    ESkinCacheUsage SkinCacheUsage;                                                   // 0x00B0 (size: 0x1)
    uint8 bHasBeenSimplified;                                                         // 0x00B1 (size: 0x1)
    uint8 bHasPerLODVertexColors;                                                     // 0x00B1 (size: 0x1)
    uint8 bAllowCPUAccess;                                                            // 0x00B1 (size: 0x1)
    uint8 bSupportUniformlyDistributedSampling;                                       // 0x00B1 (size: 0x1)

}; // Size: 0xB8

struct FPerPlatformInt
{
    int32 Default;                                                                    // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FPerPlatformBool
{
    bool Default;                                                                     // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FSkeletalMeshSamplingRegionMaterialFilter
{
    FName MaterialName;                                                               // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FSkeletalMeshSamplingRegionBoneFilter
{
    FName BoneName;                                                                   // 0x0000 (size: 0x8)
    uint8 bIncludeOrExclude;                                                          // 0x0008 (size: 0x1)
    uint8 bApplyToChildren;                                                           // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FSkeletalMeshSamplingRegion
{
    FName Name;                                                                       // 0x0000 (size: 0x8)
    int32 LODIndex;                                                                   // 0x0008 (size: 0x4)
    uint8 bSupportUniformlyDistributedSampling;                                       // 0x000C (size: 0x1)
    TArray<FSkeletalMeshSamplingRegionMaterialFilter> MaterialFilters;                // 0x0010 (size: 0x10)
    TArray<FSkeletalMeshSamplingRegionBoneFilter> BoneFilters;                        // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FSkeletalMeshSamplingLODBuiltData
{
}; // Size: 0x48

struct FSkeletalMeshSamplingRegionBuiltData
{
}; // Size: 0x78

struct FSkeletalMeshSamplingBuiltData
{
    TArray<FSkeletalMeshSamplingLODBuiltData> WholeMeshBuiltData;                     // 0x0000 (size: 0x10)
    TArray<FSkeletalMeshSamplingRegionBuiltData> RegionBuiltData;                     // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FSkeletalMeshSamplingInfo
{
    TArray<FSkeletalMeshSamplingRegion> Regions;                                      // 0x0000 (size: 0x10)
    FSkeletalMeshSamplingBuiltData BuiltData;                                         // 0x0010 (size: 0x20)

}; // Size: 0x30

struct FSkinWeightProfileInfo
{
    FName Name;                                                                       // 0x0000 (size: 0x8)
    FPerPlatformBool DefaultProfile;                                                  // 0x0008 (size: 0x1)
    FPerPlatformInt DefaultProfileFromLODIndex;                                       // 0x000C (size: 0x4)

}; // Size: 0x10

class USkeletalMesh : public UStreamableRenderAsset
{
    class USkeleton* Skeleton;                                                        // 0x0080 (size: 0x8)
    FBoxSphereBounds ImportedBounds;                                                  // 0x0088 (size: 0x1C)
    FBoxSphereBounds ExtendedBounds;                                                  // 0x00A4 (size: 0x1C)
    FVector PositiveBoundsExtension;                                                  // 0x00C0 (size: 0xC)
    FVector NegativeBoundsExtension;                                                  // 0x00CC (size: 0xC)
    TArray<FSkeletalMaterial> Materials;                                              // 0x00D8 (size: 0x10)
    TArray<FBoneMirrorInfo> SkelMirrorTable;                                          // 0x00E8 (size: 0x10)
    TArray<FSkeletalMeshLODInfo> LODInfo;                                             // 0x00F8 (size: 0x10)
    FPerPlatformInt MinLOD;                                                           // 0x0158 (size: 0x4)
    FPerPlatformBool DisableBelowMinLodStripping;                                     // 0x015C (size: 0x1)
    TEnumAsByte<EAxis::Type> SkelMirrorAxis;                                          // 0x015D (size: 0x1)
    TEnumAsByte<EAxis::Type> SkelMirrorFlipAxis;                                      // 0x015E (size: 0x1)
    uint8 bUseFullPrecisionUVs;                                                       // 0x015F (size: 0x1)
    uint8 bUseHighPrecisionTangentBasis;                                              // 0x015F (size: 0x1)
    uint8 bHasBeenSimplified;                                                         // 0x015F (size: 0x1)
    uint8 bHasVertexColors;                                                           // 0x015F (size: 0x1)
    uint8 bEnablePerPolyCollision;                                                    // 0x015F (size: 0x1)
    class UBodySetup* BodySetup;                                                      // 0x0160 (size: 0x8)
    class UPhysicsAsset* PhysicsAsset;                                                // 0x0168 (size: 0x8)
    class UPhysicsAsset* ShadowPhysicsAsset;                                          // 0x0170 (size: 0x8)
    TArray<class UNodeMappingContainer*> NodeMappingData;                             // 0x0178 (size: 0x10)
    uint8 bSupportRayTracing;                                                         // 0x0188 (size: 0x1)
    TArray<class UMorphTarget*> MorphTargets;                                         // 0x0190 (size: 0x10)
    TSubclassOf<class UAnimInstance> PostProcessAnimBlueprint;                        // 0x0318 (size: 0x8)
    TArray<class UClothingAssetBase*> MeshClothingAssets;                             // 0x0320 (size: 0x10)
    FSkeletalMeshSamplingInfo SamplingInfo;                                           // 0x0330 (size: 0x30)
    TArray<class UAssetUserData*> AssetUserData;                                      // 0x0360 (size: 0x10)
    TArray<class USkeletalMeshSocket*> Sockets;                                       // 0x0370 (size: 0x10)
    TArray<FSkinWeightProfileInfo> SkinWeightProfiles;                                // 0x0390 (size: 0x10)

    void SetMorphTargets(const TArray<class UMorphTarget*>& InMorphTargets);
    void SetMeshClothingAssets(const TArray<class UClothingAssetBase*>& InMeshClothingAssets);
    void SetMaterials(const TArray<FSkeletalMaterial>& InMaterials);
    void SetLODSettings(class USkeletalMeshLODSettings* InLODSettings);
    void SetDefaultAnimatingRig(TSoftObjectPtr<UObject> InAnimatingRig);
    int32 NumSockets();
    TArray<FString> K2_GetAllMorphTargetNames();
    bool IsSectionUsingCloth(int32 InSectionIndex, bool bCheckCorrespondingSections);
    class USkeletalMeshSocket* GetSocketByIndex(int32 Index);
    class USkeleton* GetSkeleton();
    class UPhysicsAsset* GetShadowPhysicsAsset();
    class UPhysicsAsset* GetPhysicsAsset();
    TArray<class UNodeMappingContainer*> GetNodeMappingData();
    class UNodeMappingContainer* GetNodeMappingContainer(class UBlueprint* SourceAsset);
    TArray<class UMorphTarget*> GetMorphTargets();
    TArray<class UClothingAssetBase*> GetMeshClothingAssets();
    TArray<FSkeletalMaterial> GetMaterials();
    class USkeletalMeshLODSettings* GetLODSettings();
    FBoxSphereBounds GetImportedBounds();
    TSoftObjectPtr<UObject> GetDefaultAnimatingRig();
    FBoxSphereBounds GetBounds();
    class USkeletalMeshSocket* FindSocketInfo(FName InSocketName, FTransform& OutTransform, int32& OutBoneIndex, int32& OutIndex);
    class USkeletalMeshSocket* FindSocketAndIndex(FName InSocketName, int32& OutIndex);
    class USkeletalMeshSocket* FindSocket(FName InSocketName);
}; // Size: 0x3A0

class UBlueprintFunctionLibrary : public UObject
{
}; // Size: 0x28

class AController : public AActor
{
    class APlayerState* PlayerState;                                                  // 0x0230 (size: 0x8)
    FControllerOnInstigatedAnyDamage OnInstigatedAnyDamage;                           // 0x0240 (size: 0x10)
    void InstigatedAnyDamageSignature(float Damage, const class UDamageType* DamageType, class AActor* DamagedActor, class AActor* DamageCauser);
    FName StateName;                                                                  // 0x0250 (size: 0x8)
    class APawn* Pawn;                                                                // 0x0258 (size: 0x8)
    class ACharacter* Character;                                                      // 0x0268 (size: 0x8)
    class USceneComponent* TransformComponent;                                        // 0x0270 (size: 0x8)
    FRotator ControlRotation;                                                         // 0x0290 (size: 0xC)
    uint8 bAttachToPawn;                                                              // 0x029C (size: 0x1)

    void UnPossess();
    void StopMovement();
    void SetInitialLocationAndRotation(const FVector& NewLocation, const FRotator& NewRotation);
    void SetIgnoreMoveInput(bool bNewMoveInput);
    void SetIgnoreLookInput(bool bNewLookInput);
    void SetControlRotation(const FRotator& NewRotation);
    void ResetIgnoreMoveInput();
    void ResetIgnoreLookInput();
    void ResetIgnoreInputFlags();
    void ReceiveUnPossess(class APawn* UnpossessedPawn);
    void ReceivePossess(class APawn* PossessedPawn);
    void ReceiveInstigatedAnyDamage(float Damage, const class UDamageType* DamageType, class AActor* DamagedActor, class AActor* DamageCauser);
    void Possess(class APawn* InPawn);
    void OnRep_PlayerState();
    void OnRep_Pawn();
    bool LineOfSightTo(const class AActor* Other, FVector ViewPoint, bool bAlternateChecks);
    class APawn* K2_GetPawn();
    bool IsPlayerController();
    bool IsMoveInputIgnored();
    bool IsLookInputIgnored();
    bool IsLocalPlayerController();
    bool IsLocalController();
    class AActor* GetViewTarget();
    FRotator GetDesiredRotation();
    FRotator GetControlRotation();
    void ClientSetRotation(FRotator NewRotation, bool bResetCamera);
    void ClientSetLocation(FVector NewLocation, FRotator NewRotation);
    class APlayerController* CastToPlayerController();
}; // Size: 0x2A0

struct FActiveForceFeedbackEffect
{
    class UForceFeedbackEffect* ForceFeedbackEffect;                                  // 0x0000 (size: 0x8)

}; // Size: 0x18

struct FViewTargetTransitionParams
{
    float BlendTime;                                                                  // 0x0000 (size: 0x4)
    TEnumAsByte<EViewTargetBlendFunction> BlendFunction;                              // 0x0004 (size: 0x1)
    float BlendExp;                                                                   // 0x0008 (size: 0x4)
    uint8 bLockOutgoing;                                                              // 0x000C (size: 0x1)

}; // Size: 0x10

struct FUpdateLevelVisibilityLevelInfo
{
    FName PackageName;                                                                // 0x0000 (size: 0x8)
    FName Filename;                                                                   // 0x0008 (size: 0x8)
    uint8 bIsVisible;                                                                 // 0x0010 (size: 0x1)

}; // Size: 0x14

struct FUniqueNetIdRepl : public FUniqueNetIdWrapper
{
    TArray<uint8> ReplicationBytes;                                                   // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FLatentActionInfo
{
    int32 Linkage;                                                                    // 0x0000 (size: 0x4)
    int32 UUID;                                                                       // 0x0004 (size: 0x4)
    FName ExecutionFunction;                                                          // 0x0008 (size: 0x8)
    class UObject* CallbackTarget;                                                    // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FUpdateLevelStreamingLevelStatus
{
    FName PackageName;                                                                // 0x0000 (size: 0x8)
    int32 LODIndex;                                                                   // 0x0008 (size: 0x4)
    bool bNewShouldBeLoaded;                                                          // 0x000C (size: 0x1)
    bool bNewShouldBeVisible;                                                         // 0x000D (size: 0x1)
    bool bNewShouldBlockOnLoad;                                                       // 0x000E (size: 0x1)

}; // Size: 0x10

struct FForceFeedbackParameters
{
    FName Tag;                                                                        // 0x0000 (size: 0x8)
    bool bLooping;                                                                    // 0x0008 (size: 0x1)
    bool bIgnoreTimeDilation;                                                         // 0x0009 (size: 0x1)
    bool bPlayWhilePaused;                                                            // 0x000A (size: 0x1)

}; // Size: 0xC

class APlayerController : public AController
{
    class UPlayer* Player;                                                            // 0x02A0 (size: 0x8)
    class APawn* AcknowledgedPawn;                                                    // 0x02A8 (size: 0x8)
    class UInterpTrackInstDirector* ControllingDirTrackInst;                          // 0x02B0 (size: 0x8)
    class AHUD* MyHUD;                                                                // 0x02B8 (size: 0x8)
    class APlayerCameraManager* PlayerCameraManager;                                  // 0x02C0 (size: 0x8)
    TSubclassOf<class APlayerCameraManager> PlayerCameraManagerClass;                 // 0x02C8 (size: 0x8)
    bool bAutoManageActiveCameraTarget;                                               // 0x02D0 (size: 0x1)
    FRotator TargetViewRotation;                                                      // 0x02D4 (size: 0xC)
    float SmoothTargetViewRotationSpeed;                                              // 0x02EC (size: 0x4)
    TArray<class AActor*> HiddenActors;                                               // 0x02F8 (size: 0x10)
    TArray<TWeakObjectPtr<UPrimitiveComponent>> HiddenPrimitiveComponents;            // 0x0308 (size: 0x10)
    float LastSpectatorStateSynchTime;                                                // 0x031C (size: 0x4)
    FVector LastSpectatorSyncLocation;                                                // 0x0320 (size: 0xC)
    FRotator LastSpectatorSyncRotation;                                               // 0x032C (size: 0xC)
    int32 ClientCap;                                                                  // 0x0338 (size: 0x4)
    class UCheatManager* CheatManager;                                                // 0x0340 (size: 0x8)
    TSubclassOf<class UCheatManager> CheatClass;                                      // 0x0348 (size: 0x8)
    class UPlayerInput* PlayerInput;                                                  // 0x0350 (size: 0x8)
    TArray<FActiveForceFeedbackEffect> ActiveForceFeedbackEffects;                    // 0x0358 (size: 0x10)
    uint8 bPlayerIsWaiting;                                                           // 0x03D8 (size: 0x1)
    uint8 NetPlayerIndex;                                                             // 0x03DC (size: 0x1)
    class UNetConnection* PendingSwapConnection;                                      // 0x0418 (size: 0x8)
    class UNetConnection* NetConnection;                                              // 0x0420 (size: 0x8)
    float InputYawScale;                                                              // 0x0434 (size: 0x4)
    float InputPitchScale;                                                            // 0x0438 (size: 0x4)
    float InputRollScale;                                                             // 0x043C (size: 0x4)
    uint8 bShowMouseCursor;                                                           // 0x0440 (size: 0x1)
    uint8 bEnableClickEvents;                                                         // 0x0440 (size: 0x1)
    uint8 bEnableTouchEvents;                                                         // 0x0440 (size: 0x1)
    uint8 bEnableMouseOverEvents;                                                     // 0x0440 (size: 0x1)
    uint8 bEnableTouchOverEvents;                                                     // 0x0440 (size: 0x1)
    uint8 bForceFeedbackEnabled;                                                      // 0x0440 (size: 0x1)
    float ForceFeedbackScale;                                                         // 0x0444 (size: 0x4)
    TArray<FKey> ClickEventKeys;                                                      // 0x0448 (size: 0x10)
    TEnumAsByte<EMouseCursor::Type> DefaultMouseCursor;                               // 0x0458 (size: 0x1)
    TEnumAsByte<EMouseCursor::Type> CurrentMouseCursor;                               // 0x0459 (size: 0x1)
    TEnumAsByte<ECollisionChannel> DefaultClickTraceChannel;                          // 0x045A (size: 0x1)
    TEnumAsByte<ECollisionChannel> CurrentClickTraceChannel;                          // 0x045B (size: 0x1)
    float HitResultTraceDistance;                                                     // 0x045C (size: 0x4)
    uint16 SeamlessTravelCount;                                                       // 0x0460 (size: 0x2)
    uint16 LastCompletedSeamlessTravelCount;                                          // 0x0462 (size: 0x2)
    class UInputComponent* InactiveStateInputComponent;                               // 0x04D8 (size: 0x8)
    uint8 bShouldPerformFullTickWhenPaused;                                           // 0x04E0 (size: 0x1)
    class UTouchInterface* CurrentTouchInterface;                                     // 0x04F8 (size: 0x8)
    class ASpectatorPawn* SpectatorPawn;                                              // 0x0550 (size: 0x8)
    bool bIsLocalPlayerController;                                                    // 0x055C (size: 0x1)
    FVector SpawnLocation;                                                            // 0x0560 (size: 0xC)

    bool WasInputKeyJustReleased(FKey Key);
    bool WasInputKeyJustPressed(FKey Key);
    void ToggleSpeaking(bool bInSpeaking);
    void TestServerLevelVisibilityChange(const FName PackageName, const FName Filename);
    void SwitchLevel(FString URL);
    void StopHapticEffect(EControllerHand Hand);
    void StartFire(uint8 FireModeNum);
    void SetVirtualJoystickVisibility(bool bVisible);
    void SetViewTargetWithBlend(class AActor* NewViewTarget, float BlendTime, TEnumAsByte<EViewTargetBlendFunction> BlendFunc, float BlendExp, bool bLockOutgoing);
    void SetName(FString S);
    void SetMouseLocation(const int32 X, const int32 Y);
    void SetMouseCursorWidget(TEnumAsByte<EMouseCursor::Type> Cursor, class UUserWidget* CursorWidget);
    void SetHapticsByValue(const float Frequency, const float Amplitude, EControllerHand Hand);
    void SetDisableHaptics(bool bNewDisabled);
    void SetControllerLightColor(FColor Color);
    void SetCinematicMode(bool bInCinematicMode, bool bHidePlayer, bool bAffectsHUD, bool bAffectsMovement, bool bAffectsTurning);
    void SetAudioListenerOverride(class USceneComponent* AttachToComponent, FVector Location, FRotator Rotation);
    void SetAudioListenerAttenuationOverride(class USceneComponent* AttachToComponent, FVector AttenuationLocationOVerride);
    void ServerViewSelf(FViewTargetTransitionParams TransitionParams);
    void ServerViewPrevPlayer();
    void ServerViewNextPlayer();
    void ServerVerifyViewTarget();
    void ServerUpdateMultipleLevelsVisibility(const TArray<FUpdateLevelVisibilityLevelInfo>& LevelVisibilities);
    void ServerUpdateLevelVisibility(const FUpdateLevelVisibilityLevelInfo& LevelVisibility);
    void ServerUpdateCamera(FVector_NetQuantize CamLoc, int32 CamPitchAndYaw);
    void ServerUnmutePlayer(FUniqueNetIdRepl PlayerId);
    void ServerToggleAILogging();
    void ServerShortTimeout();
    void ServerSetSpectatorWaiting(bool bWaiting);
    void ServerSetSpectatorLocation(FVector NewLoc, FRotator NewRot);
    void ServerRestartPlayer();
    void ServerPause();
    void ServerNotifyLoadedWorld(FName WorldPackageName);
    void ServerMutePlayer(FUniqueNetIdRepl PlayerId);
    void ServerExecRPC(FString Msg);
    void ServerExec(FString Msg);
    void ServerCheckClientPossessionReliable();
    void ServerCheckClientPossession();
    void ServerChangeName(FString S);
    void ServerCamera(FName NewMode);
    void ServerAcknowledgePossession(class APawn* P);
    void SendToConsole(FString Command);
    void RestartLevel();
    void ResetControllerLightColor();
    bool ProjectWorldLocationToScreen(FVector WorldLocation, FVector2D& ScreenLocation, bool bPlayerViewportRelative);
    void PlayHapticEffect(class UHapticFeedbackEffect_Base* HapticEffect, EControllerHand Hand, float Scale, bool bLoop);
    void PlayDynamicForceFeedback(float Intensity, float Duration, bool bAffectsLeftLarge, bool bAffectsLeftSmall, bool bAffectsRightLarge, bool bAffectsRightSmall, TEnumAsByte<EDynamicForceFeedbackAction::Type> Action, FLatentActionInfo LatentInfo);
    void Pause();
    void OnServerStartedVisualLogger(bool bIsLogging);
    void LocalTravel(FString URL);
    void K2_ClientPlayForceFeedback(class UForceFeedbackEffect* ForceFeedbackEffect, FName Tag, bool bLooping, bool bIgnoreTimeDilation, bool bPlayWhilePaused);
    bool IsInputKeyDown(FKey Key);
    void GetViewportSize(int32& SizeX, int32& SizeY);
    class ASpectatorPawn* GetSpectatorPawn();
    bool GetMousePosition(float& LocationX, float& LocationY);
    FVector GetInputVectorKeyState(FKey Key);
    void GetInputTouchState(TEnumAsByte<ETouchIndex::Type> FingerIndex, float& LocationX, float& LocationY, bool& bIsCurrentlyPressed);
    void GetInputMouseDelta(float& DeltaX, float& DeltaY);
    void GetInputMotionState(FVector& Tilt, FVector& RotationRate, FVector& Gravity, FVector& Acceleration);
    float GetInputKeyTimeDown(FKey Key);
    void GetInputAnalogStickState(TEnumAsByte<EControllerAnalogStick::Type> WhichStick, float& StickX, float& StickY);
    float GetInputAnalogKeyState(FKey Key);
    class AHUD* GetHUD();
    bool GetHitResultUnderFingerForObjects(TEnumAsByte<ETouchIndex::Type> FingerIndex, const TArray<TEnumAsByte<EObjectTypeQuery>>& ObjectTypes, bool bTraceComplex, FHitResult& HitResult);
    bool GetHitResultUnderFingerByChannel(TEnumAsByte<ETouchIndex::Type> FingerIndex, TEnumAsByte<ETraceTypeQuery> TraceChannel, bool bTraceComplex, FHitResult& HitResult);
    bool GetHitResultUnderFinger(TEnumAsByte<ETouchIndex::Type> FingerIndex, TEnumAsByte<ECollisionChannel> TraceChannel, bool bTraceComplex, FHitResult& HitResult);
    bool GetHitResultUnderCursorForObjects(const TArray<TEnumAsByte<EObjectTypeQuery>>& ObjectTypes, bool bTraceComplex, FHitResult& HitResult);
    bool GetHitResultUnderCursorByChannel(TEnumAsByte<ETraceTypeQuery> TraceChannel, bool bTraceComplex, FHitResult& HitResult);
    bool GetHitResultUnderCursor(TEnumAsByte<ECollisionChannel> TraceChannel, bool bTraceComplex, FHitResult& HitResult);
    FVector GetFocalLocation();
    void FOV(float NewFOV);
    void EnableCheats();
    bool DeprojectScreenPositionToWorld(float ScreenX, float ScreenY, FVector& WorldLocation, FVector& WorldDirection);
    bool DeprojectMousePositionToWorld(FVector& WorldLocation, FVector& WorldDirection);
    void ConsoleKey(FKey Key);
    void ClientWasKicked(const FText& KickReason);
    void ClientVoiceHandshakeComplete();
    void ClientUpdateMultipleLevelsStreamingStatus(const TArray<FUpdateLevelStreamingLevelStatus>& LevelStatuses);
    void ClientUpdateLevelStreamingStatus(FName PackageName, bool bNewShouldBeLoaded, bool bNewShouldBeVisible, bool bNewShouldBlockOnLoad, int32 LODIndex);
    void ClientUnmutePlayer(FUniqueNetIdRepl PlayerId);
    void ClientTravelInternal(FString URL, TEnumAsByte<ETravelType> TravelType, bool bSeamless, FGuid MapPackageGuid);
    void ClientTravel(FString URL, TEnumAsByte<ETravelType> TravelType, bool bSeamless, FGuid MapPackageGuid);
    void ClientTeamMessage(class APlayerState* SenderPlayerState, FString S, FName Type, float MsgLifeTime);
    void ClientStopForceFeedback(class UForceFeedbackEffect* ForceFeedbackEffect, FName Tag);
    void ClientStopCameraShakesFromSource(class UCameraShakeSourceComponent* SourceComponent, bool bImmediately);
    void ClientStopCameraShake(TSubclassOf<class UCameraShakeBase> Shake, bool bImmediately);
    void ClientStopCameraAnim(class UCameraAnim* AnimToStop);
    void ClientStartOnlineSession();
    void ClientStartCameraShakeFromSource(TSubclassOf<class UCameraShakeBase> Shake, class UCameraShakeSourceComponent* SourceComponent);
    void ClientStartCameraShake(TSubclassOf<class UCameraShakeBase> Shake, float Scale, ECameraShakePlaySpace PlaySpace, FRotator UserPlaySpaceRot);
    void ClientSpawnCameraLensEffect(TSubclassOf<class AEmitterCameraLensEffectBase> LensEffectEmitterClass);
    void ClientSetViewTarget(class AActor* A, FViewTargetTransitionParams TransitionParams);
    void ClientSetSpectatorWaiting(bool bWaiting);
    void ClientSetHUD(TSubclassOf<class AHUD> NewHUDClass);
    void ClientSetForceMipLevelsToBeResident(class UMaterialInterface* Material, float ForceDuration, int32 CinematicTextureGroups);
    void ClientSetCinematicMode(bool bInCinematicMode, bool bAffectsMovement, bool bAffectsTurning, bool bAffectsHUD);
    void ClientSetCameraMode(FName NewCamMode);
    void ClientSetCameraFade(bool bEnableFading, FColor FadeColor, FVector2D FadeAlpha, float FadeTime, bool bFadeAudio, bool bHoldWhenFinished);
    void ClientSetBlockOnAsyncLoading();
    void ClientReturnToMainMenuWithTextReason(const FText& ReturnReason);
    void ClientReturnToMainMenu(FString ReturnReason);
    void ClientRetryClientRestart(class APawn* NewPawn);
    void ClientRestart(class APawn* NewPawn);
    void ClientReset();
    void ClientRepObjRef(class UObject* Object);
    void ClientReceiveLocalizedMessage(TSubclassOf<class ULocalMessage> Message, int32 SWITCH, class APlayerState* RelatedPlayerState_1, class APlayerState* RelatedPlayerState_2, class UObject* OptionalObject);
    void ClientPrestreamTextures(class AActor* ForcedActor, float ForceDuration, bool bEnableStreaming, int32 CinematicTextureGroups);
    void ClientPrepareMapChange(FName LevelName, bool bFirst, bool bLast);
    void ClientPlaySoundAtLocation(class USoundBase* Sound, FVector Location, float VolumeMultiplier, float PitchMultiplier);
    void ClientPlaySound(class USoundBase* Sound, float VolumeMultiplier, float PitchMultiplier);
    void ClientPlayForceFeedback_Internal(class UForceFeedbackEffect* ForceFeedbackEffect, FForceFeedbackParameters Params);
    void ClientPlayCameraAnim(class UCameraAnim* AnimToPlay, float Scale, float Rate, float blendInTime, float blendOutTime, bool bLoop, bool bRandomStartTime, ECameraShakePlaySpace Space, FRotator CustomPlaySpace);
    void ClientMutePlayer(FUniqueNetIdRepl PlayerId);
    void ClientMessage(FString S, FName Type, float MsgLifeTime);
    void ClientIgnoreMoveInput(bool bIgnore);
    void ClientIgnoreLookInput(bool bIgnore);
    void ClientGotoState(FName NewState);
    void ClientGameEnded(class AActor* EndGameFocus, bool bIsWinner);
    void ClientForceGarbageCollection();
    void ClientFlushLevelStreaming();
    void ClientEndOnlineSession();
    void ClientEnableNetworkVoice(bool bEnable);
    void ClientCommitMapChange();
    void ClientClearCameraLensEffects();
    void ClientCapBandwidth(int32 Cap);
    void ClientCancelPendingMapChange();
    void ClientAddTextureStreamingLoc(FVector InLoc, float Duration, bool bOverrideLocation);
    void ClearAudioListenerOverride();
    void ClearAudioListenerAttenuationOverride();
    bool CanRestartPlayer();
    void Camera(FName NewMode);
    void AddYawInput(float Val);
    void AddRollInput(float Val);
    void AddPitchInput(float Val);
    void ActivateTouchInterface(class UTouchInterface* NewTouchInterface);
}; // Size: 0x578

struct FSubtitleCue
{
    FText Text;                                                                       // 0x0000 (size: 0x18)
    float Time;                                                                       // 0x0018 (size: 0x4)

}; // Size: 0x20

class UBlueprintAsyncActionBase : public UObject
{

    void Activate();
}; // Size: 0x30

struct FKeyHandleMap
{
}; // Size: 0x60

struct FIndexedCurve
{
    FKeyHandleMap KeyHandlesToIndices;                                                // 0x0008 (size: 0x60)

}; // Size: 0x68

struct FRealCurve : public FIndexedCurve
{
    float DefaultValue;                                                               // 0x0068 (size: 0x4)
    TEnumAsByte<ERichCurveExtrapolation> PreInfinityExtrap;                           // 0x006C (size: 0x1)
    TEnumAsByte<ERichCurveExtrapolation> PostInfinityExtrap;                          // 0x006D (size: 0x1)

}; // Size: 0x70

struct FRichCurveKey
{
    TEnumAsByte<ERichCurveInterpMode> InterpMode;                                     // 0x0000 (size: 0x1)
    TEnumAsByte<ERichCurveTangentMode> TangentMode;                                   // 0x0001 (size: 0x1)
    TEnumAsByte<ERichCurveTangentWeightMode> TangentWeightMode;                       // 0x0002 (size: 0x1)
    float Time;                                                                       // 0x0004 (size: 0x4)
    float Value;                                                                      // 0x0008 (size: 0x4)
    float ArriveTangent;                                                              // 0x000C (size: 0x4)
    float ArriveTangentWeight;                                                        // 0x0010 (size: 0x4)
    float LeaveTangent;                                                               // 0x0014 (size: 0x4)
    float LeaveTangentWeight;                                                         // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FRichCurve : public FRealCurve
{
    TArray<FRichCurveKey> Keys;                                                       // 0x0070 (size: 0x10)

}; // Size: 0x80

struct FRuntimeFloatCurve
{
    FRichCurve EditorCurveData;                                                       // 0x0000 (size: 0x80)
    class UCurveFloat* ExternalCurve;                                                 // 0x0080 (size: 0x8)

}; // Size: 0x88

class UGameInstance : public UObject
{
    TArray<class ULocalPlayer*> LocalPlayers;                                         // 0x0038 (size: 0x10)
    class UOnlineSession* OnlineSession;                                              // 0x0048 (size: 0x8)
    TArray<class UObject*> ReferencedObjects;                                         // 0x0050 (size: 0x10)
    FGameInstanceOnPawnControllerChangedDelegates OnPawnControllerChangedDelegates;   // 0x0078 (size: 0x10)
    void OnPawnControllerChanged(class APawn* Pawn, class AController* Controller);

    void ReceiveShutdown();
    void ReceiveInit();
    void HandleTravelError(TEnumAsByte<ETravelFailure::Type> FailureType);
    void HandleNetworkError(TEnumAsByte<ENetworkFailure::Type> FailureType, bool bIsServer);
    void DebugRemovePlayer(int32 ControllerId);
    void DebugCreatePlayer(int32 ControllerId);
}; // Size: 0x1A8

class UPlatformGameInstance : public UGameInstance
{
    FPlatformGameInstanceApplicationWillDeactivateDelegate ApplicationWillDeactivateDelegate; // 0x01A8 (size: 0x10)
    void PlatformDelegate();
    FPlatformGameInstanceApplicationHasReactivatedDelegate ApplicationHasReactivatedDelegate; // 0x01B8 (size: 0x10)
    void PlatformDelegate();
    FPlatformGameInstanceApplicationWillEnterBackgroundDelegate ApplicationWillEnterBackgroundDelegate; // 0x01C8 (size: 0x10)
    void PlatformDelegate();
    FPlatformGameInstanceApplicationHasEnteredForegroundDelegate ApplicationHasEnteredForegroundDelegate; // 0x01D8 (size: 0x10)
    void PlatformDelegate();
    FPlatformGameInstanceApplicationWillTerminateDelegate ApplicationWillTerminateDelegate; // 0x01E8 (size: 0x10)
    void PlatformDelegate();
    FPlatformGameInstanceApplicationShouldUnloadResourcesDelegate ApplicationShouldUnloadResourcesDelegate; // 0x01F8 (size: 0x10)
    void PlatformDelegate();
    FPlatformGameInstanceApplicationReceivedStartupArgumentsDelegate ApplicationReceivedStartupArgumentsDelegate; // 0x0208 (size: 0x10)
    void PlatformStartupArgumentsDelegate(const TArray<FString>& StartupArguments);
    FPlatformGameInstanceApplicationRegisteredForRemoteNotificationsDelegate ApplicationRegisteredForRemoteNotificationsDelegate; // 0x0218 (size: 0x10)
    void PlatformRegisteredForRemoteNotificationsDelegate(const TArray<uint8>& inArray);
    FPlatformGameInstanceApplicationRegisteredForUserNotificationsDelegate ApplicationRegisteredForUserNotificationsDelegate; // 0x0228 (size: 0x10)
    void PlatformRegisteredForUserNotificationsDelegate(int32 inInt);
    FPlatformGameInstanceApplicationFailedToRegisterForRemoteNotificationsDelegate ApplicationFailedToRegisterForRemoteNotificationsDelegate; // 0x0238 (size: 0x10)
    void PlatformFailedToRegisterForRemoteNotificationsDelegate(FString inString);
    FPlatformGameInstanceApplicationReceivedRemoteNotificationDelegate ApplicationReceivedRemoteNotificationDelegate; // 0x0248 (size: 0x10)
    void PlatformReceivedRemoteNotificationDelegate(FString inString, TEnumAsByte<EApplicationState::Type> inAppState);
    FPlatformGameInstanceApplicationReceivedLocalNotificationDelegate ApplicationReceivedLocalNotificationDelegate; // 0x0258 (size: 0x10)
    void PlatformReceivedLocalNotificationDelegate(FString inString, int32 inInt, TEnumAsByte<EApplicationState::Type> inAppState);
    FPlatformGameInstanceApplicationReceivedScreenOrientationChangedNotificationDelegate ApplicationReceivedScreenOrientationChangedNotificationDelegate; // 0x0268 (size: 0x10)
    void PlatformScreenOrientationChangedDelegate(TEnumAsByte<EScreenOrientation::Type> inScreenOrientation);

}; // Size: 0x278

struct FDebugTextInfo
{
    class AActor* SrcActor;                                                           // 0x0000 (size: 0x8)
    FVector SrcActorOffset;                                                           // 0x0008 (size: 0xC)
    FVector SrcActorDesiredOffset;                                                    // 0x0014 (size: 0xC)
    FString DebugText;                                                                // 0x0020 (size: 0x10)
    float TimeRemaining;                                                              // 0x0030 (size: 0x4)
    float Duration;                                                                   // 0x0034 (size: 0x4)
    FColor TextColor;                                                                 // 0x0038 (size: 0x4)
    uint8 bAbsoluteLocation;                                                          // 0x003C (size: 0x1)
    uint8 bKeepAttachedToActor;                                                       // 0x003C (size: 0x1)
    uint8 bDrawShadow;                                                                // 0x003C (size: 0x1)
    FVector OrigActorLocation;                                                        // 0x0040 (size: 0xC)
    class UFont* Font;                                                                // 0x0050 (size: 0x8)
    float FontScale;                                                                  // 0x0058 (size: 0x4)

}; // Size: 0x60

class AHUD : public AActor
{
    class APlayerController* PlayerOwner;                                             // 0x0228 (size: 0x8)
    uint8 bLostFocusPaused;                                                           // 0x0230 (size: 0x1)
    uint8 bShowHUD;                                                                   // 0x0230 (size: 0x1)
    uint8 bShowDebugInfo;                                                             // 0x0230 (size: 0x1)
    int32 CurrentTargetIndex;                                                         // 0x0234 (size: 0x4)
    uint8 bShowHitBoxDebugInfo;                                                       // 0x0238 (size: 0x1)
    uint8 bShowOverlays;                                                              // 0x0238 (size: 0x1)
    uint8 bEnableDebugTextShadow;                                                     // 0x0238 (size: 0x1)
    TArray<class AActor*> PostRenderedActors;                                         // 0x0240 (size: 0x10)
    TArray<FName> DebugDisplay;                                                       // 0x0258 (size: 0x10)
    TArray<FName> ToggledDebugCategories;                                             // 0x0268 (size: 0x10)
    class UCanvas* Canvas;                                                            // 0x0278 (size: 0x8)
    class UCanvas* DebugCanvas;                                                       // 0x0280 (size: 0x8)
    TArray<FDebugTextInfo> DebugTextList;                                             // 0x0288 (size: 0x10)
    TSubclassOf<class AActor> ShowDebugTargetDesiredClass;                            // 0x0298 (size: 0x8)
    class AActor* ShowDebugTargetActor;                                               // 0x02A0 (size: 0x8)

    void ShowHUD();
    void ShowDebugToggleSubCategory(FName Category);
    void ShowDebugForReticleTargetToggle(TSubclassOf<class AActor> DesiredClass);
    void ShowDebug(FName DebugType);
    void RemoveDebugText(class AActor* SrcActor, bool bLeaveDurationText);
    void RemoveAllDebugStrings();
    void ReceiveHitBoxRelease(const FName BoxName);
    void ReceiveHitBoxEndCursorOver(const FName BoxName);
    void ReceiveHitBoxClick(const FName BoxName);
    void ReceiveHitBoxBeginCursorOver(const FName BoxName);
    void ReceiveDrawHUD(int32 SizeX, int32 SizeY);
    FVector Project(FVector Location);
    void PreviousDebugTarget();
    void NextDebugTarget();
    void GetTextSize(FString Text, float& OutWidth, float& OutHeight, class UFont* Font, float Scale);
    class APlayerController* GetOwningPlayerController();
    class APawn* GetOwningPawn();
    void GetActorsInSelectionRectangle(TSubclassOf<class AActor> ClassFilter, const FVector2D& FirstPoint, const FVector2D& SecondPoint, TArray<class AActor*>& OutActors, bool bIncludeNonCollidingComponents, bool bActorMustBeFullyEnclosed);
    void DrawTextureSimple(class UTexture* Texture, float ScreenX, float ScreenY, float Scale, bool bScalePosition);
    void DrawTexture(class UTexture* Texture, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float TextureU, float TextureV, float TextureUWidth, float TextureVHeight, FLinearColor TintColor, TEnumAsByte<EBlendMode> BlendMode, float Scale, bool bScalePosition, float Rotation, FVector2D RotPivot);
    void DrawText(FString Text, FLinearColor TextColor, float ScreenX, float ScreenY, class UFont* Font, float Scale, bool bScalePosition);
    void DrawRect(FLinearColor RectColor, float ScreenX, float ScreenY, float ScreenW, float ScreenH);
    void DrawMaterialTriangle(class UMaterialInterface* Material, FVector2D V0_Pos, FVector2D V1_Pos, FVector2D V2_Pos, FVector2D V0_UV, FVector2D V1_UV, FVector2D V2_UV, FLinearColor V0_Color, FLinearColor V1_Color, FLinearColor V2_Color);
    void DrawMaterialSimple(class UMaterialInterface* Material, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float Scale, bool bScalePosition);
    void DrawMaterial(class UMaterialInterface* Material, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float MaterialU, float MaterialV, float MaterialUWidth, float MaterialVHeight, float Scale, bool bScalePosition, float Rotation, FVector2D RotPivot);
    void DrawLine(float StartScreenX, float StartScreenY, float EndScreenX, float EndScreenY, FLinearColor LineColor, float LineThickness);
    void Deproject(float ScreenX, float ScreenY, FVector& WorldPosition, FVector& WorldDirection);
    void AddHitBox(FVector2D Position, FVector2D Size, FName InName, bool bConsumesInput, int32 Priority);
    void AddDebugText(FString DebugText, class AActor* SrcActor, float Duration, FVector Offset, FVector DesiredOffset, FColor TextColor, bool bSkipOverwriteCheck, bool bAbsoluteLocation, bool bKeepAttachedToActor, class UFont* InFont, float FontScale, bool bDrawShadow);
}; // Size: 0x318

struct FCollisionProfileName
{
    FName Name;                                                                       // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FSoundConcurrencySettings
{
    int32 MaxCount;                                                                   // 0x0000 (size: 0x4)
    uint8 bLimitToOwner;                                                              // 0x0004 (size: 0x1)
    TEnumAsByte<EMaxConcurrentResolutionRule::Type> ResolutionRule;                   // 0x0008 (size: 0x1)
    float RetriggerTime;                                                              // 0x000C (size: 0x4)
    float VolumeScale;                                                                // 0x0010 (size: 0x4)
    EConcurrencyVolumeScaleMode VolumeScaleMode;                                      // 0x0014 (size: 0x4)
    float VolumeScaleAttackTime;                                                      // 0x0018 (size: 0x4)
    uint8 bVolumeScaleCanRelease;                                                     // 0x001C (size: 0x1)
    float VolumeScaleReleaseTime;                                                     // 0x0020 (size: 0x4)
    float VoiceStealReleaseTime;                                                      // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FSoundSubmixSendInfo
{
    ESendLevelControlMethod SendLevelControlMethod;                                   // 0x0000 (size: 0x1)
    ESubmixSendStage SendStage;                                                       // 0x0001 (size: 0x1)
    class USoundSubmixBase* SoundSubmix;                                              // 0x0008 (size: 0x8)
    float SendLevel;                                                                  // 0x0010 (size: 0x4)
    float MinSendLevel;                                                               // 0x0014 (size: 0x4)
    float MaxSendLevel;                                                               // 0x0018 (size: 0x4)
    float MinSendDistance;                                                            // 0x001C (size: 0x4)
    float MaxSendDistance;                                                            // 0x0020 (size: 0x4)
    FRuntimeFloatCurve CustomSendLevelCurve;                                          // 0x0028 (size: 0x88)

}; // Size: 0xB0

struct FSoundSourceBusSendInfo
{
    ESourceBusSendLevelControlMethod SourceBusSendLevelControlMethod;                 // 0x0000 (size: 0x1)
    class USoundSourceBus* SoundSourceBus;                                            // 0x0008 (size: 0x8)
    class UAudioBus* AudioBus;                                                        // 0x0010 (size: 0x8)
    float SendLevel;                                                                  // 0x0018 (size: 0x4)
    float MinSendLevel;                                                               // 0x001C (size: 0x4)
    float MaxSendLevel;                                                               // 0x0020 (size: 0x4)
    float MinSendDistance;                                                            // 0x0024 (size: 0x4)
    float MaxSendDistance;                                                            // 0x0028 (size: 0x4)
    FRuntimeFloatCurve CustomSendLevelCurve;                                          // 0x0030 (size: 0x88)

}; // Size: 0xB8

class USoundBase : public UObject
{
    class USoundClass* SoundClassObject;                                              // 0x0030 (size: 0x8)
    uint8 bDebug;                                                                     // 0x0038 (size: 0x1)
    uint8 bOverrideConcurrency;                                                       // 0x0038 (size: 0x1)
    uint8 bEnableBusSends;                                                            // 0x0038 (size: 0x1)
    uint8 bEnableBaseSubmix;                                                          // 0x0038 (size: 0x1)
    uint8 bEnableSubmixSends;                                                         // 0x0038 (size: 0x1)
    uint8 bHasDelayNode;                                                              // 0x0038 (size: 0x1)
    uint8 bHasConcatenatorNode;                                                       // 0x0038 (size: 0x1)
    uint8 bBypassVolumeScaleForPriority;                                              // 0x0038 (size: 0x1)
    EVirtualizationMode VirtualizationMode;                                           // 0x0039 (size: 0x1)
    TSet<USoundConcurrency*> ConcurrencySet;                                          // 0x0090 (size: 0x50)
    FSoundConcurrencySettings ConcurrencyOverrides;                                   // 0x00E0 (size: 0x28)
    float Duration;                                                                   // 0x0108 (size: 0x4)
    float MaxDistance;                                                                // 0x010C (size: 0x4)
    float TotalSamples;                                                               // 0x0110 (size: 0x4)
    float Priority;                                                                   // 0x0114 (size: 0x4)
    class USoundAttenuation* AttenuationSettings;                                     // 0x0118 (size: 0x8)
    class USoundSubmixBase* SoundSubmixObject;                                        // 0x0120 (size: 0x8)
    TArray<FSoundSubmixSendInfo> SoundSubmixSends;                                    // 0x0128 (size: 0x10)
    class USoundEffectSourcePresetChain* SourceEffectChain;                           // 0x0138 (size: 0x8)
    TArray<FSoundSourceBusSendInfo> BusSends;                                         // 0x0140 (size: 0x10)
    TArray<FSoundSourceBusSendInfo> PreEffectBusSends;                                // 0x0150 (size: 0x10)
    TArray<class UAssetUserData*> AssetUserData;                                      // 0x0160 (size: 0x10)

}; // Size: 0x170

struct FTableRowBase
{
}; // Size: 0x8

struct FBaseAttenuationSettings
{
    EAttenuationDistanceModel DistanceAlgorithm;                                      // 0x0008 (size: 0x1)
    TEnumAsByte<EAttenuationShape::Type> AttenuationShape;                            // 0x0009 (size: 0x1)
    float dBAttenuationAtMax;                                                         // 0x000C (size: 0x4)
    ENaturalSoundFalloffMode FalloffMode;                                             // 0x0010 (size: 0x1)
    FVector AttenuationShapeExtents;                                                  // 0x0014 (size: 0xC)
    float ConeOffset;                                                                 // 0x0020 (size: 0x4)
    float FalloffDistance;                                                            // 0x0024 (size: 0x4)
    FRuntimeFloatCurve CustomAttenuationCurve;                                        // 0x0028 (size: 0x88)

}; // Size: 0xB0

struct FAttenuationSubmixSendSettings
{
    class USoundSubmixBase* Submix;                                                   // 0x0000 (size: 0x8)
    ESubmixSendMethod SubmixSendMethod;                                               // 0x0008 (size: 0x1)
    float SubmixSendLevelMin;                                                         // 0x000C (size: 0x4)
    float SubmixSendLevelMax;                                                         // 0x0010 (size: 0x4)
    float SubmixSendDistanceMin;                                                      // 0x0014 (size: 0x4)
    float SubmixSendDistanceMax;                                                      // 0x0018 (size: 0x4)
    float ManualSubmixSendLevel;                                                      // 0x001C (size: 0x4)
    FRuntimeFloatCurve CustomSubmixSendCurve;                                         // 0x0020 (size: 0x88)

}; // Size: 0xA8

struct FSoundAttenuationPluginSettings
{
    TArray<class USpatializationPluginSourceSettingsBase*> SpatializationPluginSettingsArray; // 0x0000 (size: 0x10)
    TArray<class UOcclusionPluginSourceSettingsBase*> OcclusionPluginSettingsArray;   // 0x0010 (size: 0x10)
    TArray<class UReverbPluginSourceSettingsBase*> ReverbPluginSettingsArray;         // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FSoundAttenuationSettings : public FBaseAttenuationSettings
{
    uint8 bAttenuate;                                                                 // 0x00B0 (size: 0x1)
    uint8 bSpatialize;                                                                // 0x00B0 (size: 0x1)
    uint8 bAttenuateWithLPF;                                                          // 0x00B0 (size: 0x1)
    uint8 bEnableListenerFocus;                                                       // 0x00B0 (size: 0x1)
    uint8 bEnableFocusInterpolation;                                                  // 0x00B0 (size: 0x1)
    uint8 bEnableOcclusion;                                                           // 0x00B0 (size: 0x1)
    uint8 bUseComplexCollisionForOcclusion;                                           // 0x00B0 (size: 0x1)
    uint8 bEnableReverbSend;                                                          // 0x00B0 (size: 0x1)
    uint8 bEnablePriorityAttenuation;                                                 // 0x00B1 (size: 0x1)
    uint8 bApplyNormalizationToStereoSounds;                                          // 0x00B1 (size: 0x1)
    uint8 bEnableLogFrequencyScaling;                                                 // 0x00B1 (size: 0x1)
    uint8 bEnableSubmixSends;                                                         // 0x00B1 (size: 0x1)
    TEnumAsByte<ESoundSpatializationAlgorithm> SpatializationAlgorithm;               // 0x00B2 (size: 0x1)
    float BinauralRadius;                                                             // 0x00B4 (size: 0x4)
    EAirAbsorptionMethod AbsorptionMethod;                                            // 0x00B8 (size: 0x1)
    TEnumAsByte<ECollisionChannel> OcclusionTraceChannel;                             // 0x00B9 (size: 0x1)
    EReverbSendMethod ReverbSendMethod;                                               // 0x00BA (size: 0x1)
    EPriorityAttenuationMethod PriorityAttenuationMethod;                             // 0x00BB (size: 0x1)
    float OmniRadius;                                                                 // 0x00BC (size: 0x4)
    float StereoSpread;                                                               // 0x00C0 (size: 0x4)
    float LPFRadiusMin;                                                               // 0x00C4 (size: 0x4)
    float LPFRadiusMax;                                                               // 0x00C8 (size: 0x4)
    FRuntimeFloatCurve CustomLowpassAirAbsorptionCurve;                               // 0x00D0 (size: 0x88)
    FRuntimeFloatCurve CustomHighpassAirAbsorptionCurve;                              // 0x0158 (size: 0x88)
    float LPFFrequencyAtMin;                                                          // 0x01E0 (size: 0x4)
    float LPFFrequencyAtMax;                                                          // 0x01E4 (size: 0x4)
    float HPFFrequencyAtMin;                                                          // 0x01E8 (size: 0x4)
    float HPFFrequencyAtMax;                                                          // 0x01EC (size: 0x4)
    float FocusAzimuth;                                                               // 0x01F0 (size: 0x4)
    float NonFocusAzimuth;                                                            // 0x01F4 (size: 0x4)
    float FocusDistanceScale;                                                         // 0x01F8 (size: 0x4)
    float NonFocusDistanceScale;                                                      // 0x01FC (size: 0x4)
    float FocusPriorityScale;                                                         // 0x0200 (size: 0x4)
    float NonFocusPriorityScale;                                                      // 0x0204 (size: 0x4)
    float FocusVolumeAttenuation;                                                     // 0x0208 (size: 0x4)
    float NonFocusVolumeAttenuation;                                                  // 0x020C (size: 0x4)
    float FocusAttackInterpSpeed;                                                     // 0x0210 (size: 0x4)
    float FocusReleaseInterpSpeed;                                                    // 0x0214 (size: 0x4)
    float OcclusionLowPassFilterFrequency;                                            // 0x0218 (size: 0x4)
    float OcclusionVolumeAttenuation;                                                 // 0x021C (size: 0x4)
    float OcclusionInterpolationTime;                                                 // 0x0220 (size: 0x4)
    float ReverbWetLevelMin;                                                          // 0x0224 (size: 0x4)
    float ReverbWetLevelMax;                                                          // 0x0228 (size: 0x4)
    float ReverbDistanceMin;                                                          // 0x022C (size: 0x4)
    float ReverbDistanceMax;                                                          // 0x0230 (size: 0x4)
    float ManualReverbSendLevel;                                                      // 0x0234 (size: 0x4)
    FRuntimeFloatCurve CustomReverbSendCurve;                                         // 0x0238 (size: 0x88)
    TArray<FAttenuationSubmixSendSettings> SubmixSendSettings;                        // 0x02C0 (size: 0x10)
    float PriorityAttenuationMin;                                                     // 0x02D0 (size: 0x4)
    float PriorityAttenuationMax;                                                     // 0x02D4 (size: 0x4)
    float PriorityAttenuationDistanceMin;                                             // 0x02D8 (size: 0x4)
    float PriorityAttenuationDistanceMax;                                             // 0x02DC (size: 0x4)
    float ManualPriorityAttenuation;                                                  // 0x02E0 (size: 0x4)
    FRuntimeFloatCurve CustomPriorityAttenuationCurve;                                // 0x02E8 (size: 0x88)
    FSoundAttenuationPluginSettings PluginSettings;                                   // 0x0370 (size: 0x30)

}; // Size: 0x3A0

class USoundEffectPreset : public UObject
{
}; // Size: 0x68

class USoundEffectSourcePreset : public USoundEffectPreset
{
}; // Size: 0x68

struct FSoundModulationDestinationSettings
{
    float Value;                                                                      // 0x0000 (size: 0x4)
    class USoundModulatorBase* Modulator;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

class USoundEffectSubmixPreset : public USoundEffectPreset
{
}; // Size: 0x68

class UExporter : public UObject
{
    UClass* SupportedClass;                                                           // 0x0028 (size: 0x8)
    class UObject* ExportRootScope;                                                   // 0x0030 (size: 0x8)
    TArray<FString> FormatExtension;                                                  // 0x0038 (size: 0x10)
    TArray<FString> FormatDescription;                                                // 0x0048 (size: 0x10)
    int32 PreferredFormatIndex;                                                       // 0x0058 (size: 0x4)
    int32 TextIndent;                                                                 // 0x005C (size: 0x4)
    uint8 bText;                                                                      // 0x0060 (size: 0x1)
    uint8 bSelectedOnly;                                                              // 0x0060 (size: 0x1)
    uint8 bForceFileOperations;                                                       // 0x0060 (size: 0x1)
    class UAssetExportTask* ExportTask;                                               // 0x0068 (size: 0x8)

    bool ScriptRunAssetExportTask(class UAssetExportTask* Task);
    bool RunAssetExportTasks(const TArray<class UAssetExportTask*>& ExportTasks);
    bool RunAssetExportTask(class UAssetExportTask* Task);
}; // Size: 0x78

class UPlayer : public UObject
{
    class APlayerController* PlayerController;                                        // 0x0030 (size: 0x8)
    int32 CurrentNetSpeed;                                                            // 0x0038 (size: 0x4)
    int32 ConfiguredInternetSpeed;                                                    // 0x003C (size: 0x4)
    int32 ConfiguredLanSpeed;                                                         // 0x0040 (size: 0x4)

}; // Size: 0x48

class UNetConnection : public UPlayer
{
    TArray<class UChildConnection*> Children;                                         // 0x0048 (size: 0x10)
    class UNetDriver* Driver;                                                         // 0x0058 (size: 0x8)
    TSubclassOf<class UPackageMap> PackageMapClass;                                   // 0x0060 (size: 0x8)
    class UPackageMap* PackageMap;                                                    // 0x0068 (size: 0x8)
    TArray<class UChannel*> OpenChannels;                                             // 0x0070 (size: 0x10)
    TArray<class AActor*> SentTemporaries;                                            // 0x0080 (size: 0x10)
    class AActor* ViewTarget;                                                         // 0x0090 (size: 0x8)
    class AActor* OwningActor;                                                        // 0x0098 (size: 0x8)
    int32 MaxPacket;                                                                  // 0x00A0 (size: 0x4)
    uint8 InternalAck;                                                                // 0x00A4 (size: 0x1)
    FUniqueNetIdRepl PlayerId;                                                        // 0x0160 (size: 0x28)
    double LastReceiveTime;                                                           // 0x01D0 (size: 0x8)
    TArray<class UChannel*> ChannelsToTick;                                           // 0x1510 (size: 0x10)

}; // Size: 0x1BA8

struct FChannelDefinition
{
    FName ChannelName;                                                                // 0x0000 (size: 0x8)
    FName ClassName;                                                                  // 0x0008 (size: 0x8)
    UClass* ChannelClass;                                                             // 0x0010 (size: 0x8)
    int32 StaticChannelIndex;                                                         // 0x0018 (size: 0x4)
    bool bTickOnCreate;                                                               // 0x001C (size: 0x1)
    bool bServerOpen;                                                                 // 0x001D (size: 0x1)
    bool bClientOpen;                                                                 // 0x001E (size: 0x1)
    bool bInitialServer;                                                              // 0x001F (size: 0x1)
    bool bInitialClient;                                                              // 0x0020 (size: 0x1)

}; // Size: 0x28

class UNetDriver : public UObject
{
    FString NetConnectionClassName;                                                   // 0x0030 (size: 0x10)
    FString ReplicationDriverClassName;                                               // 0x0040 (size: 0x10)
    int32 MaxDownloadSize;                                                            // 0x0050 (size: 0x4)
    uint8 bClampListenServerTickRate;                                                 // 0x0054 (size: 0x1)
    int32 NetServerMaxTickRate;                                                       // 0x0058 (size: 0x4)
    int32 MaxNetTickRate;                                                             // 0x005C (size: 0x4)
    int32 MaxInternetClientRate;                                                      // 0x0060 (size: 0x4)
    int32 MaxClientRate;                                                              // 0x0064 (size: 0x4)
    float ServerTravelPause;                                                          // 0x0068 (size: 0x4)
    float SpawnPrioritySeconds;                                                       // 0x006C (size: 0x4)
    float RelevantTimeout;                                                            // 0x0070 (size: 0x4)
    float KeepAliveTime;                                                              // 0x0074 (size: 0x4)
    float InitialConnectTimeout;                                                      // 0x0078 (size: 0x4)
    float ConnectionTimeout;                                                          // 0x007C (size: 0x4)
    float TimeoutMultiplierForUnoptimizedBuilds;                                      // 0x0080 (size: 0x4)
    bool bNoTimeouts;                                                                 // 0x0084 (size: 0x1)
    bool bNeverApplyNetworkEmulationSettings;                                         // 0x0085 (size: 0x1)
    class UNetConnection* ServerConnection;                                           // 0x0088 (size: 0x8)
    TArray<class UNetConnection*> ClientConnections;                                  // 0x0090 (size: 0x10)
    int32 RecentlyDisconnectedTrackingTime;                                           // 0x0100 (size: 0x4)
    class UWorld* World;                                                              // 0x0140 (size: 0x8)
    class UPackage* WorldPackage;                                                     // 0x0148 (size: 0x8)
    UClass* NetConnectionClass;                                                       // 0x0170 (size: 0x8)
    UClass* ReplicationDriverClass;                                                   // 0x0178 (size: 0x8)
    FName NetDriverName;                                                              // 0x0190 (size: 0x8)
    TArray<FChannelDefinition> ChannelDefinitions;                                    // 0x0198 (size: 0x10)
    TMap<class FName, class FChannelDefinition> ChannelDefinitionMap;                 // 0x01A8 (size: 0x50)
    TArray<class UChannel*> ActorChannelPool;                                         // 0x01F8 (size: 0x10)
    float Time;                                                                       // 0x0210 (size: 0x4)
    class UReplicationDriver* ReplicationDriver;                                      // 0x0700 (size: 0x8)

}; // Size: 0x760

class UOnlineBlueprintCallProxyBase : public UBlueprintAsyncActionBase
{
}; // Size: 0x30

class UOnlineEngineInterface : public UObject
{
}; // Size: 0x28

class UOnlineSession : public UObject
{
}; // Size: 0x28

class UTexture : public UStreamableRenderAsset
{
    FGuid LightingGuid;                                                               // 0x0068 (size: 0x10)
    int32 LODBias;                                                                    // 0x0078 (size: 0x4)
    TEnumAsByte<TextureCompressionSettings> CompressionSettings;                      // 0x007C (size: 0x1)
    TEnumAsByte<TextureFilter> Filter;                                                // 0x007D (size: 0x1)
    ETextureMipLoadOptions MipLoadOptions;                                            // 0x007E (size: 0x1)
    TEnumAsByte<TextureGroup> LODGroup;                                               // 0x007F (size: 0x1)
    FPerPlatformFloat Downscale;                                                      // 0x0080 (size: 0x4)
    ETextureDownscaleOptions DownscaleOptions;                                        // 0x0084 (size: 0x1)
    uint8 sRGB;                                                                       // 0x0085 (size: 0x1)
    uint8 bNoTiling;                                                                  // 0x0085 (size: 0x1)
    uint8 VirtualTextureStreaming;                                                    // 0x0085 (size: 0x1)
    uint8 CompressionYCoCg;                                                           // 0x0085 (size: 0x1)
    uint8 bNotOfflineProcessed;                                                       // 0x0085 (size: 0x1)
    uint8 bAsyncResourceReleaseHasBeenStarted;                                        // 0x0085 (size: 0x1)
    TArray<class UAssetUserData*> AssetUserData;                                      // 0x0088 (size: 0x10)

}; // Size: 0x180

struct FKShapeElem
{
    float RestOffset;                                                                 // 0x0008 (size: 0x4)
    FName Name;                                                                       // 0x000C (size: 0x8)
    uint8 bContributeToMass;                                                          // 0x0018 (size: 0x1)
    TEnumAsByte<ECollisionEnabled::Type> CollisionEnabled;                            // 0x0019 (size: 0x1)

}; // Size: 0x30

struct FKConvexElem : public FKShapeElem
{
    TArray<FVector> VertexData;                                                       // 0x0030 (size: 0x10)
    TArray<int32> IndexData;                                                          // 0x0040 (size: 0x10)
    FBox ElemBox;                                                                     // 0x0050 (size: 0x1C)
    FTransform Transform;                                                             // 0x0070 (size: 0x30)

}; // Size: 0xB0

struct FSingleAnimationPlayData
{
    class UAnimationAsset* AnimToPlay;                                                // 0x0000 (size: 0x8)
    uint8 bSavedLooping;                                                              // 0x0008 (size: 0x1)
    uint8 bSavedPlaying;                                                              // 0x0008 (size: 0x1)
    float SavedPosition;                                                              // 0x000C (size: 0x4)
    float SavedPlayRate;                                                              // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FPoseSnapshot
{
    TArray<FTransform> LocalTransforms;                                               // 0x0000 (size: 0x10)
    TArray<FName> BoneNames;                                                          // 0x0010 (size: 0x10)
    FName SkeletalMeshName;                                                           // 0x0020 (size: 0x8)
    FName SnapshotName;                                                               // 0x0028 (size: 0x8)
    bool bIsValid;                                                                    // 0x0030 (size: 0x1)

}; // Size: 0x38

class USkeletalMeshComponent : public USkinnedMeshComponent
{
    UClass* AnimBlueprintGeneratedClass;                                              // 0x06A0 (size: 0x8)
    TSubclassOf<class UAnimInstance> AnimClass;                                       // 0x06A8 (size: 0x8)
    class UAnimInstance* AnimScriptInstance;                                          // 0x06B0 (size: 0x8)
    class UAnimInstance* PostProcessAnimInstance;                                     // 0x06B8 (size: 0x8)
    FSingleAnimationPlayData AnimationData;                                           // 0x06C0 (size: 0x18)
    FVector RootBoneTranslation;                                                      // 0x06E8 (size: 0xC)
    FVector LineCheckBoundsScale;                                                     // 0x06F4 (size: 0xC)
    TArray<class UAnimInstance*> LinkedInstances;                                     // 0x0730 (size: 0x10)
    TArray<FTransform> CachedBoneSpaceTransforms;                                     // 0x0740 (size: 0x10)
    TArray<FTransform> CachedComponentSpaceTransforms;                                // 0x0750 (size: 0x10)
    float GlobalAnimRateScale;                                                        // 0x08B0 (size: 0x4)
    TEnumAsByte<EKinematicBonesUpdateToPhysics::Type> KinematicBonesUpdateType;       // 0x08B4 (size: 0x1)
    TEnumAsByte<EPhysicsTransformUpdateMode::Type> PhysicsTransformUpdateMode;        // 0x08B5 (size: 0x1)
    TEnumAsByte<EAnimationMode::Type> AnimationMode;                                  // 0x08B7 (size: 0x1)
    uint8 bDisablePostProcessBlueprint;                                               // 0x08B9 (size: 0x1)
    uint8 bUpdateOverlapsOnAnimationFinalize;                                         // 0x08B9 (size: 0x1)
    uint8 bHasValidBodies;                                                            // 0x08B9 (size: 0x1)
    uint8 bBlendPhysics;                                                              // 0x08B9 (size: 0x1)
    uint8 bEnablePhysicsOnDedicatedServer;                                            // 0x08B9 (size: 0x1)
    uint8 bUpdateJointsFromAnimation;                                                 // 0x08B9 (size: 0x1)
    uint8 bDisableClothSimulation;                                                    // 0x08BA (size: 0x1)
    uint8 bDisableRigidBodyAnimNode;                                                  // 0x08C0 (size: 0x1)
    uint8 bAllowAnimCurveEvaluation;                                                  // 0x08C0 (size: 0x1)
    uint8 bDisableAnimCurves;                                                         // 0x08C0 (size: 0x1)
    uint8 bCollideWithEnvironment;                                                    // 0x08C0 (size: 0x1)
    uint8 bCollideWithAttachedChildren;                                               // 0x08C1 (size: 0x1)
    uint8 bLocalSpaceSimulation;                                                      // 0x08C1 (size: 0x1)
    uint8 bResetAfterTeleport;                                                        // 0x08C1 (size: 0x1)
    uint8 bDeferKinematicBoneUpdate;                                                  // 0x08C1 (size: 0x1)
    uint8 bNoSkeletonUpdate;                                                          // 0x08C1 (size: 0x1)
    uint8 bPauseAnims;                                                                // 0x08C1 (size: 0x1)
    uint8 bUseRefPoseOnInitAnim;                                                      // 0x08C1 (size: 0x1)
    uint8 bEnablePerPolyCollision;                                                    // 0x08C2 (size: 0x1)
    uint8 bForceRefpose;                                                              // 0x08C2 (size: 0x1)
    uint8 bOnlyAllowAutonomousTickPose;                                               // 0x08C2 (size: 0x1)
    uint8 bIsAutonomousTickPose;                                                      // 0x08C2 (size: 0x1)
    uint8 bOldForceRefPose;                                                           // 0x08C2 (size: 0x1)
    uint8 bShowPrePhysBones;                                                          // 0x08C2 (size: 0x1)
    uint8 bRequiredBonesUpToDate;                                                     // 0x08C2 (size: 0x1)
    uint8 bAnimTreeInitialised;                                                       // 0x08C2 (size: 0x1)
    uint8 bIncludeComponentLocationIntoBounds;                                        // 0x08C3 (size: 0x1)
    uint8 bEnableLineCheckWithBounds;                                                 // 0x08C3 (size: 0x1)
    uint8 bPropagateCurvesToSlaves;                                                   // 0x08C3 (size: 0x1)
    uint8 bSkipKinematicUpdateWhenInterpolating;                                      // 0x08C3 (size: 0x1)
    uint8 bSkipBoundsUpdateWhenInterpolating;                                         // 0x08C3 (size: 0x1)
    uint8 bNeedsQueuedAnimEventsDispatched;                                           // 0x08C3 (size: 0x1)
    uint16 CachedAnimCurveUidVersion;                                                 // 0x08C6 (size: 0x2)
    float ClothBlendWeight;                                                           // 0x08C8 (size: 0x4)
    bool bWaitForParallelClothTask;                                                   // 0x08CC (size: 0x1)
    TArray<FName> DisallowedAnimCurves;                                               // 0x08D0 (size: 0x10)
    class UBodySetup* BodySetup;                                                      // 0x08E0 (size: 0x8)
    FSkeletalMeshComponentOnConstraintBroken OnConstraintBroken;                      // 0x08F0 (size: 0x10)
    void ConstraintBrokenSignature(int32 ConstraintIndex);
    TSubclassOf<class UClothingSimulationFactory> ClothingSimulationFactory;          // 0x0900 (size: 0x8)
    float TeleportDistanceThreshold;                                                  // 0x09D8 (size: 0x4)
    float TeleportRotationThreshold;                                                  // 0x09DC (size: 0x4)
    uint32 LastPoseTickFrame;                                                         // 0x09E8 (size: 0x4)
    class UClothingSimulationInteractor* ClothingInteractor;                          // 0x0A40 (size: 0x8)
    FSkeletalMeshComponentOnAnimInitialized OnAnimInitialized;                        // 0x0B10 (size: 0x10)
    void OnAnimInitialized();

    void UnlinkAnimClassLayers(TSubclassOf<class UAnimInstance> InClass);
    void UnbindClothFromMasterPoseComponent(bool bRestoreSimulationSpace);
    void ToggleDisablePostProcessBlueprint();
    void TermBodiesBelow(FName ParentBoneName);
    void SuspendClothingSimulation();
    void Stop();
    void SnapshotPose(FPoseSnapshot& Snapshot);
    void SetUpdateClothInEditor(const bool NewUpdateState);
    void SetUpdateAnimationInEditor(const bool NewUpdateState);
    void SetTeleportRotationThreshold(float Threshold);
    void SetTeleportDistanceThreshold(float Threshold);
    void SetPosition(float InPos, bool bFireNotifies);
    void SetPlayRate(float Rate);
    void SetPhysicsBlendWeight(float PhysicsBlendWeight);
    void SetNotifyRigidBodyCollisionBelow(bool bNewNotifyRigidBodyCollision, FName BoneName, bool bIncludeSelf);
    void SetMorphTarget(FName MorphTargetName, float Value, bool bRemoveZeroWeight);
    void SetEnablePhysicsBlending(bool bNewBlendPhysics);
    void SetEnableGravityOnAllBodiesBelow(bool bEnableGravity, FName BoneName, bool bIncludeSelf);
    void SetEnableBodyGravity(bool bEnableGravity, FName BoneName);
    void SetDisablePostProcessBlueprint(bool bInDisablePostProcess);
    void SetDisableAnimCurves(bool bInDisableAnimCurves);
    void SetConstraintProfileForAll(FName ProfileName, bool bDefaultIfNotFound);
    void SetConstraintProfile(FName JointName, FName ProfileName, bool bDefaultIfNotFound);
    void SetClothMaxDistanceScale(float Scale);
    void SetBodyNotifyRigidBodyCollision(bool bNewNotifyRigidBodyCollision, FName BoneName);
    void SetAnimClass(UClass* NewClass);
    void SetAnimationMode(TEnumAsByte<EAnimationMode::Type> InAnimationMode);
    void SetAnimation(class UAnimationAsset* NewAnimToPlay);
    void SetAngularLimits(FName InBoneName, float Swing1LimitAngle, float TwistLimitAngle, float Swing2LimitAngle);
    void SetAllowRigidBodyAnimNode(bool bInAllow, bool bReinitAnim);
    void SetAllowedAnimCurvesEvaluation(const TArray<FName>& List, bool bAllow);
    void SetAllowAnimCurveEvaluation(bool bInAllow);
    void SetAllMotorsAngularVelocityDrive(bool bEnableSwingDrive, bool bEnableTwistDrive, bool bSkipCustomPhysicsType);
    void SetAllMotorsAngularPositionDrive(bool bEnableSwingDrive, bool bEnableTwistDrive, bool bSkipCustomPhysicsType);
    void SetAllMotorsAngularDriveParams(float InSpring, float InDamping, float InForceLimit, bool bSkipCustomPhysicsType);
    void SetAllBodiesSimulatePhysics(bool bNewSimulate);
    void SetAllBodiesPhysicsBlendWeight(float PhysicsBlendWeight, bool bSkipCustomPhysicsType);
    void SetAllBodiesBelowSimulatePhysics(const FName& InBoneName, bool bNewSimulate, bool bIncludeSelf);
    void SetAllBodiesBelowPhysicsBlendWeight(const FName& InBoneName, float PhysicsBlendWeight, bool bSkipCustomPhysicsType, bool bIncludeSelf);
    void ResumeClothingSimulation();
    void ResetClothTeleportMode();
    void ResetAnimInstanceDynamics(ETeleportType InTeleportType);
    void ResetAllowedAnimCurveEvaluation();
    void ResetAllBodiesSimulatePhysics();
    void PlayAnimation(class UAnimationAsset* NewAnimToPlay, bool bLooping);
    void Play(bool bLooping);
    void OverrideAnimationData(class UAnimationAsset* InAnimToPlay, bool bIsLooping, bool bIsPlaying, float Position, float PlayRate);
    void LinkAnimGraphByTag(FName InTag, TSubclassOf<class UAnimInstance> InClass);
    void LinkAnimClassLayers(TSubclassOf<class UAnimInstance> InClass);
    bool K2_GetClosestPointOnPhysicsAsset(const FVector& WorldPosition, FVector& ClosestWorldPosition, FVector& Normal, FName& BoneName, float& Distance);
    bool IsPlaying();
    bool IsClothingSimulationSuspended();
    bool IsBodyGravityEnabled(FName BoneName);
    bool HasValidAnimationInstance();
    float GetTeleportRotationThreshold();
    float GetTeleportDistanceThreshold();
    bool GetStringAttribute_Ref(const FName& BoneName, const FName& AttributeName, FString& OutValue, ECustomBoneAttributeLookup LookupType);
    bool GetStringAttribute(const FName& BoneName, const FName& AttributeName, FString DefaultValue, FString& OutValue, ECustomBoneAttributeLookup LookupType);
    FVector GetSkeletalCenterOfMass();
    class UAnimInstance* GetPostProcessInstance();
    float GetPosition();
    float GetPlayRate();
    float GetMorphTarget(FName MorphTargetName);
    class UAnimInstance* GetLinkedAnimLayerInstanceByGroup(FName InGroup);
    class UAnimInstance* GetLinkedAnimLayerInstanceByClass(TSubclassOf<class UAnimInstance> InClass);
    void GetLinkedAnimGraphInstancesByTag(FName InTag, TArray<class UAnimInstance*>& OutLinkedInstances);
    class UAnimInstance* GetLinkedAnimGraphInstanceByTag(FName InTag);
    bool GetIntegerAttribute_Ref(const FName& BoneName, const FName& AttributeName, int32& OutValue, ECustomBoneAttributeLookup LookupType);
    bool GetIntegerAttribute(const FName& BoneName, const FName& AttributeName, int32 DefaultValue, int32& OutValue, ECustomBoneAttributeLookup LookupType);
    bool GetFloatAttribute_Ref(const FName& BoneName, const FName& AttributeName, float& OutValue, ECustomBoneAttributeLookup LookupType);
    bool GetFloatAttribute(const FName& BoneName, const FName& AttributeName, float DefaultValue, float& OutValue, ECustomBoneAttributeLookup LookupType);
    bool GetDisablePostProcessBlueprint();
    bool GetDisableAnimCurves();
    void GetCurrentJointAngles(FName InBoneName, float& Swing1Angle, float& TwistAngle, float& Swing2Angle);
    float GetClothMaxDistanceScale();
    class UClothingSimulationInteractor* GetClothingSimulationInteractor();
    float GetBoneMass(FName BoneName, bool bScaleMass);
    class UAnimInstance* GetAnimInstance();
    UClass* GetAnimClass();
    TEnumAsByte<EAnimationMode::Type> GetAnimationMode();
    bool GetAllowRigidBodyAnimNode();
    bool GetAllowedAnimCurveEvaluate();
    void ForceClothNextUpdateTeleportAndReset();
    void ForceClothNextUpdateTeleport();
    FName FindConstraintBoneName(int32 ConstraintIndex);
    void ClearMorphTargets();
    void BreakConstraint(FVector Impulse, FVector HitLocation, FName InBoneName);
    void BindClothToMasterPoseComponent();
    void AllowAnimCurveEvaluation(FName NameOfCurve, bool bAllow);
    void AddImpulseToAllBodiesBelow(FVector Impulse, FName BoneName, bool bVelChange, bool bIncludeSelf);
    void AddForceToAllBodiesBelow(FVector Force, FName BoneName, bool bAccelChange, bool bIncludeSelf);
    void AccumulateAllBodiesBelowPhysicsBlendWeight(const FName& InBoneName, float AddPhysicsBlendWeight, bool bSkipCustomPhysicsType);
}; // Size: 0xED0

struct FAnimNotifyEventReference
{
    class UObject* NotifySource;                                                      // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FAnimNotifyArray
{
    TArray<FAnimNotifyEventReference> Notifies;                                       // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FAnimNotifyQueue
{
    TArray<FAnimNotifyEventReference> AnimNotifies;                                   // 0x0010 (size: 0x10)
    TMap<class FName, class FAnimNotifyArray> UnfilteredMontageAnimNotifies;          // 0x0020 (size: 0x50)

}; // Size: 0x70

struct FAnimLinkableElement
{
    class UAnimMontage* LinkedMontage;                                                // 0x0008 (size: 0x8)
    int32 SlotIndex;                                                                  // 0x0010 (size: 0x4)
    int32 SegmentIndex;                                                               // 0x0014 (size: 0x4)
    TEnumAsByte<EAnimLinkMethod::Type> LinkMethod;                                    // 0x0018 (size: 0x1)
    TEnumAsByte<EAnimLinkMethod::Type> CachedLinkMethod;                              // 0x0019 (size: 0x1)
    float SegmentBeginTime;                                                           // 0x001C (size: 0x4)
    float SegmentLength;                                                              // 0x0020 (size: 0x4)
    float LinkValue;                                                                  // 0x0024 (size: 0x4)
    class UAnimSequenceBase* LinkedSequence;                                          // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FAnimNotifyEvent : public FAnimLinkableElement
{
    float DisplayTime;                                                                // 0x0030 (size: 0x4)
    float TriggerTimeOffset;                                                          // 0x0034 (size: 0x4)
    float EndTriggerTimeOffset;                                                       // 0x0038 (size: 0x4)
    float TriggerWeightThreshold;                                                     // 0x003C (size: 0x4)
    FName NotifyName;                                                                 // 0x0040 (size: 0x8)
    class UAnimNotify* Notify;                                                        // 0x0048 (size: 0x8)
    class UAnimNotifyState* NotifyStateClass;                                         // 0x0050 (size: 0x8)
    float Duration;                                                                   // 0x0058 (size: 0x4)
    FAnimLinkableElement EndLink;                                                     // 0x0060 (size: 0x30)
    bool bConvertedFromBranchingPoint;                                                // 0x0090 (size: 0x1)
    TEnumAsByte<EMontageNotifyTickType::Type> MontageTickType;                        // 0x0091 (size: 0x1)
    float NotifyTriggerChance;                                                        // 0x0094 (size: 0x4)
    TEnumAsByte<ENotifyFilterType::Type> NotifyFilterType;                            // 0x0098 (size: 0x1)
    int32 NotifyFilterLOD;                                                            // 0x009C (size: 0x4)
    bool bTriggerOnDedicatedServer;                                                   // 0x00A0 (size: 0x1)
    bool bTriggerOnFollower;                                                          // 0x00A1 (size: 0x1)
    int32 TrackIndex;                                                                 // 0x00A4 (size: 0x4)

}; // Size: 0xB8

struct FMarkerSyncAnimPosition
{
    FName PreviousMarkerName;                                                         // 0x0000 (size: 0x8)
    FName NextMarkerName;                                                             // 0x0008 (size: 0x8)
    float PositionBetweenMarkers;                                                     // 0x0010 (size: 0x4)

}; // Size: 0x14

class UAnimInstance : public UObject
{
    class USkeleton* CurrentSkeleton;                                                 // 0x0028 (size: 0x8)
    TEnumAsByte<ERootMotionMode::Type> RootMotionMode;                                // 0x0030 (size: 0x1)
    uint8 bUseMultiThreadedAnimationUpdate;                                           // 0x0031 (size: 0x1)
    uint8 bUsingCopyPoseFromMesh;                                                     // 0x0031 (size: 0x1)
    uint8 bReceiveNotifiesFromLinkedInstances;                                        // 0x0031 (size: 0x1)
    uint8 bPropagateNotifiesToLinkedInstances;                                        // 0x0031 (size: 0x1)
    uint8 bQueueMontageEvents;                                                        // 0x0031 (size: 0x1)
    FAnimInstanceOnMontageBlendingOut OnMontageBlendingOut;                           // 0x0038 (size: 0x10)
    void OnMontageBlendingOutStartedMCDelegate(class UAnimMontage* Montage, bool bInterrupted);
    FAnimInstanceOnMontageStarted OnMontageStarted;                                   // 0x0048 (size: 0x10)
    void OnMontageStartedMCDelegate(class UAnimMontage* Montage);
    FAnimInstanceOnMontageEnded OnMontageEnded;                                       // 0x0058 (size: 0x10)
    void OnMontageEndedMCDelegate(class UAnimMontage* Montage, bool bInterrupted);
    FAnimInstanceOnAllMontageInstancesEnded OnAllMontageInstancesEnded;               // 0x0068 (size: 0x10)
    void OnAllMontageInstancesEndedMCDelegate();
    FAnimNotifyQueue NotifyQueue;                                                     // 0x0100 (size: 0x70)
    TArray<FAnimNotifyEvent> ActiveAnimNotifyState;                                   // 0x0170 (size: 0x10)

    void UnlockAIResources(bool bUnlockMovement, bool UnlockAILogic);
    void UnlinkAnimClassLayers(TSubclassOf<class UAnimInstance> InClass);
    class APawn* TryGetPawnOwner();
    void StopSlotAnimation(float InBlendOutTime, FName SlotNodeName);
    void SnapshotPose(FPoseSnapshot& Snapshot);
    void SetRootMotionMode(TEnumAsByte<ERootMotionMode::Type> Value);
    void SetReceiveNotifiesFromLinkedInstances(bool bSet);
    void SetPropagateNotifiesToLinkedInstances(bool bSet);
    void SetMorphTarget(FName MorphTargetName, float Value);
    void SavePoseSnapshot(FName SnapshotName);
    void ResetDynamics(ETeleportType InTeleportType);
    class UAnimMontage* PlaySlotAnimationAsDynamicMontage(class UAnimSequenceBase* Asset, FName SlotNodeName, float blendInTime, float blendOutTime, float InPlayRate, int32 LoopCount, float BlendOutTriggerTime, float InTimeToStartMontageAt);
    float PlaySlotAnimation(class UAnimSequenceBase* Asset, FName SlotNodeName, float blendInTime, float blendOutTime, float InPlayRate, int32 LoopCount);
    void Montage_StopGroupByName(float InBlendOutTime, FName GroupName);
    void Montage_Stop(float InBlendOutTime, const class UAnimMontage* Montage);
    void Montage_SetPosition(const class UAnimMontage* Montage, float newPosition);
    void Montage_SetPlayRate(const class UAnimMontage* Montage, float NewPlayRate);
    void Montage_SetNextSection(FName SectionNameToChange, FName NextSection, const class UAnimMontage* Montage);
    void Montage_Resume(const class UAnimMontage* Montage);
    float Montage_Play(class UAnimMontage* MontageToPlay, float InPlayRate, EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages);
    void Montage_Pause(const class UAnimMontage* Montage);
    void Montage_JumpToSectionsEnd(FName SectionName, const class UAnimMontage* Montage);
    void Montage_JumpToSection(FName SectionName, const class UAnimMontage* Montage);
    bool Montage_IsPlaying(const class UAnimMontage* Montage);
    bool Montage_IsActive(const class UAnimMontage* Montage);
    float Montage_GetPosition(const class UAnimMontage* Montage);
    float Montage_GetPlayRate(const class UAnimMontage* Montage);
    bool Montage_GetIsStopped(const class UAnimMontage* Montage);
    FName Montage_GetCurrentSection(const class UAnimMontage* Montage);
    float Montage_GetBlendTime(const class UAnimMontage* Montage);
    void LockAIResources(bool bLockMovement, bool LockAILogic);
    void LinkAnimGraphByTag(FName InTag, TSubclassOf<class UAnimInstance> InClass);
    void LinkAnimClassLayers(TSubclassOf<class UAnimInstance> InClass);
    bool IsSyncGroupBetweenMarkers(FName InSyncGroupName, FName PreviousMarker, FName NextMarker, bool bRespectMarkerOrder);
    bool IsPlayingSlotAnimation(const class UAnimSequenceBase* Asset, FName SlotNodeName);
    bool IsAnyMontagePlaying();
    bool HasMarkerBeenHitThisFrame(FName SyncGroup, FName MarkerName);
    bool GetTimeToClosestMarker(FName SyncGroup, FName MarkerName, float& OutMarkerTime);
    FMarkerSyncAnimPosition GetSyncGroupPosition(FName InSyncGroupName);
    float GetRelevantAnimTimeRemainingFraction(int32 MachineIndex, int32 StateIndex);
    float GetRelevantAnimTimeRemaining(int32 MachineIndex, int32 StateIndex);
    float GetRelevantAnimTimeFraction(int32 MachineIndex, int32 StateIndex);
    float GetRelevantAnimTime(int32 MachineIndex, int32 StateIndex);
    float GetRelevantAnimLength(int32 MachineIndex, int32 StateIndex);
    bool GetReceiveNotifiesFromLinkedInstances();
    bool GetPropagateNotifiesToLinkedInstances();
    class USkeletalMeshComponent* GetOwningComponent();
    class AActor* GetOwningActor();
    void GetLinkedAnimLayerInstancesByGroup(FName InGroup, TArray<class UAnimInstance*>& OutLinkedInstances);
    class UAnimInstance* GetLinkedAnimLayerInstanceByGroupAndClass(FName InGroup, TSubclassOf<class UAnimInstance> InClass);
    class UAnimInstance* GetLinkedAnimLayerInstanceByGroup(FName InGroup);
    class UAnimInstance* GetLinkedAnimLayerInstanceByClass(TSubclassOf<class UAnimInstance> InClass);
    void GetLinkedAnimGraphInstancesByTag(FName InTag, TArray<class UAnimInstance*>& OutLinkedInstances);
    class UAnimInstance* GetLinkedAnimGraphInstanceByTag(FName InTag);
    float GetInstanceTransitionTimeElapsedFraction(int32 MachineIndex, int32 TransitionIndex);
    float GetInstanceTransitionTimeElapsed(int32 MachineIndex, int32 TransitionIndex);
    float GetInstanceTransitionCrossfadeDuration(int32 MachineIndex, int32 TransitionIndex);
    float GetInstanceStateWeight(int32 MachineIndex, int32 StateIndex);
    float GetInstanceMachineWeight(int32 MachineIndex);
    float GetInstanceCurrentStateElapsedTime(int32 MachineIndex);
    float GetInstanceAssetPlayerTimeFromEndFraction(int32 AssetPlayerIndex);
    float GetInstanceAssetPlayerTimeFromEnd(int32 AssetPlayerIndex);
    float GetInstanceAssetPlayerTimeFraction(int32 AssetPlayerIndex);
    float GetInstanceAssetPlayerTime(int32 AssetPlayerIndex);
    float GetInstanceAssetPlayerLength(int32 AssetPlayerIndex);
    float GetCurveValue(FName CurveName);
    FName GetCurrentStateName(int32 MachineIndex);
    class UAnimMontage* GetCurrentActiveMontage();
    void GetAllCurveNames(TArray<FName>& OutNames);
    void GetActiveCurveNames(EAnimCurveType CurveType, TArray<FName>& OutNames);
    void ClearMorphTargets();
    float CalculateDirection(const FVector& Velocity, const FRotator& BaseRotation);
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void BlueprintPostEvaluateAnimation();
    void BlueprintLinkedAnimationLayersInitialized();
    void BlueprintInitializeAnimation();
    void BlueprintBeginPlay();
}; // Size: 0x2C0

struct FStaticMeshComponentLODInfo
{
}; // Size: 0x90

struct FStreamingTextureBuildInfo
{
    uint32 PackedRelativeBox;                                                         // 0x0000 (size: 0x4)
    int32 TextureLevelIndex;                                                          // 0x0004 (size: 0x4)
    float TexelFactor;                                                                // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FLightmassPrimitiveSettings
{
    uint8 bUseTwoSidedLighting;                                                       // 0x0000 (size: 0x1)
    uint8 bShadowIndirectOnly;                                                        // 0x0000 (size: 0x1)
    uint8 bUseEmissiveForStaticLighting;                                              // 0x0000 (size: 0x1)
    uint8 bUseVertexNormalForHemisphereGather;                                        // 0x0000 (size: 0x1)
    float EmissiveLightFalloffExponent;                                               // 0x0004 (size: 0x4)
    float EmissiveLightExplicitInfluenceRadius;                                       // 0x0008 (size: 0x4)
    float EmissiveBoost;                                                              // 0x000C (size: 0x4)
    float DiffuseBoost;                                                               // 0x0010 (size: 0x4)
    float FullyOccludedSamplesFraction;                                               // 0x0014 (size: 0x4)

}; // Size: 0x18

class UStaticMeshComponent : public UMeshComponent
{
    int32 ForcedLodModel;                                                             // 0x0478 (size: 0x4)
    int32 PreviousLODLevel;                                                           // 0x047C (size: 0x4)
    int32 MinLOD;                                                                     // 0x0480 (size: 0x4)
    int32 SubDivisionStepSize;                                                        // 0x0484 (size: 0x4)
    class UStaticMesh* StaticMesh;                                                    // 0x0488 (size: 0x8)
    FColor WireframeColorOverride;                                                    // 0x0490 (size: 0x4)
    uint8 bEvaluateWorldPositionOffset;                                               // 0x0494 (size: 0x1)
    uint8 bOverrideWireframeColor;                                                    // 0x0494 (size: 0x1)
    uint8 bOverrideMinLod;                                                            // 0x0494 (size: 0x1)
    uint8 bOverrideNavigationExport;                                                  // 0x0494 (size: 0x1)
    uint8 bForceNavigationObstacle;                                                   // 0x0494 (size: 0x1)
    uint8 bDisallowMeshPaintPerInstance;                                              // 0x0494 (size: 0x1)
    uint8 bIgnoreInstanceForTextureStreaming;                                         // 0x0494 (size: 0x1)
    uint8 bOverrideLightMapRes;                                                       // 0x0494 (size: 0x1)
    uint8 bCastDistanceFieldIndirectShadow;                                           // 0x0495 (size: 0x1)
    uint8 bOverrideDistanceFieldSelfShadowBias;                                       // 0x0495 (size: 0x1)
    uint8 bUseSubDivisions;                                                           // 0x0495 (size: 0x1)
    uint8 bUseDefaultCollision;                                                       // 0x0495 (size: 0x1)
    uint8 bReverseCulling;                                                            // 0x0495 (size: 0x1)
    int32 OverriddenLightMapRes;                                                      // 0x0498 (size: 0x4)
    float DistanceFieldIndirectShadowMinVisibility;                                   // 0x049C (size: 0x4)
    float DistanceFieldSelfShadowBias;                                                // 0x04A0 (size: 0x4)
    float StreamingDistanceMultiplier;                                                // 0x04A4 (size: 0x4)
    TArray<FStaticMeshComponentLODInfo> LODData;                                      // 0x04A8 (size: 0x10)
    TArray<FStreamingTextureBuildInfo> StreamingTextureData;                          // 0x04B8 (size: 0x10)
    FLightmassPrimitiveSettings LightmassSettings;                                    // 0x04C8 (size: 0x18)

    bool SetStaticMesh(class UStaticMesh* NewMesh);
    void SetReverseCulling(bool ReverseCulling);
    void SetForcedLodModel(int32 NewForcedLodModel);
    void SetEvaluateWorldPositionOffsetInRayTracing(bool newValue);
    void SetDistanceFieldSelfShadowBias(float newValue);
    void OnRep_StaticMesh(class UStaticMesh* OldStaticMesh);
    void GetLocalBounds(FVector& Min, FVector& Max);
}; // Size: 0x4E0

struct FSplineCurves
{
    FInterpCurveVector Position;                                                      // 0x0000 (size: 0x18)
    FInterpCurveQuat Rotation;                                                        // 0x0018 (size: 0x18)
    FInterpCurveVector Scale;                                                         // 0x0030 (size: 0x18)
    FInterpCurveFloat ReparamTable;                                                   // 0x0048 (size: 0x18)
    class USplineMetadata* MetaData;                                                  // 0x0060 (size: 0x8)
    uint32 Version;                                                                   // 0x0068 (size: 0x4)

}; // Size: 0x70

struct FSplinePoint
{
    float InputKey;                                                                   // 0x0000 (size: 0x4)
    FVector Position;                                                                 // 0x0004 (size: 0xC)
    FVector ArriveTangent;                                                            // 0x0010 (size: 0xC)
    FVector LeaveTangent;                                                             // 0x001C (size: 0xC)
    FRotator Rotation;                                                                // 0x0028 (size: 0xC)
    FVector Scale;                                                                    // 0x0034 (size: 0xC)
    TEnumAsByte<ESplinePointType::Type> Type;                                         // 0x0040 (size: 0x1)

}; // Size: 0x44

class USplineComponent : public UPrimitiveComponent
{
    FSplineCurves SplineCurves;                                                       // 0x0450 (size: 0x70)
    FInterpCurveVector SplineInfo;                                                    // 0x04C0 (size: 0x18)
    FInterpCurveQuat SplineRotInfo;                                                   // 0x04D8 (size: 0x18)
    FInterpCurveVector SplineScaleInfo;                                               // 0x04F0 (size: 0x18)
    FInterpCurveFloat SplineReparamTable;                                             // 0x0508 (size: 0x18)
    bool bAllowSplineEditingPerInstance;                                              // 0x0520 (size: 0x1)
    int32 ReparamStepsPerSegment;                                                     // 0x0524 (size: 0x4)
    float Duration;                                                                   // 0x0528 (size: 0x4)
    bool bStationaryEndpoints;                                                        // 0x052C (size: 0x1)
    bool bSplineHasBeenEdited;                                                        // 0x052D (size: 0x1)
    bool bModifiedByConstructionScript;                                               // 0x052E (size: 0x1)
    bool bInputSplinePointsToConstructionScript;                                      // 0x052F (size: 0x1)
    bool bDrawDebug;                                                                  // 0x0530 (size: 0x1)
    bool bClosedLoop;                                                                 // 0x0531 (size: 0x1)
    bool bLoopPositionOverride;                                                       // 0x0532 (size: 0x1)
    float LoopPosition;                                                               // 0x0534 (size: 0x4)
    FVector DefaultUpVector;                                                          // 0x0538 (size: 0xC)

    void UpdateSpline();
    void SetWorldLocationAtSplinePoint(int32 PointIndex, const FVector& InLocation);
    void SetUpVectorAtSplinePoint(int32 PointIndex, const FVector& InUpVector, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace, bool bUpdateSpline);
    void SetUnselectedSplineSegmentColor(const FLinearColor& SegmentColor);
    void SetTangentsAtSplinePoint(int32 PointIndex, const FVector& InArriveTangent, const FVector& InLeaveTangent, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace, bool bUpdateSpline);
    void SetTangentColor(const FLinearColor& TangentColor);
    void SetTangentAtSplinePoint(int32 PointIndex, const FVector& InTangent, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace, bool bUpdateSpline);
    void SetSplineWorldPoints(const TArray<FVector>& Points);
    void SetSplinePointType(int32 PointIndex, TEnumAsByte<ESplinePointType::Type> Type, bool bUpdateSpline);
    void SetSplinePoints(const TArray<FVector>& Points, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace, bool bUpdateSpline);
    void SetSplineLocalPoints(const TArray<FVector>& Points);
    void SetSelectedSplineSegmentColor(const FLinearColor& SegmentColor);
    void SetScaleAtSplinePoint(int32 PointIndex, const FVector& InScaleVector, bool bUpdateSpline);
    void SetRotationAtSplinePoint(int32 PointIndex, const FRotator& InRotation, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace, bool bUpdateSpline);
    void SetLocationAtSplinePoint(int32 PointIndex, const FVector& InLocation, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace, bool bUpdateSpline);
    void SetDrawDebug(bool bShow);
    void SetDefaultUpVector(const FVector& UpVector, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    void SetClosedLoopAtPosition(bool bInClosedLoop, float Key, bool bUpdateSpline);
    void SetClosedLoop(bool bInClosedLoop, bool bUpdateSpline);
    void RemoveSplinePoint(int32 Index, bool bUpdateSpline);
    bool IsClosedLoop();
    FVector GetWorldTangentAtDistanceAlongSpline(float Distance);
    FRotator GetWorldRotationAtTime(float Time, bool bUseConstantVelocity);
    FRotator GetWorldRotationAtDistanceAlongSpline(float Distance);
    FVector GetWorldLocationAtTime(float Time, bool bUseConstantVelocity);
    FVector GetWorldLocationAtSplinePoint(int32 PointIndex);
    FVector GetWorldLocationAtDistanceAlongSpline(float Distance);
    FVector GetWorldDirectionAtTime(float Time, bool bUseConstantVelocity);
    FVector GetWorldDirectionAtDistanceAlongSpline(float Distance);
    FVector GetVectorPropertyAtSplinePoint(int32 Index, FName PropertyName);
    FVector GetVectorPropertyAtSplineInputKey(float InKey, FName PropertyName);
    FVector GetUpVectorAtTime(float Time, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace, bool bUseConstantVelocity);
    FVector GetUpVectorAtSplinePoint(int32 PointIndex, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    FVector GetUpVectorAtSplineInputKey(float InKey, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    FVector GetUpVectorAtDistanceAlongSpline(float Distance, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    FTransform GetTransformAtTime(float Time, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace, bool bUseConstantVelocity, bool bUseScale);
    FTransform GetTransformAtSplinePoint(int32 PointIndex, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace, bool bUseScale);
    FTransform GetTransformAtSplineInputKey(float InKey, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace, bool bUseScale);
    FTransform GetTransformAtDistanceAlongSpline(float Distance, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace, bool bUseScale);
    FVector GetTangentAtTime(float Time, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace, bool bUseConstantVelocity);
    FVector GetTangentAtSplinePoint(int32 PointIndex, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    FVector GetTangentAtSplineInputKey(float InKey, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    FVector GetTangentAtDistanceAlongSpline(float Distance, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    TEnumAsByte<ESplinePointType::Type> GetSplinePointType(int32 PointIndex);
    float GetSplineLength();
    FVector GetScaleAtTime(float Time, bool bUseConstantVelocity);
    FVector GetScaleAtSplinePoint(int32 PointIndex);
    FVector GetScaleAtSplineInputKey(float InKey);
    FVector GetScaleAtDistanceAlongSpline(float Distance);
    FRotator GetRotationAtTime(float Time, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace, bool bUseConstantVelocity);
    FRotator GetRotationAtSplinePoint(int32 PointIndex, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    FRotator GetRotationAtSplineInputKey(float InKey, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    FRotator GetRotationAtDistanceAlongSpline(float Distance, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    float GetRollAtTime(float Time, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace, bool bUseConstantVelocity);
    float GetRollAtSplinePoint(int32 PointIndex, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    float GetRollAtSplineInputKey(float InKey, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    float GetRollAtDistanceAlongSpline(float Distance, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    FVector GetRightVectorAtTime(float Time, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace, bool bUseConstantVelocity);
    FVector GetRightVectorAtSplinePoint(int32 PointIndex, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    FVector GetRightVectorAtSplineInputKey(float InKey, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    FVector GetRightVectorAtDistanceAlongSpline(float Distance, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    int32 GetNumberOfSplineSegments();
    int32 GetNumberOfSplinePoints();
    FVector GetLocationAtTime(float Time, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace, bool bUseConstantVelocity);
    FVector GetLocationAtSplinePoint(int32 PointIndex, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    FVector GetLocationAtSplineInputKey(float InKey, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    FVector GetLocationAtDistanceAlongSpline(float Distance, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    void GetLocationAndTangentAtSplinePoint(int32 PointIndex, FVector& Location, FVector& Tangent, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    void GetLocalLocationAndTangentAtSplinePoint(int32 PointIndex, FVector& LocalLocation, FVector& LocalTangent);
    FVector GetLeaveTangentAtSplinePoint(int32 PointIndex, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    float GetInputKeyAtDistanceAlongSpline(float Distance);
    float GetFloatPropertyAtSplinePoint(int32 Index, FName PropertyName);
    float GetFloatPropertyAtSplineInputKey(float InKey, FName PropertyName);
    float GetDistanceAlongSplineAtSplinePoint(int32 PointIndex);
    float GetDistanceAlongSplineAtSplineInputKey(float InKey);
    FVector GetDirectionAtTime(float Time, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace, bool bUseConstantVelocity);
    FVector GetDirectionAtSplinePoint(int32 PointIndex, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    FVector GetDirectionAtSplineInputKey(float InKey, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    FVector GetDirectionAtDistanceAlongSpline(float Distance, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    FVector GetDefaultUpVector(TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    FVector GetArriveTangentAtSplinePoint(int32 PointIndex, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    FVector FindUpVectorClosestToWorldLocation(const FVector& WorldLocation, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    FTransform FindTransformClosestToWorldLocation(const FVector& WorldLocation, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace, bool bUseScale);
    FVector FindTangentClosestToWorldLocation(const FVector& WorldLocation, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    FVector FindScaleClosestToWorldLocation(const FVector& WorldLocation);
    FRotator FindRotationClosestToWorldLocation(const FVector& WorldLocation, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    float FindRollClosestToWorldLocation(const FVector& WorldLocation, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    FVector FindRightVectorClosestToWorldLocation(const FVector& WorldLocation, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    FVector FindLocationClosestToWorldLocation(const FVector& WorldLocation, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    float FindInputKeyClosestToWorldLocation(const FVector& WorldLocation);
    FVector FindDirectionClosestToWorldLocation(const FVector& WorldLocation, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace);
    void ClearSplinePoints(bool bUpdateSpline);
    void AddSplineWorldPoint(const FVector& Position);
    void AddSplinePointAtIndex(const FVector& Position, int32 Index, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace, bool bUpdateSpline);
    void AddSplinePoint(const FVector& Position, TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace, bool bUpdateSpline);
    void AddSplineLocalPoint(const FVector& Position);
    void AddPoints(const TArray<FSplinePoint>& Points, bool bUpdateSpline);
    void AddPoint(const FSplinePoint& Point, bool bUpdateSpline);
}; // Size: 0x550

struct FSplineMeshParams
{
    FVector StartPos;                                                                 // 0x0000 (size: 0xC)
    FVector StartTangent;                                                             // 0x000C (size: 0xC)
    FVector2D StartScale;                                                             // 0x0018 (size: 0x8)
    float StartRoll;                                                                  // 0x0020 (size: 0x4)
    FVector2D StartOffset;                                                            // 0x0024 (size: 0x8)
    FVector EndPos;                                                                   // 0x002C (size: 0xC)
    FVector2D EndScale;                                                               // 0x0038 (size: 0x8)
    FVector EndTangent;                                                               // 0x0040 (size: 0xC)
    float EndRoll;                                                                    // 0x004C (size: 0x4)
    FVector2D EndOffset;                                                              // 0x0050 (size: 0x8)

}; // Size: 0x58

class USplineMeshComponent : public UStaticMeshComponent
{
    FSplineMeshParams SplineParams;                                                   // 0x04E8 (size: 0x58)
    FVector SplineUpDir;                                                              // 0x0540 (size: 0xC)
    float SplineBoundaryMin;                                                          // 0x054C (size: 0x4)
    FGuid CachedMeshBodySetupGuid;                                                    // 0x0550 (size: 0x10)
    class UBodySetup* BodySetup;                                                      // 0x0560 (size: 0x8)
    float SplineBoundaryMax;                                                          // 0x0568 (size: 0x4)
    uint8 bAllowSplineEditingPerInstance;                                             // 0x056C (size: 0x1)
    uint8 bSmoothInterpRollScale;                                                     // 0x056C (size: 0x1)
    uint8 bMeshDirty;                                                                 // 0x056C (size: 0x1)
    TEnumAsByte<ESplineMeshAxis::Type> ForwardAxis;                                   // 0x056D (size: 0x1)
    float VirtualTextureMainPassMaxDrawDistance;                                      // 0x0570 (size: 0x4)

    void UpdateMesh();
    void SetStartTangent(FVector StartTangent, bool bUpdateMesh);
    void SetStartScale(FVector2D StartScale, bool bUpdateMesh);
    void SetStartRoll(float StartRoll, bool bUpdateMesh);
    void SetStartPosition(FVector StartPos, bool bUpdateMesh);
    void SetStartOffset(FVector2D StartOffset, bool bUpdateMesh);
    void SetStartAndEnd(FVector StartPos, FVector StartTangent, FVector EndPos, FVector EndTangent, bool bUpdateMesh);
    void SetSplineUpDir(const FVector& InSplineUpDir, bool bUpdateMesh);
    void SetForwardAxis(TEnumAsByte<ESplineMeshAxis::Type> InForwardAxis, bool bUpdateMesh);
    void SetEndTangent(FVector EndTangent, bool bUpdateMesh);
    void SetEndScale(FVector2D EndScale, bool bUpdateMesh);
    void SetEndRoll(float EndRoll, bool bUpdateMesh);
    void SetEndPosition(FVector EndPos, bool bUpdateMesh);
    void SetEndOffset(FVector2D EndOffset, bool bUpdateMesh);
    void SetBoundaryMin(float InBoundaryMin, bool bUpdateMesh);
    void SetBoundaryMax(float InBoundaryMax, bool bUpdateMesh);
    FVector GetStartTangent();
    FVector2D GetStartScale();
    float GetStartRoll();
    FVector GetStartPosition();
    FVector2D GetStartOffset();
    FVector GetSplineUpDir();
    TEnumAsByte<ESplineMeshAxis::Type> GetForwardAxis();
    FVector GetEndTangent();
    FVector2D GetEndScale();
    float GetEndRoll();
    FVector GetEndPosition();
    FVector2D GetEndOffset();
    float GetBoundaryMin();
    float GetBoundaryMax();
}; // Size: 0x580

class UCameraShakeBase : public UObject
{
    bool bSingleInstance;                                                             // 0x0028 (size: 0x1)
    float ShakeScale;                                                                 // 0x002C (size: 0x4)
    class UCameraShakePattern* RootShakePattern;                                      // 0x0030 (size: 0x8)
    class APlayerCameraManager* CameraManager;                                        // 0x0038 (size: 0x8)

    void SetRootShakePattern(class UCameraShakePattern* InPattern);
    class UCameraShakePattern* GetRootShakePattern();
}; // Size: 0xB0

class UCameraShakePattern : public UObject
{
}; // Size: 0x28

struct FWeightedBlendable
{
    float Weight;                                                                     // 0x0000 (size: 0x4)
    class UObject* Object;                                                            // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FWeightedBlendables
{
    TArray<FWeightedBlendable> Array;                                                 // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPostProcessSettings
{
    uint8 bOverride_TemperatureType;                                                  // 0x0000 (size: 0x1)
    uint8 bOverride_WhiteTemp;                                                        // 0x0000 (size: 0x1)
    uint8 bOverride_WhiteTint;                                                        // 0x0000 (size: 0x1)
    uint8 bOverride_ColorSaturation;                                                  // 0x0000 (size: 0x1)
    uint8 bOverride_ColorContrast;                                                    // 0x0000 (size: 0x1)
    uint8 bOverride_ColorGamma;                                                       // 0x0000 (size: 0x1)
    uint8 bOverride_ColorGain;                                                        // 0x0000 (size: 0x1)
    uint8 bOverride_ColorOffset;                                                      // 0x0000 (size: 0x1)
    uint8 bOverride_ColorSaturationShadows;                                           // 0x0001 (size: 0x1)
    uint8 bOverride_ColorContrastShadows;                                             // 0x0001 (size: 0x1)
    uint8 bOverride_ColorGammaShadows;                                                // 0x0001 (size: 0x1)
    uint8 bOverride_ColorGainShadows;                                                 // 0x0001 (size: 0x1)
    uint8 bOverride_ColorOffsetShadows;                                               // 0x0001 (size: 0x1)
    uint8 bOverride_ColorSaturationMidtones;                                          // 0x0001 (size: 0x1)
    uint8 bOverride_ColorContrastMidtones;                                            // 0x0001 (size: 0x1)
    uint8 bOverride_ColorGammaMidtones;                                               // 0x0001 (size: 0x1)
    uint8 bOverride_ColorGainMidtones;                                                // 0x0002 (size: 0x1)
    uint8 bOverride_ColorOffsetMidtones;                                              // 0x0002 (size: 0x1)
    uint8 bOverride_ColorSaturationHighlights;                                        // 0x0002 (size: 0x1)
    uint8 bOverride_ColorContrastHighlights;                                          // 0x0002 (size: 0x1)
    uint8 bOverride_ColorGammaHighlights;                                             // 0x0002 (size: 0x1)
    uint8 bOverride_ColorGainHighlights;                                              // 0x0002 (size: 0x1)
    uint8 bOverride_ColorOffsetHighlights;                                            // 0x0002 (size: 0x1)
    uint8 bOverride_ColorCorrectionShadowsMax;                                        // 0x0002 (size: 0x1)
    uint8 bOverride_ColorCorrectionHighlightsMin;                                     // 0x0003 (size: 0x1)
    uint8 bOverride_BlueCorrection;                                                   // 0x0003 (size: 0x1)
    uint8 bOverride_ExpandGamut;                                                      // 0x0003 (size: 0x1)
    uint8 bOverride_ToneCurveAmount;                                                  // 0x0003 (size: 0x1)
    uint8 bOverride_FilmWhitePoint;                                                   // 0x0003 (size: 0x1)
    uint8 bOverride_FilmSaturation;                                                   // 0x0003 (size: 0x1)
    uint8 bOverride_FilmChannelMixerRed;                                              // 0x0003 (size: 0x1)
    uint8 bOverride_FilmChannelMixerGreen;                                            // 0x0003 (size: 0x1)
    uint8 bOverride_FilmChannelMixerBlue;                                             // 0x0004 (size: 0x1)
    uint8 bOverride_FilmContrast;                                                     // 0x0004 (size: 0x1)
    uint8 bOverride_FilmDynamicRange;                                                 // 0x0004 (size: 0x1)
    uint8 bOverride_FilmHealAmount;                                                   // 0x0004 (size: 0x1)
    uint8 bOverride_FilmToeAmount;                                                    // 0x0004 (size: 0x1)
    uint8 bOverride_FilmShadowTint;                                                   // 0x0004 (size: 0x1)
    uint8 bOverride_FilmShadowTintBlend;                                              // 0x0004 (size: 0x1)
    uint8 bOverride_FilmShadowTintAmount;                                             // 0x0004 (size: 0x1)
    uint8 bOverride_FilmSlope;                                                        // 0x0005 (size: 0x1)
    uint8 bOverride_FilmToe;                                                          // 0x0005 (size: 0x1)
    uint8 bOverride_FilmShoulder;                                                     // 0x0005 (size: 0x1)
    uint8 bOverride_FilmBlackClip;                                                    // 0x0005 (size: 0x1)
    uint8 bOverride_FilmWhiteClip;                                                    // 0x0005 (size: 0x1)
    uint8 bOverride_SceneColorTint;                                                   // 0x0005 (size: 0x1)
    uint8 bOverride_SceneFringeIntensity;                                             // 0x0005 (size: 0x1)
    uint8 bOverride_ChromaticAberrationStartOffset;                                   // 0x0005 (size: 0x1)
    uint8 bOverride_AmbientCubemapTint;                                               // 0x0006 (size: 0x1)
    uint8 bOverride_AmbientCubemapIntensity;                                          // 0x0006 (size: 0x1)
    uint8 bOverride_BloomMethod;                                                      // 0x0006 (size: 0x1)
    uint8 bOverride_BloomIntensity;                                                   // 0x0006 (size: 0x1)
    uint8 bOverride_BloomThreshold;                                                   // 0x0006 (size: 0x1)
    uint8 bOverride_Bloom1Tint;                                                       // 0x0006 (size: 0x1)
    uint8 bOverride_Bloom1Size;                                                       // 0x0006 (size: 0x1)
    uint8 bOverride_Bloom2Size;                                                       // 0x0006 (size: 0x1)
    uint8 bOverride_Bloom2Tint;                                                       // 0x0007 (size: 0x1)
    uint8 bOverride_Bloom3Tint;                                                       // 0x0007 (size: 0x1)
    uint8 bOverride_Bloom3Size;                                                       // 0x0007 (size: 0x1)
    uint8 bOverride_Bloom4Tint;                                                       // 0x0007 (size: 0x1)
    uint8 bOverride_Bloom4Size;                                                       // 0x0007 (size: 0x1)
    uint8 bOverride_Bloom5Tint;                                                       // 0x0007 (size: 0x1)
    uint8 bOverride_Bloom5Size;                                                       // 0x0007 (size: 0x1)
    uint8 bOverride_Bloom6Tint;                                                       // 0x0007 (size: 0x1)
    uint8 bOverride_Bloom6Size;                                                       // 0x0008 (size: 0x1)
    uint8 bOverride_BloomSizeScale;                                                   // 0x0008 (size: 0x1)
    uint8 bOverride_BloomConvolutionTexture;                                          // 0x0008 (size: 0x1)
    uint8 bOverride_BloomConvolutionSize;                                             // 0x0008 (size: 0x1)
    uint8 bOverride_BloomConvolutionCenterUV;                                         // 0x0008 (size: 0x1)
    uint8 bOverride_BloomConvolutionPreFilter;                                        // 0x0008 (size: 0x1)
    uint8 bOverride_BloomConvolutionPreFilterMin;                                     // 0x0008 (size: 0x1)
    uint8 bOverride_BloomConvolutionPreFilterMax;                                     // 0x0008 (size: 0x1)
    uint8 bOverride_BloomConvolutionPreFilterMult;                                    // 0x0009 (size: 0x1)
    uint8 bOverride_BloomConvolutionBufferScale;                                      // 0x0009 (size: 0x1)
    uint8 bOverride_BloomDirtMaskIntensity;                                           // 0x0009 (size: 0x1)
    uint8 bOverride_BloomDirtMaskTint;                                                // 0x0009 (size: 0x1)
    uint8 bOverride_BloomDirtMask;                                                    // 0x0009 (size: 0x1)
    uint8 bOverride_CameraShutterSpeed;                                               // 0x0009 (size: 0x1)
    uint8 bOverride_CameraISO;                                                        // 0x0009 (size: 0x1)
    uint8 bOverride_AutoExposureMethod;                                               // 0x0009 (size: 0x1)
    uint8 bOverride_AutoExposureLowPercent;                                           // 0x000A (size: 0x1)
    uint8 bOverride_AutoExposureHighPercent;                                          // 0x000A (size: 0x1)
    uint8 bOverride_AutoExposureMinBrightness;                                        // 0x000A (size: 0x1)
    uint8 bOverride_AutoExposureMaxBrightness;                                        // 0x000A (size: 0x1)
    uint8 bOverride_AutoExposureCalibrationConstant;                                  // 0x000A (size: 0x1)
    uint8 bOverride_AutoExposureSpeedUp;                                              // 0x000A (size: 0x1)
    uint8 bOverride_AutoExposureSpeedDown;                                            // 0x000A (size: 0x1)
    uint8 bOverride_AutoExposureBias;                                                 // 0x000A (size: 0x1)
    uint8 bOverride_AutoExposureBiasCurve;                                            // 0x000B (size: 0x1)
    uint8 bOverride_AutoExposureMeterMask;                                            // 0x000B (size: 0x1)
    uint8 bOverride_AutoExposureApplyPhysicalCameraExposure;                          // 0x000B (size: 0x1)
    uint8 bOverride_HistogramLogMin;                                                  // 0x000B (size: 0x1)
    uint8 bOverride_HistogramLogMax;                                                  // 0x000B (size: 0x1)
    uint8 bOverride_LensFlareIntensity;                                               // 0x000B (size: 0x1)
    uint8 bOverride_LensFlareTint;                                                    // 0x000B (size: 0x1)
    uint8 bOverride_LensFlareTints;                                                   // 0x000B (size: 0x1)
    uint8 bOverride_LensFlareBokehSize;                                               // 0x000C (size: 0x1)
    uint8 bOverride_LensFlareBokehShape;                                              // 0x000C (size: 0x1)
    uint8 bOverride_LensFlareThreshold;                                               // 0x000C (size: 0x1)
    uint8 bOverride_VignetteIntensity;                                                // 0x000C (size: 0x1)
    uint8 bOverride_GrainIntensity;                                                   // 0x000C (size: 0x1)
    uint8 bOverride_GrainJitter;                                                      // 0x000C (size: 0x1)
    uint8 bOverride_AmbientOcclusionIntensity;                                        // 0x000C (size: 0x1)
    uint8 bOverride_AmbientOcclusionStaticFraction;                                   // 0x000C (size: 0x1)
    uint8 bOverride_AmbientOcclusionRadius;                                           // 0x000D (size: 0x1)
    uint8 bOverride_AmbientOcclusionFadeDistance;                                     // 0x000D (size: 0x1)
    uint8 bOverride_AmbientOcclusionFadeRadius;                                       // 0x000D (size: 0x1)
    uint8 bOverride_AmbientOcclusionDistance;                                         // 0x000D (size: 0x1)
    uint8 bOverride_AmbientOcclusionRadiusInWS;                                       // 0x000D (size: 0x1)
    uint8 bOverride_AmbientOcclusionPower;                                            // 0x000D (size: 0x1)
    uint8 bOverride_AmbientOcclusionBias;                                             // 0x000D (size: 0x1)
    uint8 bOverride_AmbientOcclusionQuality;                                          // 0x000D (size: 0x1)
    uint8 bOverride_AmbientOcclusionMipBlend;                                         // 0x000E (size: 0x1)
    uint8 bOverride_AmbientOcclusionMipScale;                                         // 0x000E (size: 0x1)
    uint8 bOverride_AmbientOcclusionMipThreshold;                                     // 0x000E (size: 0x1)
    uint8 bOverride_AmbientOcclusionTemporalBlendWeight;                              // 0x000E (size: 0x1)
    uint8 bOverride_RayTracingAO;                                                     // 0x0010 (size: 0x1)
    uint8 bOverride_RayTracingAOSamplesPerPixel;                                      // 0x0010 (size: 0x1)
    uint8 bOverride_RayTracingAOIntensity;                                            // 0x0010 (size: 0x1)
    uint8 bOverride_RayTracingAORadius;                                               // 0x0010 (size: 0x1)
    uint8 bOverride_LPVIntensity;                                                     // 0x0014 (size: 0x1)
    uint8 bOverride_LPVDirectionalOcclusionIntensity;                                 // 0x0014 (size: 0x1)
    uint8 bOverride_LPVDirectionalOcclusionRadius;                                    // 0x0014 (size: 0x1)
    uint8 bOverride_LPVDiffuseOcclusionExponent;                                      // 0x0014 (size: 0x1)
    uint8 bOverride_LPVSpecularOcclusionExponent;                                     // 0x0014 (size: 0x1)
    uint8 bOverride_LPVDiffuseOcclusionIntensity;                                     // 0x0014 (size: 0x1)
    uint8 bOverride_LPVSpecularOcclusionIntensity;                                    // 0x0014 (size: 0x1)
    uint8 bOverride_LPVSize;                                                          // 0x0014 (size: 0x1)
    uint8 bOverride_LPVSecondaryOcclusionIntensity;                                   // 0x0015 (size: 0x1)
    uint8 bOverride_LPVSecondaryBounceIntensity;                                      // 0x0015 (size: 0x1)
    uint8 bOverride_LPVGeometryVolumeBias;                                            // 0x0015 (size: 0x1)
    uint8 bOverride_LPVVplInjectionBias;                                              // 0x0015 (size: 0x1)
    uint8 bOverride_LPVEmissiveInjectionIntensity;                                    // 0x0015 (size: 0x1)
    uint8 bOverride_LPVFadeRange;                                                     // 0x0015 (size: 0x1)
    uint8 bOverride_LPVDirectionalOcclusionFadeRange;                                 // 0x0015 (size: 0x1)
    uint8 bOverride_IndirectLightingColor;                                            // 0x0015 (size: 0x1)
    uint8 bOverride_IndirectLightingIntensity;                                        // 0x0016 (size: 0x1)
    uint8 bOverride_ColorGradingIntensity;                                            // 0x0016 (size: 0x1)
    uint8 bOverride_ColorGradingLUT;                                                  // 0x0016 (size: 0x1)
    uint8 bOverride_DepthOfFieldFocalDistance;                                        // 0x0016 (size: 0x1)
    uint8 bOverride_DepthOfFieldFstop;                                                // 0x0016 (size: 0x1)
    uint8 bOverride_DepthOfFieldMinFstop;                                             // 0x0016 (size: 0x1)
    uint8 bOverride_DepthOfFieldBladeCount;                                           // 0x0016 (size: 0x1)
    uint8 bOverride_DepthOfFieldSensorWidth;                                          // 0x0016 (size: 0x1)
    uint8 bOverride_DepthOfFieldDepthBlurRadius;                                      // 0x0017 (size: 0x1)
    uint8 bOverride_DepthOfFieldDepthBlurAmount;                                      // 0x0017 (size: 0x1)
    uint8 bOverride_DepthOfFieldFocalRegion;                                          // 0x0017 (size: 0x1)
    uint8 bOverride_DepthOfFieldNearTransitionRegion;                                 // 0x0017 (size: 0x1)
    uint8 bOverride_DepthOfFieldFarTransitionRegion;                                  // 0x0017 (size: 0x1)
    uint8 bOverride_DepthOfFieldScale;                                                // 0x0017 (size: 0x1)
    uint8 bOverride_DepthOfFieldNearBlurSize;                                         // 0x0017 (size: 0x1)
    uint8 bOverride_DepthOfFieldFarBlurSize;                                          // 0x0017 (size: 0x1)
    uint8 bOverride_MobileHQGaussian;                                                 // 0x0018 (size: 0x1)
    uint8 bOverride_DepthOfFieldOcclusion;                                            // 0x0018 (size: 0x1)
    uint8 bOverride_DepthOfFieldSkyFocusDistance;                                     // 0x0018 (size: 0x1)
    uint8 bOverride_DepthOfFieldVignetteSize;                                         // 0x0018 (size: 0x1)
    uint8 bOverride_MotionBlurAmount;                                                 // 0x0018 (size: 0x1)
    uint8 bOverride_MotionBlurMax;                                                    // 0x0018 (size: 0x1)
    uint8 bOverride_MotionBlurTargetFPS;                                              // 0x0018 (size: 0x1)
    uint8 bOverride_MotionBlurPerObjectSize;                                          // 0x0018 (size: 0x1)
    uint8 bOverride_ScreenPercentage;                                                 // 0x0019 (size: 0x1)
    uint8 bOverride_ScreenSpaceReflectionIntensity;                                   // 0x0019 (size: 0x1)
    uint8 bOverride_ScreenSpaceReflectionQuality;                                     // 0x0019 (size: 0x1)
    uint8 bOverride_ScreenSpaceReflectionMaxRoughness;                                // 0x0019 (size: 0x1)
    uint8 bOverride_ScreenSpaceReflectionRoughnessScale;                              // 0x0019 (size: 0x1)
    uint8 bOverride_ReflectionsType;                                                  // 0x001C (size: 0x1)
    uint8 bOverride_RayTracingReflectionsMaxRoughness;                                // 0x001C (size: 0x1)
    uint8 bOverride_RayTracingReflectionsMaxBounces;                                  // 0x001C (size: 0x1)
    uint8 bOverride_RayTracingReflectionsSamplesPerPixel;                             // 0x001C (size: 0x1)
    uint8 bOverride_RayTracingReflectionsShadows;                                     // 0x001C (size: 0x1)
    uint8 bOverride_RayTracingReflectionsTranslucency;                                // 0x001C (size: 0x1)
    uint8 bOverride_TranslucencyType;                                                 // 0x001C (size: 0x1)
    uint8 bOverride_RayTracingTranslucencyMaxRoughness;                               // 0x001C (size: 0x1)
    uint8 bOverride_RayTracingTranslucencyRefractionRays;                             // 0x001D (size: 0x1)
    uint8 bOverride_RayTracingTranslucencySamplesPerPixel;                            // 0x001D (size: 0x1)
    uint8 bOverride_RayTracingTranslucencyShadows;                                    // 0x001D (size: 0x1)
    uint8 bOverride_RayTracingTranslucencyRefraction;                                 // 0x001D (size: 0x1)
    uint8 bOverride_RayTracingGI;                                                     // 0x001D (size: 0x1)
    uint8 bOverride_RayTracingGIMaxBounces;                                           // 0x001D (size: 0x1)
    uint8 bOverride_RayTracingGISamplesPerPixel;                                      // 0x001D (size: 0x1)
    uint8 bOverride_PathTracingMaxBounces;                                            // 0x001D (size: 0x1)
    uint8 bOverride_PathTracingSamplesPerPixel;                                       // 0x001E (size: 0x1)
    uint8 bOverride_PathTracingFilterWidth;                                           // 0x001E (size: 0x1)
    uint8 bOverride_PathTracingEnableEmissive;                                        // 0x001E (size: 0x1)
    uint8 bOverride_PathTracingMaxPathExposure;                                       // 0x001E (size: 0x1)
    uint8 bOverride_PathTracingEnableDenoiser;                                        // 0x001E (size: 0x1)
    uint8 bMobileHQGaussian;                                                          // 0x0020 (size: 0x1)
    TEnumAsByte<EBloomMethod> BloomMethod;                                            // 0x0021 (size: 0x1)
    TEnumAsByte<EAutoExposureMethod> AutoExposureMethod;                              // 0x0022 (size: 0x1)
    TEnumAsByte<ETemperatureMethod> TemperatureType;                                  // 0x0023 (size: 0x1)
    float WhiteTemp;                                                                  // 0x0024 (size: 0x4)
    float WhiteTint;                                                                  // 0x0028 (size: 0x4)
    FVector4 ColorSaturation;                                                         // 0x0030 (size: 0x10)
    FVector4 ColorContrast;                                                           // 0x0040 (size: 0x10)
    FVector4 ColorGamma;                                                              // 0x0050 (size: 0x10)
    FVector4 ColorGain;                                                               // 0x0060 (size: 0x10)
    FVector4 ColorOffset;                                                             // 0x0070 (size: 0x10)
    FVector4 ColorSaturationShadows;                                                  // 0x0080 (size: 0x10)
    FVector4 ColorContrastShadows;                                                    // 0x0090 (size: 0x10)
    FVector4 ColorGammaShadows;                                                       // 0x00A0 (size: 0x10)
    FVector4 ColorGainShadows;                                                        // 0x00B0 (size: 0x10)
    FVector4 ColorOffsetShadows;                                                      // 0x00C0 (size: 0x10)
    FVector4 ColorSaturationMidtones;                                                 // 0x00D0 (size: 0x10)
    FVector4 ColorContrastMidtones;                                                   // 0x00E0 (size: 0x10)
    FVector4 ColorGammaMidtones;                                                      // 0x00F0 (size: 0x10)
    FVector4 ColorGainMidtones;                                                       // 0x0100 (size: 0x10)
    FVector4 ColorOffsetMidtones;                                                     // 0x0110 (size: 0x10)
    FVector4 ColorSaturationHighlights;                                               // 0x0120 (size: 0x10)
    FVector4 ColorContrastHighlights;                                                 // 0x0130 (size: 0x10)
    FVector4 ColorGammaHighlights;                                                    // 0x0140 (size: 0x10)
    FVector4 ColorGainHighlights;                                                     // 0x0150 (size: 0x10)
    FVector4 ColorOffsetHighlights;                                                   // 0x0160 (size: 0x10)
    float ColorCorrectionHighlightsMin;                                               // 0x0170 (size: 0x4)
    float ColorCorrectionShadowsMax;                                                  // 0x0174 (size: 0x4)
    float BlueCorrection;                                                             // 0x0178 (size: 0x4)
    float ExpandGamut;                                                                // 0x017C (size: 0x4)
    float ToneCurveAmount;                                                            // 0x0180 (size: 0x4)
    float FilmSlope;                                                                  // 0x0184 (size: 0x4)
    float FilmToe;                                                                    // 0x0188 (size: 0x4)
    float FilmShoulder;                                                               // 0x018C (size: 0x4)
    float FilmBlackClip;                                                              // 0x0190 (size: 0x4)
    float FilmWhiteClip;                                                              // 0x0194 (size: 0x4)
    FLinearColor FilmWhitePoint;                                                      // 0x0198 (size: 0x10)
    FLinearColor FilmShadowTint;                                                      // 0x01A8 (size: 0x10)
    float FilmShadowTintBlend;                                                        // 0x01B8 (size: 0x4)
    float FilmShadowTintAmount;                                                       // 0x01BC (size: 0x4)
    float FilmSaturation;                                                             // 0x01C0 (size: 0x4)
    FLinearColor FilmChannelMixerRed;                                                 // 0x01C4 (size: 0x10)
    FLinearColor FilmChannelMixerGreen;                                               // 0x01D4 (size: 0x10)
    FLinearColor FilmChannelMixerBlue;                                                // 0x01E4 (size: 0x10)
    float FilmContrast;                                                               // 0x01F4 (size: 0x4)
    float FilmToeAmount;                                                              // 0x01F8 (size: 0x4)
    float FilmHealAmount;                                                             // 0x01FC (size: 0x4)
    float FilmDynamicRange;                                                           // 0x0200 (size: 0x4)
    FLinearColor SceneColorTint;                                                      // 0x0204 (size: 0x10)
    float SceneFringeIntensity;                                                       // 0x0214 (size: 0x4)
    float ChromaticAberrationStartOffset;                                             // 0x0218 (size: 0x4)
    float BloomIntensity;                                                             // 0x021C (size: 0x4)
    float BloomThreshold;                                                             // 0x0220 (size: 0x4)
    float BloomSizeScale;                                                             // 0x0224 (size: 0x4)
    float Bloom1Size;                                                                 // 0x0228 (size: 0x4)
    float Bloom2Size;                                                                 // 0x022C (size: 0x4)
    float Bloom3Size;                                                                 // 0x0230 (size: 0x4)
    float Bloom4Size;                                                                 // 0x0234 (size: 0x4)
    float Bloom5Size;                                                                 // 0x0238 (size: 0x4)
    float Bloom6Size;                                                                 // 0x023C (size: 0x4)
    FLinearColor Bloom1Tint;                                                          // 0x0240 (size: 0x10)
    FLinearColor Bloom2Tint;                                                          // 0x0250 (size: 0x10)
    FLinearColor Bloom3Tint;                                                          // 0x0260 (size: 0x10)
    FLinearColor Bloom4Tint;                                                          // 0x0270 (size: 0x10)
    FLinearColor Bloom5Tint;                                                          // 0x0280 (size: 0x10)
    FLinearColor Bloom6Tint;                                                          // 0x0290 (size: 0x10)
    float BloomConvolutionSize;                                                       // 0x02A0 (size: 0x4)
    class UTexture2D* BloomConvolutionTexture;                                        // 0x02A8 (size: 0x8)
    FVector2D BloomConvolutionCenterUV;                                               // 0x02B0 (size: 0x8)
    float BloomConvolutionPreFilterMin;                                               // 0x02B8 (size: 0x4)
    float BloomConvolutionPreFilterMax;                                               // 0x02BC (size: 0x4)
    float BloomConvolutionPreFilterMult;                                              // 0x02C0 (size: 0x4)
    float BloomConvolutionBufferScale;                                                // 0x02C4 (size: 0x4)
    class UTexture* BloomDirtMask;                                                    // 0x02C8 (size: 0x8)
    float BloomDirtMaskIntensity;                                                     // 0x02D0 (size: 0x4)
    FLinearColor BloomDirtMaskTint;                                                   // 0x02D4 (size: 0x10)
    FLinearColor AmbientCubemapTint;                                                  // 0x02E4 (size: 0x10)
    float AmbientCubemapIntensity;                                                    // 0x02F4 (size: 0x4)
    class UTextureCube* AmbientCubemap;                                               // 0x02F8 (size: 0x8)
    float CameraShutterSpeed;                                                         // 0x0300 (size: 0x4)
    float CameraISO;                                                                  // 0x0304 (size: 0x4)
    float DepthOfFieldFstop;                                                          // 0x0308 (size: 0x4)
    float DepthOfFieldMinFstop;                                                       // 0x030C (size: 0x4)
    int32 DepthOfFieldBladeCount;                                                     // 0x0310 (size: 0x4)
    float AutoExposureBias;                                                           // 0x0314 (size: 0x4)
    float AutoExposureBiasBackup;                                                     // 0x0318 (size: 0x4)
    uint8 bOverride_AutoExposureBiasBackup;                                           // 0x031C (size: 0x1)
    uint8 AutoExposureApplyPhysicalCameraExposure;                                    // 0x0320 (size: 0x1)
    class UCurveFloat* AutoExposureBiasCurve;                                         // 0x0328 (size: 0x8)
    class UTexture* AutoExposureMeterMask;                                            // 0x0330 (size: 0x8)
    float AutoExposureLowPercent;                                                     // 0x0338 (size: 0x4)
    float AutoExposureHighPercent;                                                    // 0x033C (size: 0x4)
    float AutoExposureMinBrightness;                                                  // 0x0340 (size: 0x4)
    float AutoExposureMaxBrightness;                                                  // 0x0344 (size: 0x4)
    float AutoExposureSpeedUp;                                                        // 0x0348 (size: 0x4)
    float AutoExposureSpeedDown;                                                      // 0x034C (size: 0x4)
    float HistogramLogMin;                                                            // 0x0350 (size: 0x4)
    float HistogramLogMax;                                                            // 0x0354 (size: 0x4)
    float AutoExposureCalibrationConstant;                                            // 0x0358 (size: 0x4)
    float LensFlareIntensity;                                                         // 0x035C (size: 0x4)
    FLinearColor LensFlareTint;                                                       // 0x0360 (size: 0x10)
    float LensFlareBokehSize;                                                         // 0x0370 (size: 0x4)
    float LensFlareThreshold;                                                         // 0x0374 (size: 0x4)
    class UTexture* LensFlareBokehShape;                                              // 0x0378 (size: 0x8)
    FLinearColor LensFlareTints;                                                      // 0x0380 (size: 0x80)
    float VignetteIntensity;                                                          // 0x0400 (size: 0x4)
    float GrainJitter;                                                                // 0x0404 (size: 0x4)
    float GrainIntensity;                                                             // 0x0408 (size: 0x4)
    float AmbientOcclusionIntensity;                                                  // 0x040C (size: 0x4)
    float AmbientOcclusionStaticFraction;                                             // 0x0410 (size: 0x4)
    float AmbientOcclusionRadius;                                                     // 0x0414 (size: 0x4)
    uint8 AmbientOcclusionRadiusInWS;                                                 // 0x0418 (size: 0x1)
    float AmbientOcclusionFadeDistance;                                               // 0x041C (size: 0x4)
    float AmbientOcclusionFadeRadius;                                                 // 0x0420 (size: 0x4)
    float AmbientOcclusionDistance;                                                   // 0x0424 (size: 0x4)
    float AmbientOcclusionPower;                                                      // 0x0428 (size: 0x4)
    float AmbientOcclusionBias;                                                       // 0x042C (size: 0x4)
    float AmbientOcclusionQuality;                                                    // 0x0430 (size: 0x4)
    float AmbientOcclusionMipBlend;                                                   // 0x0434 (size: 0x4)
    float AmbientOcclusionMipScale;                                                   // 0x0438 (size: 0x4)
    float AmbientOcclusionMipThreshold;                                               // 0x043C (size: 0x4)
    float AmbientOcclusionTemporalBlendWeight;                                        // 0x0440 (size: 0x4)
    uint8 RayTracingAO;                                                               // 0x0444 (size: 0x1)
    int32 RayTracingAOSamplesPerPixel;                                                // 0x0448 (size: 0x4)
    float RayTracingAOIntensity;                                                      // 0x044C (size: 0x4)
    float RayTracingAORadius;                                                         // 0x0450 (size: 0x4)
    FLinearColor IndirectLightingColor;                                               // 0x0454 (size: 0x10)
    float IndirectLightingIntensity;                                                  // 0x0464 (size: 0x4)
    ERayTracingGlobalIlluminationType RayTracingGIType;                               // 0x0468 (size: 0x1)
    int32 RayTracingGIMaxBounces;                                                     // 0x046C (size: 0x4)
    int32 RayTracingGISamplesPerPixel;                                                // 0x0470 (size: 0x4)
    float ColorGradingIntensity;                                                      // 0x0474 (size: 0x4)
    class UTexture* ColorGradingLUT;                                                  // 0x0478 (size: 0x8)
    float DepthOfFieldSensorWidth;                                                    // 0x0480 (size: 0x4)
    float DepthOfFieldFocalDistance;                                                  // 0x0484 (size: 0x4)
    float DepthOfFieldDepthBlurAmount;                                                // 0x0488 (size: 0x4)
    float DepthOfFieldDepthBlurRadius;                                                // 0x048C (size: 0x4)
    float DepthOfFieldFocalRegion;                                                    // 0x0490 (size: 0x4)
    float DepthOfFieldNearTransitionRegion;                                           // 0x0494 (size: 0x4)
    float DepthOfFieldFarTransitionRegion;                                            // 0x0498 (size: 0x4)
    float DepthOfFieldScale;                                                          // 0x049C (size: 0x4)
    float DepthOfFieldNearBlurSize;                                                   // 0x04A0 (size: 0x4)
    float DepthOfFieldFarBlurSize;                                                    // 0x04A4 (size: 0x4)
    float DepthOfFieldOcclusion;                                                      // 0x04A8 (size: 0x4)
    float DepthOfFieldSkyFocusDistance;                                               // 0x04AC (size: 0x4)
    float DepthOfFieldVignetteSize;                                                   // 0x04B0 (size: 0x4)
    float MotionBlurAmount;                                                           // 0x04B4 (size: 0x4)
    float MotionBlurMax;                                                              // 0x04B8 (size: 0x4)
    int32 MotionBlurTargetFPS;                                                        // 0x04BC (size: 0x4)
    float MotionBlurPerObjectSize;                                                    // 0x04C0 (size: 0x4)
    float LPVIntensity;                                                               // 0x04C4 (size: 0x4)
    float LPVVplInjectionBias;                                                        // 0x04C8 (size: 0x4)
    float LPVSize;                                                                    // 0x04CC (size: 0x4)
    float LPVSecondaryOcclusionIntensity;                                             // 0x04D0 (size: 0x4)
    float LPVSecondaryBounceIntensity;                                                // 0x04D4 (size: 0x4)
    float LPVGeometryVolumeBias;                                                      // 0x04D8 (size: 0x4)
    float LPVEmissiveInjectionIntensity;                                              // 0x04DC (size: 0x4)
    float LPVDirectionalOcclusionIntensity;                                           // 0x04E0 (size: 0x4)
    float LPVDirectionalOcclusionRadius;                                              // 0x04E4 (size: 0x4)
    float LPVDiffuseOcclusionExponent;                                                // 0x04E8 (size: 0x4)
    float LPVSpecularOcclusionExponent;                                               // 0x04EC (size: 0x4)
    float LPVDiffuseOcclusionIntensity;                                               // 0x04F0 (size: 0x4)
    float LPVSpecularOcclusionIntensity;                                              // 0x04F4 (size: 0x4)
    EReflectionsType ReflectionsType;                                                 // 0x04F8 (size: 0x1)
    float ScreenSpaceReflectionIntensity;                                             // 0x04FC (size: 0x4)
    float ScreenSpaceReflectionQuality;                                               // 0x0500 (size: 0x4)
    float ScreenSpaceReflectionMaxRoughness;                                          // 0x0504 (size: 0x4)
    float RayTracingReflectionsMaxRoughness;                                          // 0x0508 (size: 0x4)
    int32 RayTracingReflectionsMaxBounces;                                            // 0x050C (size: 0x4)
    int32 RayTracingReflectionsSamplesPerPixel;                                       // 0x0510 (size: 0x4)
    EReflectedAndRefractedRayTracedShadows RayTracingReflectionsShadows;              // 0x0514 (size: 0x1)
    uint8 RayTracingReflectionsTranslucency;                                          // 0x0515 (size: 0x1)
    ETranslucencyType TranslucencyType;                                               // 0x0516 (size: 0x1)
    float RayTracingTranslucencyMaxRoughness;                                         // 0x0518 (size: 0x4)
    int32 RayTracingTranslucencyRefractionRays;                                       // 0x051C (size: 0x4)
    int32 RayTracingTranslucencySamplesPerPixel;                                      // 0x0520 (size: 0x4)
    EReflectedAndRefractedRayTracedShadows RayTracingTranslucencyShadows;             // 0x0524 (size: 0x1)
    uint8 RayTracingTranslucencyRefraction;                                           // 0x0525 (size: 0x1)
    int32 PathTracingMaxBounces;                                                      // 0x0528 (size: 0x4)
    int32 PathTracingSamplesPerPixel;                                                 // 0x052C (size: 0x4)
    float PathTracingFilterWidth;                                                     // 0x0530 (size: 0x4)
    uint8 PathTracingEnableEmissive;                                                  // 0x0534 (size: 0x1)
    float PathTracingMaxPathExposure;                                                 // 0x0538 (size: 0x4)
    uint8 PathTracingEnableDenoiser;                                                  // 0x053C (size: 0x1)
    float LPVFadeRange;                                                               // 0x0540 (size: 0x4)
    float LPVDirectionalOcclusionFadeRange;                                           // 0x0544 (size: 0x4)
    float ScreenPercentage;                                                           // 0x0548 (size: 0x4)
    FWeightedBlendables WeightedBlendables;                                           // 0x0550 (size: 0x10)

}; // Size: 0x560

struct FMinimalViewInfo
{
    FVector Location;                                                                 // 0x0000 (size: 0xC)
    FRotator Rotation;                                                                // 0x000C (size: 0xC)
    float FOV;                                                                        // 0x0018 (size: 0x4)
    float DesiredFOV;                                                                 // 0x001C (size: 0x4)
    float OrthoWidth;                                                                 // 0x0020 (size: 0x4)
    float OrthoNearClipPlane;                                                         // 0x0024 (size: 0x4)
    float OrthoFarClipPlane;                                                          // 0x0028 (size: 0x4)
    float AspectRatio;                                                                // 0x002C (size: 0x4)
    uint8 bConstrainAspectRatio;                                                      // 0x0030 (size: 0x1)
    uint8 bUseFieldOfViewForLOD;                                                      // 0x0030 (size: 0x1)
    TEnumAsByte<ECameraProjectionMode::Type> ProjectionMode;                          // 0x0034 (size: 0x1)
    float PostProcessBlendWeight;                                                     // 0x0038 (size: 0x4)
    FPostProcessSettings PostProcessSettings;                                         // 0x0040 (size: 0x560)
    FVector2D OffCenterProjectionOffset;                                              // 0x05A0 (size: 0x8)

}; // Size: 0x5F0

struct FKeyHandleLookupTable
{
}; // Size: 0x60

class UCommandlet : public UObject
{
    FString HelpDescription;                                                          // 0x0028 (size: 0x10)
    FString HelpUsage;                                                                // 0x0038 (size: 0x10)
    FString HelpWebLink;                                                              // 0x0048 (size: 0x10)
    TArray<FString> HelpParamNames;                                                   // 0x0058 (size: 0x10)
    TArray<FString> HelpParamDescriptions;                                            // 0x0068 (size: 0x10)
    uint8 IsServer;                                                                   // 0x0078 (size: 0x1)
    uint8 IsClient;                                                                   // 0x0078 (size: 0x1)
    uint8 IsEditor;                                                                   // 0x0078 (size: 0x1)
    uint8 LogToConsole;                                                               // 0x0078 (size: 0x1)
    uint8 ShowErrorCount;                                                             // 0x0078 (size: 0x1)
    uint8 ShowProgress;                                                               // 0x0078 (size: 0x1)

}; // Size: 0x80

struct FAudioComponentParam
{
    FName ParamName;                                                                  // 0x0000 (size: 0x8)
    float FloatParam;                                                                 // 0x0008 (size: 0x4)
    bool BoolParam;                                                                   // 0x000C (size: 0x1)
    int32 IntParam;                                                                   // 0x0010 (size: 0x4)
    class USoundWave* SoundWaveParam;                                                 // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FSoundModulationDefaultSettings
{
    FSoundModulationDestinationSettings VolumeModulationDestination;                  // 0x0000 (size: 0x10)
    FSoundModulationDestinationSettings PitchModulationDestination;                   // 0x0010 (size: 0x10)
    FSoundModulationDestinationSettings HighpassModulationDestination;                // 0x0020 (size: 0x10)
    FSoundModulationDestinationSettings LowpassModulationDestination;                 // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FSoundModulationDefaultRoutingSettings : public FSoundModulationDefaultSettings
{
    EModulationRouting VolumeRouting;                                                 // 0x0040 (size: 0x1)
    EModulationRouting PitchRouting;                                                  // 0x0041 (size: 0x1)
    EModulationRouting HighpassRouting;                                               // 0x0042 (size: 0x1)
    EModulationRouting LowpassRouting;                                                // 0x0043 (size: 0x1)

}; // Size: 0x48

struct FQuartzQuantizationBoundary
{
    EQuartzCommandQuantization Quantization;                                          // 0x0000 (size: 0x1)
    float Multiplier;                                                                 // 0x0004 (size: 0x4)
    EQuarztQuantizationReference CountingReferencePoint;                              // 0x0008 (size: 0x1)
    bool bFireOnClockStart;                                                           // 0x0009 (size: 0x1)

}; // Size: 0xC

struct FSoundWaveSpectralData
{
    float FrequencyHz;                                                                // 0x0000 (size: 0x4)
    float Magnitude;                                                                  // 0x0004 (size: 0x4)
    float NormalizedMagnitude;                                                        // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FSoundWaveSpectralDataPerSound
{
    TArray<FSoundWaveSpectralData> SpectralData;                                      // 0x0000 (size: 0x10)
    float PlaybackTime;                                                               // 0x0010 (size: 0x4)
    class USoundWave* SoundWave;                                                      // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FSoundWaveEnvelopeDataPerSound
{
    float Envelope;                                                                   // 0x0000 (size: 0x4)
    float PlaybackTime;                                                               // 0x0004 (size: 0x4)
    class USoundWave* SoundWave;                                                      // 0x0008 (size: 0x8)

}; // Size: 0x10

class UAudioComponent : public USceneComponent
{
    class USoundBase* Sound;                                                          // 0x01F8 (size: 0x8)
    TArray<FAudioComponentParam> InstanceParameters;                                  // 0x0200 (size: 0x10)
    class USoundClass* SoundClassOverride;                                            // 0x0210 (size: 0x8)
    uint8 bAutoDestroy;                                                               // 0x0218 (size: 0x1)
    uint8 bStopWhenOwnerDestroyed;                                                    // 0x0218 (size: 0x1)
    uint8 bShouldRemainActiveIfDropped;                                               // 0x0218 (size: 0x1)
    uint8 bAllowSpatialization;                                                       // 0x0218 (size: 0x1)
    uint8 bOverrideAttenuation;                                                       // 0x0218 (size: 0x1)
    uint8 bOverrideSubtitlePriority;                                                  // 0x0218 (size: 0x1)
    uint8 bIsUISound;                                                                 // 0x0218 (size: 0x1)
    uint8 bEnableLowPassFilter;                                                       // 0x0218 (size: 0x1)
    uint8 bOverridePriority;                                                          // 0x0219 (size: 0x1)
    uint8 bSuppressSubtitles;                                                         // 0x0219 (size: 0x1)
    uint8 bAutoManageAttachment;                                                      // 0x021A (size: 0x1)
    FName AudioComponentUserID;                                                       // 0x0220 (size: 0x8)
    float PitchModulationMin;                                                         // 0x0228 (size: 0x4)
    float PitchModulationMax;                                                         // 0x022C (size: 0x4)
    float VolumeModulationMin;                                                        // 0x0230 (size: 0x4)
    float VolumeModulationMax;                                                        // 0x0234 (size: 0x4)
    float VolumeMultiplier;                                                           // 0x0238 (size: 0x4)
    int32 EnvelopeFollowerAttackTime;                                                 // 0x023C (size: 0x4)
    int32 EnvelopeFollowerReleaseTime;                                                // 0x0240 (size: 0x4)
    float Priority;                                                                   // 0x0244 (size: 0x4)
    float SubtitlePriority;                                                           // 0x0248 (size: 0x4)
    class USoundEffectSourcePresetChain* SourceEffectChain;                           // 0x0250 (size: 0x8)
    float PitchMultiplier;                                                            // 0x0258 (size: 0x4)
    float LowPassFilterFrequency;                                                     // 0x025C (size: 0x4)
    class USoundAttenuation* AttenuationSettings;                                     // 0x0268 (size: 0x8)
    FSoundAttenuationSettings AttenuationOverrides;                                   // 0x0270 (size: 0x3A0)
    class USoundConcurrency* ConcurrencySettings;                                     // 0x0610 (size: 0x8)
    TSet<USoundConcurrency*> ConcurrencySet;                                          // 0x0618 (size: 0x50)
    EAttachmentRule AutoAttachLocationRule;                                           // 0x0674 (size: 0x1)
    EAttachmentRule AutoAttachRotationRule;                                           // 0x0675 (size: 0x1)
    EAttachmentRule AutoAttachScaleRule;                                              // 0x0676 (size: 0x1)
    FSoundModulationDefaultRoutingSettings ModulationRouting;                         // 0x0678 (size: 0x48)
    FAudioComponentOnAudioPlayStateChanged OnAudioPlayStateChanged;                   // 0x06C0 (size: 0x10)
    void OnAudioPlayStateChanged(EAudioComponentPlayState PlayState);
    FAudioComponentOnAudioVirtualizationChanged OnAudioVirtualizationChanged;         // 0x06E8 (size: 0x10)
    void OnAudioVirtualizationChanged(bool bIsVirtualized);
    FAudioComponentOnAudioFinished OnAudioFinished;                                   // 0x0710 (size: 0x10)
    void OnAudioFinished();
    FAudioComponentOnAudioPlaybackPercent OnAudioPlaybackPercent;                     // 0x0738 (size: 0x10)
    void OnAudioPlaybackPercent(const class USoundWave* PlayingSoundWave, const float PlaybackPercent);
    FAudioComponentOnAudioSingleEnvelopeValue OnAudioSingleEnvelopeValue;             // 0x0760 (size: 0x10)
    void OnAudioSingleEnvelopeValue(const class USoundWave* PlayingSoundWave, const float EnvelopeValue);
    FAudioComponentOnAudioMultiEnvelopeValue OnAudioMultiEnvelopeValue;               // 0x0788 (size: 0x10)
    void OnAudioMultiEnvelopeValue(const float AverageEnvelopeValue, const float MaxEnvelope, const int32 NumWaveInstances);
    FAudioComponentOnQueueSubtitles OnQueueSubtitles;                                 // 0x07B0 (size: 0x10)
    void OnQueueSubtitles(const TArray<FSubtitleCue>& Subtitles, float CueDuration);
    TWeakObjectPtr<class USceneComponent> AutoAttachParent;                           // 0x07C0 (size: 0x8)
    FName AutoAttachSocketName;                                                       // 0x07C8 (size: 0x8)

    void StopDelayed(float DelayTime);
    void Stop();
    void SetWaveParameter(FName InName, class USoundWave* InWave);
    void SetVolumeMultiplier(float NewVolumeMultiplier);
    void SetUISound(bool bInUISound);
    void SetSubmixSend(class USoundSubmixBase* Submix, float SendLevel);
    void SetSourceBusSendPreEffect(class USoundSourceBus* SoundSourceBus, float SourceBusSendLevel);
    void SetSourceBusSendPostEffect(class USoundSourceBus* SoundSourceBus, float SourceBusSendLevel);
    void SetSound(class USoundBase* NewSound);
    void SetPitchMultiplier(float NewPitchMultiplier);
    void SetPaused(bool bPause);
    void SetOutputToBusOnly(bool bInOutputToBusOnly);
    void SetLowPassFilterFrequency(float InLowPassFilterFrequency);
    void SetLowPassFilterEnabled(bool InLowPassFilterEnabled);
    void SetIntParameter(FName InName, int32 inInt);
    void SetFloatParameter(FName InName, float InFloat);
    void SetBoolParameter(FName InName, bool InBool);
    void SetAudioBusSendPreEffect(class UAudioBus* AudioBus, float AudioBusSendLevel);
    void SetAudioBusSendPostEffect(class UAudioBus* AudioBus, float AudioBusSendLevel);
    void PlayQuantized(const class UObject* WorldContextObject, class UQuartzClockHandle*& InClockHandle, FQuartzQuantizationBoundary& InQuantizationBoundary, const FPlayQuantizedInDelegate& InDelegate, float InStartTime, float InFadeInDuration, float InFadeVolumeLevel, EAudioFaderCurve InFadeCurve);
    void Play(float StartTime);
    bool IsVirtualized();
    bool IsPlaying();
    bool HasCookedFFTData();
    bool HasCookedAmplitudeEnvelopeData();
    EAudioComponentPlayState GetPlayState();
    bool GetCookedFFTDataForAllPlayingSounds(TArray<FSoundWaveSpectralDataPerSound>& OutSoundWaveSpectralData);
    bool GetCookedFFTData(const TArray<float>& FrequenciesToGet, TArray<FSoundWaveSpectralData>& OutSoundWaveSpectralData);
    bool GetCookedEnvelopeDataForAllPlayingSounds(TArray<FSoundWaveEnvelopeDataPerSound>& OutEnvelopeData);
    bool GetCookedEnvelopeData(float& OutEnvelopeData);
    void FadeOut(float FadeOutDuration, float FadeVolumeLevel, const EAudioFaderCurve FadeCurve);
    void FadeIn(float FadeInDuration, float FadeVolumeLevel, float StartTime, const EAudioFaderCurve FadeCurve);
    bool BP_GetAttenuationSettingsToApply(FSoundAttenuationSettings& OutAttenuationSettings);
    void AdjustVolume(float AdjustVolumeDuration, float AdjustVolumeLevel, const EAudioFaderCurve FadeCurve);
    void AdjustAttenuation(const FSoundAttenuationSettings& InAttenuationSettings);
}; // Size: 0x860

class UAssetImportData : public UObject
{
}; // Size: 0x28

class UAssetUserData : public UObject
{
}; // Size: 0x28

class UFXSystemComponent : public UPrimitiveComponent
{

    void SetVectorParameter(FName ParameterName, FVector Param);
    void SetUseAutoManageAttachment(bool bAutoManage);
    void SetIntParameter(FName ParameterName, int32 Param);
    void SetFloatParameter(FName ParameterName, float Param);
    void SetEmitterEnable(FName EmitterName, bool bNewEnableState);
    void SetColorParameter(FName ParameterName, FLinearColor Param);
    void SetBoolParameter(FName ParameterName, bool Param);
    void SetAutoAttachmentParameters(class USceneComponent* Parent, FName SocketName, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule);
    void SetActorParameter(FName ParameterName, class AActor* Param);
    void ReleaseToPool();
    class UFXSystemAsset* GetFXSystemAsset();
}; // Size: 0x450

class UFXSystemAsset : public UObject
{
    uint32 MaxPoolSize;                                                               // 0x0028 (size: 0x4)
    uint32 PoolPrimeSize;                                                             // 0x002C (size: 0x4)

}; // Size: 0x30

class UAnimNotify : public UObject
{

    bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation);
    FString GetNotifyName();
}; // Size: 0x38

class UAnimNotifyState : public UObject
{

    bool Received_NotifyTick(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float FrameDeltaTime);
    bool Received_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation);
    bool Received_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration);
    FString GetNotifyName();
}; // Size: 0x30

class USaveGame : public UObject
{
}; // Size: 0x28

class AInfo : public AActor
{
}; // Size: 0x228

class AGameModeBase : public AInfo
{
    FString OptionsString;                                                            // 0x0228 (size: 0x10)
    TSubclassOf<class AGameSession> GameSessionClass;                                 // 0x0238 (size: 0x8)
    TSubclassOf<class AGameStateBase> GameStateClass;                                 // 0x0240 (size: 0x8)
    TSubclassOf<class APlayerController> PlayerControllerClass;                       // 0x0248 (size: 0x8)
    TSubclassOf<class APlayerState> PlayerStateClass;                                 // 0x0250 (size: 0x8)
    TSubclassOf<class AHUD> HUDClass;                                                 // 0x0258 (size: 0x8)
    TSubclassOf<class APawn> DefaultPawnClass;                                        // 0x0260 (size: 0x8)
    TSubclassOf<class ASpectatorPawn> SpectatorClass;                                 // 0x0268 (size: 0x8)
    TSubclassOf<class APlayerController> ReplaySpectatorPlayerControllerClass;        // 0x0270 (size: 0x8)
    TSubclassOf<class AServerStatReplicator> ServerStatReplicatorClass;               // 0x0278 (size: 0x8)
    class AGameSession* GameSession;                                                  // 0x0280 (size: 0x8)
    class AGameStateBase* GameState;                                                  // 0x0288 (size: 0x8)
    class AServerStatReplicator* ServerStatReplicator;                                // 0x0290 (size: 0x8)
    FText DefaultPlayerName;                                                          // 0x0298 (size: 0x18)
    uint8 bUseSeamlessTravel;                                                         // 0x02B0 (size: 0x1)
    uint8 bStartPlayersAsSpectators;                                                  // 0x02B0 (size: 0x1)
    uint8 bPauseable;                                                                 // 0x02B0 (size: 0x1)

    void StartPlay();
    class APawn* SpawnDefaultPawnFor(class AController* NewPlayer, class AActor* StartSpot);
    class APawn* SpawnDefaultPawnAtTransform(class AController* NewPlayer, const FTransform& SpawnTransform);
    bool ShouldReset(class AActor* ActorToReset);
    void ReturnToMainMenuHost();
    void RestartPlayerAtTransform(class AController* NewPlayer, const FTransform& SpawnTransform);
    void RestartPlayerAtPlayerStart(class AController* NewPlayer, class AActor* StartSpot);
    void RestartPlayer(class AController* NewPlayer);
    void ResetLevel();
    bool PlayerCanRestart(class APlayerController* Player);
    bool MustSpectate(class APlayerController* NewPlayerController);
    void K2_PostLogin(class APlayerController* NewPlayer);
    void K2_OnSwapPlayerControllers(class APlayerController* OldPC, class APlayerController* NewPC);
    void K2_OnRestartPlayer(class AController* NewPlayer);
    void K2_OnLogout(class AController* ExitingController);
    void K2_OnChangeName(class AController* Other, FString NewName, bool bNameChange);
    class AActor* K2_FindPlayerStart(class AController* Player, FString IncomingName);
    void InitStartSpot(class AActor* StartSpot, class AController* NewPlayer);
    void InitializeHUDForPlayer(class APlayerController* NewPlayer);
    bool HasMatchStarted();
    bool HasMatchEnded();
    void HandleStartingNewPlayer(class APlayerController* NewPlayer);
    int32 GetNumSpectators();
    int32 GetNumPlayers();
    UClass* GetDefaultPawnClassForController(class AController* InController);
    class AActor* FindPlayerStart(class AController* Player, FString IncomingName);
    class AActor* ChoosePlayerStart(class AController* Player);
    void ChangeName(class AController* Controller, FString NewName, bool bNameChange);
    bool CanSpectate(class APlayerController* Viewer, class APlayerState* ViewTarget);
}; // Size: 0x2C8

class AGameMode : public AGameModeBase
{
    FName MatchState;                                                                 // 0x02C8 (size: 0x8)
    uint8 bDelayedStart;                                                              // 0x02D0 (size: 0x1)
    int32 NumSpectators;                                                              // 0x02D4 (size: 0x4)
    int32 NumPlayers;                                                                 // 0x02D8 (size: 0x4)
    int32 NumBots;                                                                    // 0x02DC (size: 0x4)
    float MinRespawnDelay;                                                            // 0x02E0 (size: 0x4)
    int32 NumTravellingPlayers;                                                       // 0x02E4 (size: 0x4)
    TSubclassOf<class ULocalMessage> EngineMessageClass;                              // 0x02E8 (size: 0x8)
    TArray<class APlayerState*> InactivePlayerArray;                                  // 0x02F0 (size: 0x10)
    float InactivePlayerStateLifeSpan;                                                // 0x0300 (size: 0x4)
    int32 MaxInactivePlayers;                                                         // 0x0304 (size: 0x4)
    bool bHandleDedicatedServerReplays;                                               // 0x0308 (size: 0x1)

    void StartMatch();
    void SetBandwidthLimit(float AsyncIOBandwidthLimit);
    void Say(FString Msg);
    void RestartGame();
    bool ReadyToStartMatch();
    bool ReadyToEndMatch();
    void K2_OnSetMatchState(FName NewState);
    bool IsMatchInProgress();
    FName GetMatchState();
    void EndMatch();
    void AbortMatch();
}; // Size: 0x310

class AGameStateBase : public AInfo
{
    TSubclassOf<class AGameModeBase> GameModeClass;                                   // 0x0228 (size: 0x8)
    class AGameModeBase* AuthorityGameMode;                                           // 0x0230 (size: 0x8)
    TSubclassOf<class ASpectatorPawn> SpectatorClass;                                 // 0x0238 (size: 0x8)
    TArray<class APlayerState*> PlayerArray;                                          // 0x0240 (size: 0x10)
    bool bReplicatedHasBegunPlay;                                                     // 0x0250 (size: 0x1)
    float ReplicatedWorldTimeSeconds;                                                 // 0x0254 (size: 0x4)
    float ServerWorldTimeSecondsDelta;                                                // 0x0258 (size: 0x4)
    float ServerWorldTimeSecondsUpdateFrequency;                                      // 0x025C (size: 0x4)

    void OnRep_SpectatorClass();
    void OnRep_ReplicatedWorldTimeSeconds();
    void OnRep_ReplicatedHasBegunPlay();
    void OnRep_GameModeClass();
    bool HasMatchStarted();
    bool HasMatchEnded();
    bool HasBegunPlay();
    float GetServerWorldTimeSeconds();
    float GetPlayerStartTime(class AController* Controller);
    float GetPlayerRespawnDelay(class AController* Controller);
}; // Size: 0x278

class AGameState : public AGameStateBase
{
    FName MatchState;                                                                 // 0x0278 (size: 0x8)
    FName PreviousMatchState;                                                         // 0x0280 (size: 0x8)
    int32 ElapsedTime;                                                                // 0x0288 (size: 0x4)

    void OnRep_MatchState();
    void OnRep_ElapsedTime();
}; // Size: 0x298

class UApplicationLifecycleComponent : public UActorComponent
{
    FApplicationLifecycleComponentApplicationWillDeactivateDelegate ApplicationWillDeactivateDelegate; // 0x00B0 (size: 0x10)
    void ApplicationLifetimeDelegate();
    FApplicationLifecycleComponentApplicationHasReactivatedDelegate ApplicationHasReactivatedDelegate; // 0x00C0 (size: 0x10)
    void ApplicationLifetimeDelegate();
    FApplicationLifecycleComponentApplicationWillEnterBackgroundDelegate ApplicationWillEnterBackgroundDelegate; // 0x00D0 (size: 0x10)
    void ApplicationLifetimeDelegate();
    FApplicationLifecycleComponentApplicationHasEnteredForegroundDelegate ApplicationHasEnteredForegroundDelegate; // 0x00E0 (size: 0x10)
    void ApplicationLifetimeDelegate();
    FApplicationLifecycleComponentApplicationWillTerminateDelegate ApplicationWillTerminateDelegate; // 0x00F0 (size: 0x10)
    void ApplicationLifetimeDelegate();
    FApplicationLifecycleComponentApplicationShouldUnloadResourcesDelegate ApplicationShouldUnloadResourcesDelegate; // 0x0100 (size: 0x10)
    void ApplicationLifetimeDelegate();
    FApplicationLifecycleComponentApplicationReceivedStartupArgumentsDelegate ApplicationReceivedStartupArgumentsDelegate; // 0x0110 (size: 0x10)
    void ApplicationStartupArgumentsDelegate(const TArray<FString>& StartupArguments);
    FApplicationLifecycleComponentOnTemperatureChangeDelegate OnTemperatureChangeDelegate; // 0x0120 (size: 0x10)
    void OnTemperatureChangeDelegate(ETemperatureSeverityType Severity);
    FApplicationLifecycleComponentOnLowPowerModeDelegate OnLowPowerModeDelegate;      // 0x0130 (size: 0x10)
    void OnLowPowerModeDelegate(bool bInLowPowerMode);

}; // Size: 0x140

class UDataAsset : public UObject
{
    TSubclassOf<class UDataAsset> NativeClass;                                        // 0x0028 (size: 0x8)

}; // Size: 0x30

class APawn : public AActor
{
    uint8 bUseControllerRotationPitch;                                                // 0x0230 (size: 0x1)
    uint8 bUseControllerRotationYaw;                                                  // 0x0230 (size: 0x1)
    uint8 bUseControllerRotationRoll;                                                 // 0x0230 (size: 0x1)
    uint8 bCanAffectNavigationGeneration;                                             // 0x0230 (size: 0x1)
    float BaseEyeHeight;                                                              // 0x0234 (size: 0x4)
    TEnumAsByte<EAutoReceiveInput::Type> AutoPossessPlayer;                           // 0x0238 (size: 0x1)
    EAutoPossessAI AutoPossessAI;                                                     // 0x0239 (size: 0x1)
    uint8 RemoteViewPitch;                                                            // 0x023A (size: 0x1)
    TSubclassOf<class AController> AIControllerClass;                                 // 0x0240 (size: 0x8)
    class APlayerState* PlayerState;                                                  // 0x0248 (size: 0x8)
    class AController* LastHitBy;                                                     // 0x0258 (size: 0x8)
    class AController* Controller;                                                    // 0x0260 (size: 0x8)
    FVector ControlInputVector;                                                       // 0x026C (size: 0xC)
    FVector LastControlInputVector;                                                   // 0x0278 (size: 0xC)

    void SpawnDefaultController();
    void SetCanAffectNavigationGeneration(bool bNewValue, bool bForceUpdate);
    void ReceiveUnpossessed(class AController* OldController);
    void ReceivePossessed(class AController* NewController);
    void PawnMakeNoise(float Loudness, FVector NoiseLocation, bool bUseNoiseMakerLocation, class AActor* NoiseMaker);
    void OnRep_PlayerState();
    void OnRep_Controller();
    void LaunchPawn(FVector LaunchVelocity, bool bXYOverride, bool bZOverride);
    FVector K2_GetMovementInputVector();
    bool IsPlayerControlled();
    bool IsPawnControlled();
    bool IsMoveInputIgnored();
    bool IsLocallyControlled();
    bool IsControlled();
    bool IsBotControlled();
    FVector GetPendingMovementInputVector();
    FVector GetNavAgentLocation();
    class UPawnMovementComponent* GetMovementComponent();
    class AActor* GetMovementBaseActor(const class APawn* Pawn);
    FVector GetLastMovementInputVector();
    FRotator GetControlRotation();
    class AController* GetController();
    FRotator GetBaseAimRotation();
    void DetachFromControllerPendingDestroy();
    FVector ConsumeMovementInputVector();
    void AddMovementInput(FVector WorldDirection, float ScaleValue, bool bForce);
    void AddControllerYawInput(float Val);
    void AddControllerRollInput(float Val);
    void AddControllerPitchInput(float Val);
}; // Size: 0x288

struct FBasedMovementInfo
{
    class UPrimitiveComponent* MovementBase;                                          // 0x0000 (size: 0x8)
    FName BoneName;                                                                   // 0x0008 (size: 0x8)
    FVector_NetQuantize100 Location;                                                  // 0x0010 (size: 0xC)
    FRotator Rotation;                                                                // 0x001C (size: 0xC)
    bool bServerHasBaseComponent;                                                     // 0x0028 (size: 0x1)
    bool bRelativeRotation;                                                           // 0x0029 (size: 0x1)
    bool bServerHasVelocity;                                                          // 0x002A (size: 0x1)

}; // Size: 0x30

struct FRootMotionSourceSettings
{
    uint8 Flags;                                                                      // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FVector_NetQuantize10 : public FVector
{
}; // Size: 0xC

struct FRootMotionSourceGroup
{
    uint8 bHasAdditiveSources;                                                        // 0x0028 (size: 0x1)
    uint8 bHasOverrideSources;                                                        // 0x0028 (size: 0x1)
    uint8 bHasOverrideSourcesWithIgnoreZAccumulate;                                   // 0x0028 (size: 0x1)
    uint8 bIsAdditiveVelocityApplied;                                                 // 0x0028 (size: 0x1)
    FRootMotionSourceSettings LastAccumulatedSettings;                                // 0x0029 (size: 0x1)
    FVector_NetQuantize10 LastPreAdditiveVelocity;                                    // 0x002C (size: 0xC)

}; // Size: 0x38

struct FRootMotionMovementParams
{
    bool bHasRootMotion;                                                              // 0x0000 (size: 0x1)
    float BlendWeight;                                                                // 0x0004 (size: 0x4)
    FTransform RootMotionTransform;                                                   // 0x0010 (size: 0x30)

}; // Size: 0x40

struct FRepRootMotionMontage
{
    bool bIsActive;                                                                   // 0x0000 (size: 0x1)
    class UAnimMontage* AnimMontage;                                                  // 0x0008 (size: 0x8)
    float Position;                                                                   // 0x0010 (size: 0x4)
    FVector_NetQuantize100 Location;                                                  // 0x0014 (size: 0xC)
    FRotator Rotation;                                                                // 0x0020 (size: 0xC)
    class UPrimitiveComponent* MovementBase;                                          // 0x0030 (size: 0x8)
    FName MovementBaseBoneName;                                                       // 0x0038 (size: 0x8)
    bool bRelativePosition;                                                           // 0x0040 (size: 0x1)
    bool bRelativeRotation;                                                           // 0x0041 (size: 0x1)
    FRootMotionSourceGroup AuthoritativeRootMotion;                                   // 0x0048 (size: 0x38)
    FVector_NetQuantize10 Acceleration;                                               // 0x0080 (size: 0xC)
    FVector_NetQuantize10 LinearVelocity;                                             // 0x008C (size: 0xC)

}; // Size: 0x98

struct FSimulatedRootMotionReplicatedMove
{
    float Time;                                                                       // 0x0000 (size: 0x4)
    FRepRootMotionMontage RootMotion;                                                 // 0x0008 (size: 0x98)

}; // Size: 0xA0

struct FCharacterNetworkSerializationPackedBits
{
}; // Size: 0x98

struct FCharacterServerMovePackedBits : public FCharacterNetworkSerializationPackedBits
{
}; // Size: 0x98

struct FCharacterMoveResponsePackedBits : public FCharacterNetworkSerializationPackedBits
{
}; // Size: 0x98

class ACharacter : public APawn
{
    class USkeletalMeshComponent* Mesh;                                               // 0x0288 (size: 0x8)
    class UCharacterMovementComponent* CharacterMovement;                             // 0x0290 (size: 0x8)
    class UCapsuleComponent* CapsuleComponent;                                        // 0x0298 (size: 0x8)
    FBasedMovementInfo BasedMovement;                                                 // 0x02A0 (size: 0x30)
    FBasedMovementInfo ReplicatedBasedMovement;                                       // 0x02D0 (size: 0x30)
    float AnimRootMotionTranslationScale;                                             // 0x0300 (size: 0x4)
    FVector BaseTranslationOffset;                                                    // 0x0304 (size: 0xC)
    FQuat BaseRotationOffset;                                                         // 0x0310 (size: 0x10)
    float ReplicatedServerLastTransformUpdateTimeStamp;                               // 0x0320 (size: 0x4)
    float ReplayLastTransformUpdateTimeStamp;                                         // 0x0324 (size: 0x4)
    uint8 ReplicatedMovementMode;                                                     // 0x0328 (size: 0x1)
    bool bInBaseReplication;                                                          // 0x0329 (size: 0x1)
    float CrouchedEyeHeight;                                                          // 0x032C (size: 0x4)
    uint8 bIsCrouched;                                                                // 0x0330 (size: 0x1)
    uint8 bProxyIsJumpForceApplied;                                                   // 0x0330 (size: 0x1)
    uint8 bPressedJump;                                                               // 0x0330 (size: 0x1)
    uint8 bClientUpdating;                                                            // 0x0330 (size: 0x1)
    uint8 bClientWasFalling;                                                          // 0x0330 (size: 0x1)
    uint8 bClientResimulateRootMotion;                                                // 0x0330 (size: 0x1)
    uint8 bClientResimulateRootMotionSources;                                         // 0x0330 (size: 0x1)
    uint8 bSimGravityDisabled;                                                        // 0x0330 (size: 0x1)
    uint8 bClientCheckEncroachmentOnNetUpdate;                                        // 0x0331 (size: 0x1)
    uint8 bServerMoveIgnoreRootMotion;                                                // 0x0331 (size: 0x1)
    uint8 bWasJumping;                                                                // 0x0331 (size: 0x1)
    float JumpKeyHoldTime;                                                            // 0x0334 (size: 0x4)
    float JumpForceTimeRemaining;                                                     // 0x0338 (size: 0x4)
    float ProxyJumpForceStartedTime;                                                  // 0x033C (size: 0x4)
    float JumpMaxHoldTime;                                                            // 0x0340 (size: 0x4)
    int32 JumpMaxCount;                                                               // 0x0344 (size: 0x4)
    int32 JumpCurrentCount;                                                           // 0x0348 (size: 0x4)
    int32 JumpCurrentCountPreJump;                                                    // 0x034C (size: 0x4)
    FCharacterOnReachedJumpApex OnReachedJumpApex;                                    // 0x0358 (size: 0x10)
    void CharacterReachedApexSignature();
    FCharacterMovementModeChangedDelegate MovementModeChangedDelegate;                // 0x0378 (size: 0x10)
    void MovementModeChangedSignature(class ACharacter* Character, TEnumAsByte<EMovementMode> PrevMovementMode, uint8 PreviousCustomMode);
    FCharacterOnCharacterMovementUpdated OnCharacterMovementUpdated;                  // 0x0388 (size: 0x10)
    void CharacterMovementUpdatedSignature(float DeltaSeconds, FVector OldLocation, FVector OldVelocity);
    FRootMotionSourceGroup SavedRootMotion;                                           // 0x0398 (size: 0x38)
    FRootMotionMovementParams ClientRootMotionParams;                                 // 0x03D0 (size: 0x40)
    TArray<FSimulatedRootMotionReplicatedMove> RootMotionRepMoves;                    // 0x0410 (size: 0x10)
    FRepRootMotionMontage RepRootMotion;                                              // 0x0420 (size: 0x98)

    void UnCrouch(bool bClientSimulation);
    void StopJumping();
    void StopAnimMontage(class UAnimMontage* AnimMontage);
    void ServerMovePacked(const FCharacterServerMovePackedBits& PackedBits);
    void ServerMoveOld(float OldTimeStamp, FVector_NetQuantize10 OldAccel, uint8 OldMoveFlags);
    void ServerMoveNoBase(float Timestamp, FVector_NetQuantize10 InAccel, FVector_NetQuantize100 ClientLoc, uint8 CompressedMoveFlags, uint8 ClientRoll, uint32 View, uint8 ClientMovementMode);
    void ServerMoveDualNoBase(float TimeStamp0, FVector_NetQuantize10 InAccel0, uint8 PendingFlags, uint32 View0, float Timestamp, FVector_NetQuantize10 InAccel, FVector_NetQuantize100 ClientLoc, uint8 NewFlags, uint8 ClientRoll, uint32 View, uint8 ClientMovementMode);
    void ServerMoveDualHybridRootMotion(float TimeStamp0, FVector_NetQuantize10 InAccel0, uint8 PendingFlags, uint32 View0, float Timestamp, FVector_NetQuantize10 InAccel, FVector_NetQuantize100 ClientLoc, uint8 NewFlags, uint8 ClientRoll, uint32 View, class UPrimitiveComponent* ClientMovementBase, FName ClientBaseBoneName, uint8 ClientMovementMode);
    void ServerMoveDual(float TimeStamp0, FVector_NetQuantize10 InAccel0, uint8 PendingFlags, uint32 View0, float Timestamp, FVector_NetQuantize10 InAccel, FVector_NetQuantize100 ClientLoc, uint8 NewFlags, uint8 ClientRoll, uint32 View, class UPrimitiveComponent* ClientMovementBase, FName ClientBaseBoneName, uint8 ClientMovementMode);
    void ServerMove(float Timestamp, FVector_NetQuantize10 InAccel, FVector_NetQuantize100 ClientLoc, uint8 CompressedMoveFlags, uint8 ClientRoll, uint32 View, class UPrimitiveComponent* ClientMovementBase, FName ClientBaseBoneName, uint8 ClientMovementMode);
    void RootMotionDebugClientPrintOnScreen(FString inString);
    float PlayAnimMontage(class UAnimMontage* AnimMontage, float InPlayRate, FName StartSectionName);
    void OnWalkingOffLedge(const FVector& PreviousFloorImpactNormal, const FVector& PreviousFloorContactNormal, const FVector& PreviousLocation, float TimeDelta);
    void OnRep_RootMotion();
    void OnRep_ReplicatedBasedMovement();
    void OnRep_ReplayLastTransformUpdateTimeStamp();
    void OnRep_IsCrouched();
    void OnLaunched(FVector LaunchVelocity, bool bXYOverride, bool bZOverride);
    void OnLanded(const FHitResult& Hit);
    void OnJumped();
    void LaunchCharacter(FVector LaunchVelocity, bool bXYOverride, bool bZOverride);
    void K2_UpdateCustomMovement(float DeltaTime);
    void K2_OnStartCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust);
    void K2_OnMovementModeChanged(TEnumAsByte<EMovementMode> PrevMovementMode, TEnumAsByte<EMovementMode> NewMovementMode, uint8 PrevCustomMode, uint8 NewCustomMode);
    void K2_OnEndCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust);
    void Jump();
    bool IsPlayingRootMotion();
    bool IsPlayingNetworkedRootMotionMontage();
    bool IsJumpProvidingForce();
    bool HasAnyRootMotion();
    class UAnimMontage* GetCurrentMontage();
    FVector GetBaseTranslationOffset();
    FRotator GetBaseRotationOffsetRotator();
    float GetAnimRootMotionTranslationScale();
    void Crouch(bool bClientSimulation);
    void ClientVeryShortAdjustPosition(float Timestamp, FVector NewLoc, class UPrimitiveComponent* NewBase, FName NewBaseBoneName, bool bHasBase, bool bBaseRelativePosition, uint8 ServerMovementMode);
    void ClientMoveResponsePacked(const FCharacterMoveResponsePackedBits& PackedBits);
    void ClientCheatWalk();
    void ClientCheatGhost();
    void ClientCheatFly();
    void ClientAdjustRootMotionSourcePosition(float Timestamp, FRootMotionSourceGroup ServerRootMotion, bool bHasAnimRootMotion, float ServerMontageTrackPosition, FVector ServerLoc, FVector_NetQuantizeNormal ServerRotation, float ServerVelZ, class UPrimitiveComponent* ServerBase, FName ServerBoneName, bool bHasBase, bool bBaseRelativePosition, uint8 ServerMovementMode);
    void ClientAdjustRootMotionPosition(float Timestamp, float ServerMontageTrackPosition, FVector ServerLoc, FVector_NetQuantizeNormal ServerRotation, float ServerVelZ, class UPrimitiveComponent* ServerBase, FName ServerBoneName, bool bHasBase, bool bBaseRelativePosition, uint8 ServerMovementMode);
    void ClientAdjustPosition(float Timestamp, FVector NewLoc, FVector NewVel, class UPrimitiveComponent* NewBase, FName NewBaseBoneName, bool bHasBase, bool bBaseRelativePosition, uint8 ServerMovementMode);
    void ClientAckGoodMove(float Timestamp);
    bool CanJumpInternal();
    bool CanJump();
    bool CanCrouch();
    void CacheInitialMeshOffset(FVector MeshRelativeLocation, FRotator MeshRelativeRotation);
}; // Size: 0x4C0

class UMovementComponent : public UActorComponent
{
    class USceneComponent* UpdatedComponent;                                          // 0x00B0 (size: 0x8)
    class UPrimitiveComponent* UpdatedPrimitive;                                      // 0x00B8 (size: 0x8)
    FVector Velocity;                                                                 // 0x00C4 (size: 0xC)
    FVector PlaneConstraintNormal;                                                    // 0x00D0 (size: 0xC)
    FVector PlaneConstraintOrigin;                                                    // 0x00DC (size: 0xC)
    uint8 bUpdateOnlyIfRendered;                                                      // 0x00E8 (size: 0x1)
    uint8 bAutoUpdateTickRegistration;                                                // 0x00E8 (size: 0x1)
    uint8 bTickBeforeOwner;                                                           // 0x00E8 (size: 0x1)
    uint8 bAutoRegisterUpdatedComponent;                                              // 0x00E8 (size: 0x1)
    uint8 bConstrainToPlane;                                                          // 0x00E8 (size: 0x1)
    uint8 bSnapToPlaneAtStart;                                                        // 0x00E8 (size: 0x1)
    uint8 bAutoRegisterPhysicsVolumeUpdates;                                          // 0x00E8 (size: 0x1)
    uint8 bComponentShouldUpdatePhysicsVolume;                                        // 0x00E8 (size: 0x1)
    EPlaneConstraintAxisSetting PlaneConstraintAxisSetting;                           // 0x00EB (size: 0x1)

    void StopMovementImmediately();
    void SnapUpdatedComponentToPlane();
    void SetUpdatedComponent(class USceneComponent* NewUpdatedComponent);
    void SetPlaneConstraintOrigin(FVector PlaneOrigin);
    void SetPlaneConstraintNormal(FVector PlaneNormal);
    void SetPlaneConstraintFromVectors(FVector Forward, FVector Up);
    void SetPlaneConstraintEnabled(bool bEnabled);
    void SetPlaneConstraintAxisSetting(EPlaneConstraintAxisSetting NewAxisSetting);
    void PhysicsVolumeChanged(class APhysicsVolume* NewVolume);
    bool K2_MoveUpdatedComponent(FVector Delta, FRotator NewRotation, FHitResult& OutHit, bool bSweep, bool bTeleport);
    float K2_GetModifiedMaxSpeed();
    float K2_GetMaxSpeedModifier();
    bool IsExceedingMaxSpeed(float MaxSpeed);
    FVector GetPlaneConstraintOrigin();
    FVector GetPlaneConstraintNormal();
    EPlaneConstraintAxisSetting GetPlaneConstraintAxisSetting();
    class APhysicsVolume* GetPhysicsVolume();
    float GetMaxSpeed();
    float GetGravityZ();
    FVector ConstrainNormalToPlane(FVector Normal);
    FVector ConstrainLocationToPlane(FVector Location);
    FVector ConstrainDirectionToPlane(FVector Direction);
}; // Size: 0xF0

struct FMovementProperties
{
    uint8 bCanCrouch;                                                                 // 0x0000 (size: 0x1)
    uint8 bCanJump;                                                                   // 0x0000 (size: 0x1)
    uint8 bCanWalk;                                                                   // 0x0000 (size: 0x1)
    uint8 bCanSwim;                                                                   // 0x0000 (size: 0x1)
    uint8 bCanFly;                                                                    // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FNavAgentProperties : public FMovementProperties
{
    float AgentRadius;                                                                // 0x0004 (size: 0x4)
    float AgentHeight;                                                                // 0x0008 (size: 0x4)
    float AgentStepHeight;                                                            // 0x000C (size: 0x4)
    float NavWalkingSearchHeightScale;                                                // 0x0010 (size: 0x4)
    FSoftClassPath PreferredNavData;                                                  // 0x0018 (size: 0x18)

}; // Size: 0x30

class UNavMovementComponent : public UMovementComponent
{
    FNavAgentProperties NavAgentProps;                                                // 0x00F0 (size: 0x30)
    float FixedPathBrakingDistance;                                                   // 0x0120 (size: 0x4)
    uint8 bUpdateNavAgentWithOwnersCollision;                                         // 0x0124 (size: 0x1)
    uint8 bUseAccelerationForPaths;                                                   // 0x0124 (size: 0x1)
    uint8 bUseFixedBrakingDistanceForPaths;                                           // 0x0124 (size: 0x1)
    FMovementProperties MovementState;                                                // 0x0125 (size: 0x1)
    class UObject* PathFollowingComp;                                                 // 0x0128 (size: 0x8)

    void StopMovementKeepPathing();
    void StopActiveMovement();
    bool IsSwimming();
    bool IsMovingOnGround();
    bool IsFlying();
    bool IsFalling();
    bool IsCrouching();
}; // Size: 0x130

class UPawnMovementComponent : public UNavMovementComponent
{
    class APawn* PawnOwner;                                                           // 0x0130 (size: 0x8)

    FVector K2_GetInputVector();
    bool IsMoveInputIgnored();
    FVector GetPendingInputVector();
    class APawn* GetPawnOwner();
    FVector GetLastInputVector();
    FVector ConsumeInputVector();
    void AddInputVector(FVector WorldVector, bool bForce);
}; // Size: 0x138

struct FFindFloorResult
{
    uint8 bBlockingHit;                                                               // 0x0000 (size: 0x1)
    uint8 bWalkableFloor;                                                             // 0x0000 (size: 0x1)
    uint8 bLineTrace;                                                                 // 0x0000 (size: 0x1)
    float FloorDist;                                                                  // 0x0004 (size: 0x4)
    float LineDist;                                                                   // 0x0008 (size: 0x4)
    FHitResult HitResult;                                                             // 0x000C (size: 0x88)

}; // Size: 0x94

struct FNavAvoidanceMask
{
    uint8 bGroup0;                                                                    // 0x0000 (size: 0x1)
    uint8 bGroup1;                                                                    // 0x0000 (size: 0x1)
    uint8 bGroup2;                                                                    // 0x0000 (size: 0x1)
    uint8 bGroup3;                                                                    // 0x0000 (size: 0x1)
    uint8 bGroup4;                                                                    // 0x0000 (size: 0x1)
    uint8 bGroup5;                                                                    // 0x0000 (size: 0x1)
    uint8 bGroup6;                                                                    // 0x0000 (size: 0x1)
    uint8 bGroup7;                                                                    // 0x0000 (size: 0x1)
    uint8 bGroup8;                                                                    // 0x0001 (size: 0x1)
    uint8 bGroup9;                                                                    // 0x0001 (size: 0x1)
    uint8 bGroup10;                                                                   // 0x0001 (size: 0x1)
    uint8 bGroup11;                                                                   // 0x0001 (size: 0x1)
    uint8 bGroup12;                                                                   // 0x0001 (size: 0x1)
    uint8 bGroup13;                                                                   // 0x0001 (size: 0x1)
    uint8 bGroup14;                                                                   // 0x0001 (size: 0x1)
    uint8 bGroup15;                                                                   // 0x0001 (size: 0x1)
    uint8 bGroup16;                                                                   // 0x0002 (size: 0x1)
    uint8 bGroup17;                                                                   // 0x0002 (size: 0x1)
    uint8 bGroup18;                                                                   // 0x0002 (size: 0x1)
    uint8 bGroup19;                                                                   // 0x0002 (size: 0x1)
    uint8 bGroup20;                                                                   // 0x0002 (size: 0x1)
    uint8 bGroup21;                                                                   // 0x0002 (size: 0x1)
    uint8 bGroup22;                                                                   // 0x0002 (size: 0x1)
    uint8 bGroup23;                                                                   // 0x0002 (size: 0x1)
    uint8 bGroup24;                                                                   // 0x0003 (size: 0x1)
    uint8 bGroup25;                                                                   // 0x0003 (size: 0x1)
    uint8 bGroup26;                                                                   // 0x0003 (size: 0x1)
    uint8 bGroup27;                                                                   // 0x0003 (size: 0x1)
    uint8 bGroup28;                                                                   // 0x0003 (size: 0x1)
    uint8 bGroup29;                                                                   // 0x0003 (size: 0x1)
    uint8 bGroup30;                                                                   // 0x0003 (size: 0x1)
    uint8 bGroup31;                                                                   // 0x0003 (size: 0x1)

}; // Size: 0x4

struct FCharacterMovementComponentPostPhysicsTickFunction : public FTickFunction
{
}; // Size: 0x30

class UCharacterMovementComponent : public UPawnMovementComponent
{
    class ACharacter* CharacterOwner;                                                 // 0x0148 (size: 0x8)
    float GravityScale;                                                               // 0x0150 (size: 0x4)
    float MaxStepHeight;                                                              // 0x0154 (size: 0x4)
    float JumpZVelocity;                                                              // 0x0158 (size: 0x4)
    float JumpOffJumpZFactor;                                                         // 0x015C (size: 0x4)
    float WalkableFloorAngle;                                                         // 0x0160 (size: 0x4)
    float WalkableFloorZ;                                                             // 0x0164 (size: 0x4)
    TEnumAsByte<EMovementMode> MovementMode;                                          // 0x0168 (size: 0x1)
    uint8 CustomMovementMode;                                                         // 0x0169 (size: 0x1)
    ENetworkSmoothingMode NetworkSmoothingMode;                                       // 0x016A (size: 0x1)
    float GroundFriction;                                                             // 0x016C (size: 0x4)
    float MaxWalkSpeed;                                                               // 0x018C (size: 0x4)
    float MaxWalkSpeedCrouched;                                                       // 0x0190 (size: 0x4)
    float MaxSwimSpeed;                                                               // 0x0194 (size: 0x4)
    float MaxFlySpeed;                                                                // 0x0198 (size: 0x4)
    float MaxCustomMovementSpeed;                                                     // 0x019C (size: 0x4)
    float MaxAcceleration;                                                            // 0x01A0 (size: 0x4)
    float MinAnalogWalkSpeed;                                                         // 0x01A4 (size: 0x4)
    float BrakingFrictionFactor;                                                      // 0x01A8 (size: 0x4)
    float BrakingFriction;                                                            // 0x01AC (size: 0x4)
    float BrakingSubStepTime;                                                         // 0x01B0 (size: 0x4)
    float BrakingDecelerationWalking;                                                 // 0x01B4 (size: 0x4)
    float BrakingDecelerationFalling;                                                 // 0x01B8 (size: 0x4)
    float BrakingDecelerationSwimming;                                                // 0x01BC (size: 0x4)
    float BrakingDecelerationFlying;                                                  // 0x01C0 (size: 0x4)
    float AirControl;                                                                 // 0x01C4 (size: 0x4)
    float AirControlBoostMultiplier;                                                  // 0x01C8 (size: 0x4)
    float AirControlBoostVelocityThreshold;                                           // 0x01CC (size: 0x4)
    float FallingLateralFriction;                                                     // 0x01D0 (size: 0x4)
    float CrouchedHalfHeight;                                                         // 0x01D4 (size: 0x4)
    float Buoyancy;                                                                   // 0x01D8 (size: 0x4)
    float PerchRadiusThreshold;                                                       // 0x01DC (size: 0x4)
    float PerchAdditionalHeight;                                                      // 0x01E0 (size: 0x4)
    FRotator RotationRate;                                                            // 0x01E4 (size: 0xC)
    uint8 bUseSeparateBrakingFriction;                                                // 0x01F0 (size: 0x1)
    uint8 bApplyGravityWhileJumping;                                                  // 0x01F0 (size: 0x1)
    uint8 bUseControllerDesiredRotation;                                              // 0x01F0 (size: 0x1)
    uint8 bOrientRotationToMovement;                                                  // 0x01F0 (size: 0x1)
    uint8 bSweepWhileNavWalking;                                                      // 0x01F0 (size: 0x1)
    uint8 bMovementInProgress;                                                        // 0x01F0 (size: 0x1)
    uint8 bEnableScopedMovementUpdates;                                               // 0x01F0 (size: 0x1)
    uint8 bEnableServerDualMoveScopedMovementUpdates;                                 // 0x01F1 (size: 0x1)
    uint8 bForceMaxAccel;                                                             // 0x01F1 (size: 0x1)
    uint8 bRunPhysicsWithNoController;                                                // 0x01F1 (size: 0x1)
    uint8 bForceNextFloorCheck;                                                       // 0x01F1 (size: 0x1)
    uint8 bShrinkProxyCapsule;                                                        // 0x01F1 (size: 0x1)
    uint8 bCanWalkOffLedges;                                                          // 0x01F1 (size: 0x1)
    uint8 bCanWalkOffLedgesWhenCrouching;                                             // 0x01F1 (size: 0x1)
    uint8 bNetworkSkipProxyPredictionOnNetUpdate;                                     // 0x01F2 (size: 0x1)
    uint8 bNetworkAlwaysReplicateTransformUpdateTimestamp;                            // 0x01F2 (size: 0x1)
    uint8 bDeferUpdateMoveComponent;                                                  // 0x01F2 (size: 0x1)
    uint8 bEnablePhysicsInteraction;                                                  // 0x01F2 (size: 0x1)
    uint8 bTouchForceScaledToMass;                                                    // 0x01F2 (size: 0x1)
    uint8 bPushForceScaledToMass;                                                     // 0x01F2 (size: 0x1)
    uint8 bPushForceUsingZOffset;                                                     // 0x01F2 (size: 0x1)
    uint8 bScalePushForceToVelocity;                                                  // 0x01F3 (size: 0x1)
    class USceneComponent* DeferredUpdatedMoveComponent;                              // 0x01F8 (size: 0x8)
    float MaxOutOfWaterStepHeight;                                                    // 0x0200 (size: 0x4)
    float OutofWaterZ;                                                                // 0x0204 (size: 0x4)
    float Mass;                                                                       // 0x0208 (size: 0x4)
    float StandingDownwardForceScale;                                                 // 0x020C (size: 0x4)
    float InitialPushForceFactor;                                                     // 0x0210 (size: 0x4)
    float PushForceFactor;                                                            // 0x0214 (size: 0x4)
    float PushForcePointZOffsetFactor;                                                // 0x0218 (size: 0x4)
    float TouchForceFactor;                                                           // 0x021C (size: 0x4)
    float MinTouchForce;                                                              // 0x0220 (size: 0x4)
    float MaxTouchForce;                                                              // 0x0224 (size: 0x4)
    float RepulsionForce;                                                             // 0x0228 (size: 0x4)
    FVector Acceleration;                                                             // 0x022C (size: 0xC)
    FQuat LastUpdateRotation;                                                         // 0x0240 (size: 0x10)
    FVector LastUpdateLocation;                                                       // 0x0250 (size: 0xC)
    FVector LastUpdateVelocity;                                                       // 0x025C (size: 0xC)
    float ServerLastTransformUpdateTimeStamp;                                         // 0x0268 (size: 0x4)
    float ServerLastClientGoodMoveAckTime;                                            // 0x026C (size: 0x4)
    float ServerLastClientAdjustmentTime;                                             // 0x0270 (size: 0x4)
    FVector PendingImpulseToApply;                                                    // 0x0274 (size: 0xC)
    FVector PendingForceToApply;                                                      // 0x0280 (size: 0xC)
    float AnalogInputModifier;                                                        // 0x028C (size: 0x4)
    float MaxSimulationTimeStep;                                                      // 0x029C (size: 0x4)
    int32 MaxSimulationIterations;                                                    // 0x02A0 (size: 0x4)
    int32 MaxJumpApexAttemptsPerSimulation;                                           // 0x02A4 (size: 0x4)
    float MaxDepenetrationWithGeometry;                                               // 0x02A8 (size: 0x4)
    float MaxDepenetrationWithGeometryAsProxy;                                        // 0x02AC (size: 0x4)
    float MaxDepenetrationWithPawn;                                                   // 0x02B0 (size: 0x4)
    float MaxDepenetrationWithPawnAsProxy;                                            // 0x02B4 (size: 0x4)
    float NetworkSimulatedSmoothLocationTime;                                         // 0x02B8 (size: 0x4)
    float NetworkSimulatedSmoothRotationTime;                                         // 0x02BC (size: 0x4)
    float ListenServerNetworkSimulatedSmoothLocationTime;                             // 0x02C0 (size: 0x4)
    float ListenServerNetworkSimulatedSmoothRotationTime;                             // 0x02C4 (size: 0x4)
    float NetProxyShrinkRadius;                                                       // 0x02C8 (size: 0x4)
    float NetProxyShrinkHalfHeight;                                                   // 0x02CC (size: 0x4)
    float NetworkMaxSmoothUpdateDistance;                                             // 0x02D0 (size: 0x4)
    float NetworkNoSmoothUpdateDistance;                                              // 0x02D4 (size: 0x4)
    float NetworkMinTimeBetweenClientAckGoodMoves;                                    // 0x02D8 (size: 0x4)
    float NetworkMinTimeBetweenClientAdjustments;                                     // 0x02DC (size: 0x4)
    float NetworkMinTimeBetweenClientAdjustmentsLargeCorrection;                      // 0x02E0 (size: 0x4)
    float NetworkLargeClientCorrectionDistance;                                       // 0x02E4 (size: 0x4)
    float LedgeCheckThreshold;                                                        // 0x02E8 (size: 0x4)
