#ifndef UE4SS_SDK_FullAdventureState_HPP
#define UE4SS_SDK_FullAdventureState_HPP

struct FFullAdventureState
{
    ENUM_ChaptersAdvStates Chapter_38_346BDF864FBECC6BC5F32B937FD2D66F;               // 0x0000 (size: 0x1)
    ENUM_B12FlatAdvStates B12Flat_2_189E9C1447F7D1CCE4111EB1DC53C158;                 // 0x0001 (size: 0x1)
    ENUM_SlumsPart1AdvStates SlumsPart1_5_C9FB9557440AAC382C1C269DFCBDFEB3;           // 0x0002 (size: 0x1)
    ENUM_RooftopsAdvStates Rooftops_8_3105828E4EB14129DF841486C2DAF8B3;               // 0x0003 (size: 0x1)
    ENUM_SlumsPart2AdvStates SlumsPart2_11_73553BE941FFF398186E76802B677F24;          // 0x0004 (size: 0x1)
    ENUM_DeadEndAdvStates DeadEnd_14_DD8E9787484FF41EA85D9EAB4D3DAC4B;                // 0x0005 (size: 0x1)
    ENUM_SewersAdvStates Sewers_17_3E0C51B94CAF6755C142A9A74DA52875;                  // 0x0006 (size: 0x1)
    ENUM_AntVillageAdvStates AntVillage_20_F52EE7714F24FCD7E495DCB7800184A2;          // 0x0007 (size: 0x1)
    ENUM_MidtownPart1AdvStates MidtownPart1_23_26C2EC964D0B4D082837FBB5E5A0830E;      // 0x0008 (size: 0x1)
    ENUM_FactoryAdvStates Factory_26_C2C1AACD4312A8CBE8EA4BB4A81E8B4F;                // 0x0009 (size: 0x1)
    ENUM_MidtownPart2AdvStates MidtownPart2_29_351073B644EF0AA9B57384AA38DC287B;      // 0x000A (size: 0x1)
    ENUM_JailAdvStates Jail_32_DDE8EAD94581BDBB459FE7BEABCDA7F8;                      // 0x000B (size: 0x1)
    ENUM_CleanCityAdvStates CleanCity_35_75B22A18440E49DE497C0D9407C85FDE;            // 0x000C (size: 0x1)

}; // Size: 0xD

#endif
