#ifndef UE4SS_SDK_G_Int_Shop_Stuff01_HPP
#define UE4SS_SDK_G_Int_Shop_Stuff01_HPP

class AG_Int_Shop_Stuff01_C : public AActor
{
    class UStaticMeshComponent* StaticMeshComponent044;                               // 0x0228 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent043;                               // 0x0230 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent042;                               // 0x0238 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent041;                               // 0x0240 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent040;                               // 0x0248 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent033;                               // 0x0250 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent038;                               // 0x0258 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent037;                               // 0x0260 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent036;                               // 0x0268 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent035;                               // 0x0270 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent034;                               // 0x0278 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent039;                               // 0x0280 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent030;                               // 0x0288 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent029;                               // 0x0290 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent028;                               // 0x0298 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent027;                               // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent026;                               // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent025;                               // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent024;                               // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent023;                               // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent022;                               // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent021;                               // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent014;                               // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent019;                               // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent018;                               // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent017;                               // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent016;                               // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent015;                               // 0x0300 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent031;                               // 0x0308 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent013;                               // 0x0310 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent012;                               // 0x0318 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent011;                               // 0x0320 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent010;                               // 0x0328 (size: 0x8)
    class UPointLightComponent* LightComponent0;                                      // 0x0330 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent09;                                // 0x0338 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent08;                                // 0x0340 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent07;                                // 0x0348 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent06;                                // 0x0350 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent05;                                // 0x0358 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent04;                                // 0x0360 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent03;                                // 0x0368 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent02;                                // 0x0370 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent01;                                // 0x0378 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0;                                 // 0x0380 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent020;                               // 0x0388 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent032;                               // 0x0390 (size: 0x8)
    class USceneComponent* SharedRoot;                                                // 0x0398 (size: 0x8)

}; // Size: 0x3A0

#endif
