#ifndef UE4SS_SDK_G_Stairs_type_10_HPP
#define UE4SS_SDK_G_Stairs_type_10_HPP

class AG_Stairs_type_10_C : public AActor
{
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0228 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0230 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0238 (size: 0x8)
    class UStaticMeshComponent* Collider_top;                                         // 0x0240 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent06;                                // 0x0248 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent05;                                // 0x0250 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent02;                                // 0x0258 (size: 0x8)
    class USceneComponent* SharedRoot;                                                // 0x0260 (size: 0x8)

}; // Size: 0x268

#endif
