#ifndef UE4SS_SDK_PF_Wanted_Screen_HPP
#define UE4SS_SDK_PF_Wanted_Screen_HPP

class APF_Wanted_Screen_C : public AActor
{
    class UStaticMeshComponent* Sign_02_B6;                                           // 0x0228 (size: 0x8)
    class UStaticMeshComponent* Sign_02_B5;                                           // 0x0230 (size: 0x8)
    class UStaticMeshComponent* Sign_02_B4;                                           // 0x0238 (size: 0x8)
    class UStaticMeshComponent* Sign_02_B3;                                           // 0x0240 (size: 0x8)
    class UStaticMeshComponent* Sign_02_B2;                                           // 0x0248 (size: 0x8)
    class UStaticMeshComponent* Sign_02_B1;                                           // 0x0250 (size: 0x8)
    class UStaticMeshComponent* Sign_02_B;                                            // 0x0258 (size: 0x8)
    class UTalkableComponent* talkable;                                               // 0x0260 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0268 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0270 (size: 0x8)

}; // Size: 0x278

#endif
