#ifndef UE4SS_SDK_Rooftop_SlumHouse_Flat_Small_OLD1_HPP
#define UE4SS_SDK_Rooftop_SlumHouse_Flat_Small_OLD1_HPP

class ARooftop_SlumHouse_Flat_Small_OLD1_C : public AActor
{
    class UChildActorComponent* PropsHall_Structure_Metalbar65;                       // 0x0228 (size: 0x8)
    class UStaticMeshComponent* WoodPlane08;                                          // 0x0230 (size: 0x8)
    class UStaticMeshComponent* curtains01_Curtains01_03;                             // 0x0238 (size: 0x8)
    class UStaticMeshComponent* E;                                                    // 0x0240 (size: 0x8)
    class UStaticMeshComponent* Scaffold_WoodPlank_a1;                                // 0x0248 (size: 0x8)
    class UStaticMeshComponent* Scaffold_WoodPlank_a;                                 // 0x0250 (size: 0x8)
    class UChildActorComponent* PropsHall_Structure_Metalbar67;                       // 0x0258 (size: 0x8)
    class UChildActorComponent* PropsHall_Structure_Metalbar66;                       // 0x0260 (size: 0x8)
    class UChildActorComponent* PropsHall_Structure_Metalbar64;                       // 0x0268 (size: 0x8)
    class UStaticMeshComponent* Windows_130x130_02_Windows_130x130_02;                // 0x0270 (size: 0x8)
    class UChildActorComponent* WoodPlane_51;                                         // 0x0278 (size: 0x8)
    class UChildActorComponent* WoodPlane_50;                                         // 0x0280 (size: 0x8)
    class UChildActorComponent* Wood_Plank_e204;                                      // 0x0288 (size: 0x8)
    class UChildActorComponent* Wood_Plank_e203;                                      // 0x0290 (size: 0x8)
    class UChildActorComponent* Wood_Plank_e202;                                      // 0x0298 (size: 0x8)
    class UChildActorComponent* Wood_Plank_e201;                                      // 0x02A0 (size: 0x8)
    class UChildActorComponent* Wood_Plank_e200_63894;                                // 0x02A8 (size: 0x8)
    class UChildActorComponent* Wood_Plank_e199_63891;                                // 0x02B0 (size: 0x8)
    class UChildActorComponent* Wood_Plank_e198;                                      // 0x02B8 (size: 0x8)
    class UChildActorComponent* WoodPlane_49;                                         // 0x02C0 (size: 0x8)
    class UChildActorComponent* WoodPlane_48;                                         // 0x02C8 (size: 0x8)
    class UChildActorComponent* WoodPlane_47;                                         // 0x02D0 (size: 0x8)
    class UChildActorComponent* WoodPlane_46;                                         // 0x02D8 (size: 0x8)
    class UChildActorComponent* WoodPlane_45;                                         // 0x02E0 (size: 0x8)
    class UChildActorComponent* WoodPlane_63924;                                      // 0x02E8 (size: 0x8)
    class UChildActorComponent* WoodPlane_43;                                         // 0x02F0 (size: 0x8)
    class UChildActorComponent* WoodPlane_63909;                                      // 0x02F8 (size: 0x8)
    class UChildActorComponent* PropsHall_Structure_Metalbar64_64368;                 // 0x0300 (size: 0x8)
    class UChildActorComponent* Wood_Plank_e205;                                      // 0x0308 (size: 0x8)
    class UChildActorComponent* PropsHall_Structure_Metalbar62;                       // 0x0310 (size: 0x8)
    class UChildActorComponent* PropsHall_Structure_Metalbar61;                       // 0x0318 (size: 0x8)
    class UChildActorComponent* PropsHall_Structure_Metalbar60;                       // 0x0320 (size: 0x8)
    class UChildActorComponent* PropsHall_Structure_Metalbar59;                       // 0x0328 (size: 0x8)
    class UChildActorComponent* PropsHall_Structure_Metalbar58;                       // 0x0330 (size: 0x8)
    class UChildActorComponent* PropsHall_Structure_Metalbar57;                       // 0x0338 (size: 0x8)
    class UChildActorComponent* PropsHall_Structure_Metalbar56;                       // 0x0340 (size: 0x8)
    class UChildActorComponent* PropsHall_Structure_Metalbar55;                       // 0x0348 (size: 0x8)
    class UChildActorComponent* PropsHall_Structure_Metalbar54;                       // 0x0350 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_d7;                                       // 0x0358 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_d6;                                       // 0x0360 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_d4;                                       // 0x0368 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_d3_63999;                                 // 0x0370 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b6;                                       // 0x0378 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b5;                                       // 0x0380 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b4;                                       // 0x0388 (size: 0x8)
    class UChildActorComponent* Plate_Plastic_d4_69078;                               // 0x0390 (size: 0x8)
    class UChildActorComponent* Plate_Plaster_a4_69081;                               // 0x0398 (size: 0x8)
    class UChildActorComponent* PropsHall_Structure_Metalbar63;                       // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* Cube;                                                 // 0x03A8 (size: 0x8)
    class USceneComponent* SharedRoot;                                                // 0x03B0 (size: 0x8)

}; // Size: 0x3B8

#endif
