#ifndef UE4SS_SDK_SlumHouse_Balcony_Corner_OLD_HPP
#define UE4SS_SDK_SlumHouse_Balcony_Corner_OLD_HPP

class ASlumHouse_Balcony_Corner_OLD_C : public AActor
{
    class UChildActorComponent* WoodPlane91;                                          // 0x0228 (size: 0x8)
    class UChildActorComponent* WoodPlane_23;                                         // 0x0230 (size: 0x8)
    class UChildActorComponent* WoodPlane85;                                          // 0x0238 (size: 0x8)
    class UChildActorComponent* WoodPlane28;                                          // 0x0240 (size: 0x8)
    class UStaticMeshComponent* curtains01_Curtains01_06;                             // 0x0248 (size: 0x8)
    class UStaticMeshComponent* curtains01_Curtains01_05;                             // 0x0250 (size: 0x8)
    class UStaticMeshComponent* curtains01_Curtains01_04;                             // 0x0258 (size: 0x8)
    class UStaticMeshComponent* curtains01_Curtains01_03;                             // 0x0260 (size: 0x8)
    class UStaticMeshComponent* curtains01_Curtains01_02;                             // 0x0268 (size: 0x8)
    class UChildActorComponent* Wood_Plank_a30_354495;                                // 0x0270 (size: 0x8)
    class UChildActorComponent* WoodPlane90;                                          // 0x0278 (size: 0x8)
    class UChildActorComponent* WoodPlane89;                                          // 0x0280 (size: 0x8)
    class UChildActorComponent* WoodPlane88;                                          // 0x0288 (size: 0x8)
    class UChildActorComponent* WoodPlane87;                                          // 0x0290 (size: 0x8)
    class UChildActorComponent* WoodPlane86;                                          // 0x0298 (size: 0x8)
    class UChildActorComponent* WoodPlane84;                                          // 0x02A0 (size: 0x8)
    class UChildActorComponent* WoodPlane83;                                          // 0x02A8 (size: 0x8)
    class UChildActorComponent* WoodPlane82;                                          // 0x02B0 (size: 0x8)
    class UChildActorComponent* WoodPlane81;                                          // 0x02B8 (size: 0x8)
    class UChildActorComponent* WoodPlane80;                                          // 0x02C0 (size: 0x8)
    class UChildActorComponent* WoodPlane79;                                          // 0x02C8 (size: 0x8)
    class UChildActorComponent* WoodPlane78_354659;                                   // 0x02D0 (size: 0x8)
    class UChildActorComponent* WoodPlane77_354657;                                   // 0x02D8 (size: 0x8)
    class UChildActorComponent* WoodPlane76;                                          // 0x02E0 (size: 0x8)
    class UChildActorComponent* WoodPlane44;                                          // 0x02E8 (size: 0x8)
    class UChildActorComponent* WoodPlane43;                                          // 0x02F0 (size: 0x8)
    class UChildActorComponent* WoodPlane42_354533;                                   // 0x02F8 (size: 0x8)
    class UChildActorComponent* WoodPlane41;                                          // 0x0300 (size: 0x8)
    class UChildActorComponent* WoodPlane40;                                          // 0x0308 (size: 0x8)
    class UChildActorComponent* WoodPlane39;                                          // 0x0310 (size: 0x8)
    class UChildActorComponent* WoodPlane38;                                          // 0x0318 (size: 0x8)
    class UChildActorComponent* WoodPlane37;                                          // 0x0320 (size: 0x8)
    class UChildActorComponent* WoodPlane36;                                          // 0x0328 (size: 0x8)
    class UChildActorComponent* WoodPlane35;                                          // 0x0330 (size: 0x8)
    class UChildActorComponent* WoodPlane34;                                          // 0x0338 (size: 0x8)
    class UChildActorComponent* WoodPlane33;                                          // 0x0340 (size: 0x8)
    class UChildActorComponent* WoodPlane32;                                          // 0x0348 (size: 0x8)
    class UChildActorComponent* WoodPlane31;                                          // 0x0350 (size: 0x8)
    class UChildActorComponent* WoodPlane30;                                          // 0x0358 (size: 0x8)
    class UChildActorComponent* WoodPlane29;                                          // 0x0360 (size: 0x8)
    class UChildActorComponent* WoodPlane28_354481;                                   // 0x0368 (size: 0x8)
    class UChildActorComponent* WoodPlane27;                                          // 0x0370 (size: 0x8)
    class UChildActorComponent* WoodPlane26;                                          // 0x0378 (size: 0x8)
    class UChildActorComponent* WoodPlane25;                                          // 0x0380 (size: 0x8)
    class UChildActorComponent* WoodPlane24;                                          // 0x0388 (size: 0x8)
    class UChildActorComponent* WoodPlane23;                                          // 0x0390 (size: 0x8)
    class UChildActorComponent* WoodPlane_22;                                         // 0x0398 (size: 0x8)
    class UChildActorComponent* WoodPlane22_354497;                                   // 0x03A0 (size: 0x8)
    class UChildActorComponent* WoodPlane_21;                                         // 0x03A8 (size: 0x8)
    class UChildActorComponent* WoodPlane21;                                          // 0x03B0 (size: 0x8)
    class UChildActorComponent* WoodPlane20_354471;                                   // 0x03B8 (size: 0x8)
    class UChildActorComponent* WoodPlane_19;                                         // 0x03C0 (size: 0x8)
    class UChildActorComponent* WoodPlane_18;                                         // 0x03C8 (size: 0x8)
    class UChildActorComponent* WoodPlane_17;                                         // 0x03D0 (size: 0x8)
    class UChildActorComponent* WoodPlane_16;                                         // 0x03D8 (size: 0x8)
    class UChildActorComponent* WoodPlane15;                                          // 0x03E0 (size: 0x8)
    class UChildActorComponent* WoodPlane_14;                                         // 0x03E8 (size: 0x8)
    class UChildActorComponent* WoodPlane14_354499;                                   // 0x03F0 (size: 0x8)
    class UChildActorComponent* WoodPlane_13;                                         // 0x03F8 (size: 0x8)
    class UChildActorComponent* WoodPlane13;                                          // 0x0400 (size: 0x8)
    class UChildActorComponent* WoodPlane_12;                                         // 0x0408 (size: 0x8)
    class UStaticMeshComponent* Plate_Rusty_a;                                        // 0x0410 (size: 0x8)
    class UChildActorComponent* WoodPlane11;                                          // 0x0418 (size: 0x8)
    class UChildActorComponent* WoodPlane_350554;                                     // 0x0420 (size: 0x8)
    class UChildActorComponent* WoodPlane10;                                          // 0x0428 (size: 0x8)
    class UChildActorComponent* WoodPlane_9;                                          // 0x0430 (size: 0x8)
    class UChildActorComponent* WoodPlane9;                                           // 0x0438 (size: 0x8)
    class UChildActorComponent* WoodPlane_8;                                          // 0x0440 (size: 0x8)
    class UChildActorComponent* WoodPlane08_354459;                                   // 0x0448 (size: 0x8)
    class UChildActorComponent* WoodPlane_7;                                          // 0x0450 (size: 0x8)
    class UChildActorComponent* WoodPlane_350510;                                     // 0x0458 (size: 0x8)
    class UChildActorComponent* WoodPlane_5;                                          // 0x0460 (size: 0x8)
    class UChildActorComponent* WoodPlane_4;                                          // 0x0468 (size: 0x8)
    class UChildActorComponent* WoodPlane_3;                                          // 0x0470 (size: 0x8)
    class UChildActorComponent* WoodPlane_2;                                          // 0x0478 (size: 0x8)
    class UChildActorComponent* WoodPlane_01_350501;                                  // 0x0480 (size: 0x8)
    class UChildActorComponent* Scaffold_WoodPlank_e_354492;                          // 0x0488 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_c12_354524;                               // 0x0490 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b54;                                      // 0x0498 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b53;                                      // 0x04A0 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b52;                                      // 0x04A8 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b31_354661;                               // 0x04B0 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b25;                                      // 0x04B8 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b24;                                      // 0x04C0 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b22;                                      // 0x04C8 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b21;                                      // 0x04D0 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b20;                                      // 0x04D8 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b19;                                      // 0x04E0 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b18;                                      // 0x04E8 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b17;                                      // 0x04F0 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b16;                                      // 0x04F8 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b15;                                      // 0x0500 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b14;                                      // 0x0508 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b13;                                      // 0x0510 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b12;                                      // 0x0518 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b11_350540;                               // 0x0520 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b10_354452;                               // 0x0528 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b9;                                       // 0x0530 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b8;                                       // 0x0538 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b7;                                       // 0x0540 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b6;                                       // 0x0548 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b5;                                       // 0x0550 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b4;                                       // 0x0558 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b3_350522;                                // 0x0560 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_a3_354518;                                // 0x0568 (size: 0x8)
    class UChildActorComponent* Plate_Plastic_c3_354527;                              // 0x0570 (size: 0x8)
    class UChildActorComponent* Plate_Plastic_a5_354456;                              // 0x0578 (size: 0x8)
    class UChildActorComponent* Plate_Plaster_d6_354521;                              // 0x0580 (size: 0x8)
    class UChildActorComponent* BP_windows6;                                          // 0x0588 (size: 0x8)
    class UChildActorComponent* BP_windows5;                                          // 0x0590 (size: 0x8)
    class UChildActorComponent* BP_windows4;                                          // 0x0598 (size: 0x8)
    class UChildActorComponent* BP_windows3;                                          // 0x05A0 (size: 0x8)
    class UChildActorComponent* BP_windows02_2;                                       // 0x05A8 (size: 0x8)
    class UChildActorComponent* WoodPlane12_354465;                                   // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* Cube;                                                 // 0x05B8 (size: 0x8)
    class USceneComponent* SharedRoot;                                                // 0x05C0 (size: 0x8)

}; // Size: 0x5C8

#endif
