#ifndef UE4SS_SDK_550_Roof_Low_Wall_HPP
#define UE4SS_SDK_550_Roof_Low_Wall_HPP

class A550_Roof_Low_Wall_C : public AActor
{
    class UBoxComponent* Box4;                                                        // 0x0228 (size: 0x8)
    class UBoxComponent* Box3;                                                        // 0x0230 (size: 0x8)
    class UBoxComponent* Box2;                                                        // 0x0238 (size: 0x8)
    class UBoxComponent* Box1;                                                        // 0x0240 (size: 0x8)
    class UBoxComponent* Box;                                                         // 0x0248 (size: 0x8)
    class UStaticMeshComponent* 550_Roof_Low_Wall_Chamfer;                            // 0x0250 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0258 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0260 (size: 0x8)

}; // Size: 0x268

#endif
