#ifndef UE4SS_SDK_bamboo_echelle_HPP
#define UE4SS_SDK_bamboo_echelle_HPP

class Abamboo_echelle_C : public AActor
{
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0228 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0230 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0238 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0240 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0248 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0250 (size: 0x8)
    class UStaticMeshComponent* bamboo_bamboo01;                                      // 0x0258 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0260 (size: 0x8)

}; // Size: 0x268

#endif
