#ifndef UE4SS_SDK_BP_Couch_01_HPP
#define UE4SS_SDK_BP_Couch_01_HPP

class ABP_Couch_01_C : public AActor
{
    class UChildActorComponent* BP_SpeedModifier_Zone;                                // 0x0228 (size: 0x8)
    class USplineRailComponent* SplineRail1;                                          // 0x0230 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x0238 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x0240 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0248 (size: 0x8)
    class USplineRailComponent* SplineRail;                                           // 0x0250 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x0258 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0260 (size: 0x8)

}; // Size: 0x268

#endif
