#ifndef UE4SS_SDK_BP_RotatingPlazaTower_A_HPP
#define UE4SS_SDK_BP_RotatingPlazaTower_A_HPP

class ABP_RotatingPlazaTower_A_C : public ABP_RotatingPlazaTower_C
{
    class UChildActorComponent* SpotLight7;                                           // 0x0260 (size: 0x8)
    class UChildActorComponent* SpotLight10;                                          // 0x0268 (size: 0x8)
    class UStaticMeshComponent* Light09;                                              // 0x0270 (size: 0x8)
    class UChildActorComponent* SpotLight9;                                           // 0x0278 (size: 0x8)
    class UStaticMeshComponent* Light08;                                              // 0x0280 (size: 0x8)
    class UChildActorComponent* SpotLight8;                                           // 0x0288 (size: 0x8)
    class UStaticMeshComponent* Light07;                                              // 0x0290 (size: 0x8)
    class UStaticMeshComponent* Light02;                                              // 0x0298 (size: 0x8)
    class UChildActorComponent* SpotLight6;                                           // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* Light05;                                              // 0x02A8 (size: 0x8)
    class UChildActorComponent* SpotLight5;                                           // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* Light04;                                              // 0x02B8 (size: 0x8)
    class UChildActorComponent* SpotLight4;                                           // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* Light03;                                              // 0x02C8 (size: 0x8)
    class UChildActorComponent* SpotLight3;                                           // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* Light06;                                              // 0x02D8 (size: 0x8)

}; // Size: 0x2E0

#endif
