#ifndef UE4SS_SDK_BP_Sofa_01_HPP
#define UE4SS_SDK_BP_Sofa_01_HPP

class ABP_Sofa_01_C : public AActor
{
    class USplineRailComponent* SplineRail1;                                          // 0x0228 (size: 0x8)
    class UStaticMeshComponent* Cube3;                                                // 0x0230 (size: 0x8)
    class UChildActorComponent* BP_SpeedModifier_Zone;                                // 0x0238 (size: 0x8)
    class USplineRailComponent* SplineRail;                                           // 0x0240 (size: 0x8)
    class UStaticMeshComponent* Cube2;                                                // 0x0248 (size: 0x8)
    class UStaticMeshComponent* Cube1;                                                // 0x0250 (size: 0x8)
    class UStaticMeshComponent* Cube;                                                 // 0x0258 (size: 0x8)
    class UStaticMeshComponent* Sofa_01;                                              // 0x0260 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0268 (size: 0x8)

}; // Size: 0x270

#endif
