#ifndef UE4SS_SDK_BP_Sofa_02_HPP
#define UE4SS_SDK_BP_Sofa_02_HPP

class ABP_Sofa_02_C : public AActor
{
    class UStreamingComponent* Streaming;                                             // 0x0228 (size: 0x8)
    class USaveComponent* Save;                                                       // 0x0230 (size: 0x8)
    class USplineRailComponent* BanketSplineRail;                                     // 0x0238 (size: 0x8)
    class UChildActorComponent* BP_SpeedModifier_Zone;                                // 0x0240 (size: 0x8)
    class USplineRailComponent* SplineRail2;                                          // 0x0248 (size: 0x8)
    class USplineRailComponent* SplineRail1;                                          // 0x0250 (size: 0x8)
    class USplineRailComponent* SplineRail;                                           // 0x0258 (size: 0x8)
    class UStaticMeshComponent* Cube10;                                               // 0x0260 (size: 0x8)
    class UStaticMeshComponent* Cube9;                                                // 0x0268 (size: 0x8)
    class UStaticMeshComponent* Cube8;                                                // 0x0270 (size: 0x8)
    class UStaticMeshComponent* Cube4;                                                // 0x0278 (size: 0x8)
    class UStaticMeshComponent* Cube2;                                                // 0x0280 (size: 0x8)
    class UStaticMeshComponent* Cube3;                                                // 0x0288 (size: 0x8)
    class UStaticMeshComponent* Cube1;                                                // 0x0290 (size: 0x8)
    class UStaticMeshComponent* Sofa_01;                                              // 0x0298 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x02A0 (size: 0x8)

}; // Size: 0x2A8

#endif
