#ifndef UE4SS_SDK_BP_Shop_struct_Bamboo1_HPP
#define UE4SS_SDK_BP_Shop_struct_Bamboo1_HPP

class ABP_Shop_struct_Bamboo1_C : public AActor
{
    class UStaticMeshComponent* StaticMesh12;                                         // 0x0228 (size: 0x8)
    class UStaticMeshComponent* WoodPlane00;                                          // 0x0230 (size: 0x8)
    class UStaticMeshComponent* WoodPlane02;                                          // 0x0238 (size: 0x8)
    class UStaticMeshComponent* WoodPlane03;                                          // 0x0240 (size: 0x8)
    class UStaticMeshComponent* WoodPlane04;                                          // 0x0248 (size: 0x8)
    class UStaticMeshComponent* StaticMesh11;                                         // 0x0250 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x0258 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x0260 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x0268 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x0270 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0278 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0280 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0288 (size: 0x8)

}; // Size: 0x290

#endif
