#ifndef UE4SS_SDK_FlowerPotGroup_3_HPP
#define UE4SS_SDK_FlowerPotGroup_3_HPP

class AFlowerPotGroup_3_C : public AActor
{
    class UStaticMeshComponent* EmptyFlowerPot_03;                                    // 0x0228 (size: 0x8)
    class UStaticMeshComponent* EmptyFlowerPot_04;                                    // 0x0230 (size: 0x8)
    class UStaticMeshComponent* FlowerPot_02;                                         // 0x0238 (size: 0x8)
    class UStaticMeshComponent* FlowerPot_05;                                         // 0x0240 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent01;                                // 0x0248 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent02;                                // 0x0250 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0;                                 // 0x0258 (size: 0x8)
    class USceneComponent* Scene4;                                                    // 0x0260 (size: 0x8)

}; // Size: 0x268

#endif
