#ifndef UE4SS_SDK_G_Plasticbox_03_HPP
#define UE4SS_SDK_G_Plasticbox_03_HPP

class AG_Plasticbox_03_C : public AActor
{
    class USplineRailComponent* SplineRail;                                           // 0x0228 (size: 0x8)
    class UStaticMeshComponent* Cube;                                                 // 0x0230 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0238 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0240 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0248 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0250 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0258 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent05;                                // 0x0260 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent04;                                // 0x0268 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent03;                                // 0x0270 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent02;                                // 0x0278 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent01;                                // 0x0280 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0;                                 // 0x0288 (size: 0x8)
    class USceneComponent* SharedRoot;                                                // 0x0290 (size: 0x8)

}; // Size: 0x298

#endif
