#ifndef UE4SS_SDK_G_Stairs_type_03_HPP
#define UE4SS_SDK_G_Stairs_type_03_HPP

class AG_Stairs_type_03_C : public AActor
{
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0228 (size: 0x8)
    class UStaticMeshComponent* Cube;                                                 // 0x0230 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0238 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent022;                               // 0x0240 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent021;                               // 0x0248 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent020;                               // 0x0250 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent019;                               // 0x0258 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent018;                               // 0x0260 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent017;                               // 0x0268 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent016;                               // 0x0270 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent015;                               // 0x0278 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent014;                               // 0x0280 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent013;                               // 0x0288 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent012;                               // 0x0290 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent011;                               // 0x0298 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent010;                               // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent09;                                // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent08;                                // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent07;                                // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent06;                                // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent05;                                // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent04;                                // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent03;                                // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent02;                                // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent01;                                // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0;                                 // 0x02F0 (size: 0x8)
    class USceneComponent* SharedRoot;                                                // 0x02F8 (size: 0x8)

}; // Size: 0x300

#endif
