#ifndef UE4SS_SDK_Scaffoldings_blocker_01_HPP
#define UE4SS_SDK_Scaffoldings_blocker_01_HPP

class AScaffoldings_blocker_01_C : public AActor
{
    class UStaticMeshComponent* Cardboard_3;                                          // 0x0228 (size: 0x8)
    class UStaticMeshComponent* Cardboard_Box_B;                                      // 0x0230 (size: 0x8)
    class UStaticMeshComponent* Cardboard_2;                                          // 0x0238 (size: 0x8)
    class UStaticMeshComponent* Cardboard_Box_B1;                                     // 0x0240 (size: 0x8)
    class UStaticMeshComponent* Cardboard_Box_B2;                                     // 0x0248 (size: 0x8)
    class UStaticMeshComponent* Plastic_Bag_b;                                        // 0x0250 (size: 0x8)
    class UStaticMeshComponent* Plastic_Bag_b1;                                       // 0x0258 (size: 0x8)
    class UStaticMeshComponent* Plastic_Bag_a;                                        // 0x0260 (size: 0x8)
    class UStaticMeshComponent* Cardboard;                                            // 0x0268 (size: 0x8)
    class UStaticMeshComponent* Cardboard_0;                                          // 0x0270 (size: 0x8)
    class UBoxComponent* Box;                                                         // 0x0278 (size: 0x8)
    class USceneComponent* SharedRoot;                                                // 0x0280 (size: 0x8)

}; // Size: 0x288

#endif
