#ifndef UE4SS_SDK_Scaffoldings_blocker_03_HPP
#define UE4SS_SDK_Scaffoldings_blocker_03_HPP

class AScaffoldings_blocker_03_C : public AActor
{
    class UStaticMeshComponent* TrashContainerw_close;                                // 0x0228 (size: 0x8)
    class UStaticMeshComponent* Cardboard_2;                                          // 0x0230 (size: 0x8)
    class UStaticMeshComponent* Cardboard_1;                                          // 0x0238 (size: 0x8)
    class UStaticMeshComponent* PropsGround01_12;                                     // 0x0240 (size: 0x8)
    class UStaticMeshComponent* Plastic_Bucket_Big4;                                  // 0x0248 (size: 0x8)
    class UStaticMeshComponent* Cardboard_0;                                          // 0x0250 (size: 0x8)
    class UStaticMeshComponent* Plastic_Bucket_Small;                                 // 0x0258 (size: 0x8)
    class UStaticMeshComponent* Plastic_Bucket_Big;                                   // 0x0260 (size: 0x8)
    class UStaticMeshComponent* Plastic_Bucket_Big1;                                  // 0x0268 (size: 0x8)
    class UStaticMeshComponent* PropsGround01_02;                                     // 0x0270 (size: 0x8)
    class UStaticMeshComponent* PropsGround_carton_01;                                // 0x0278 (size: 0x8)
    class UStaticMeshComponent* PropsGround_TrashBag_00;                              // 0x0280 (size: 0x8)
    class UStaticMeshComponent* PropsGround_carton_4;                                 // 0x0288 (size: 0x8)
    class UBoxComponent* Box;                                                         // 0x0290 (size: 0x8)
    class USceneComponent* SharedRoot;                                                // 0x0298 (size: 0x8)

}; // Size: 0x2A0

#endif
