#ifndef UE4SS_SDK_SlumHouse_Balcony_03_OLD_HPP
#define UE4SS_SDK_SlumHouse_Balcony_03_OLD_HPP

class ASlumHouse_Balcony_03_OLD_C : public AActor
{
    class UChildActorComponent* WoodPlane103;                                         // 0x0228 (size: 0x8)
    class UStaticMeshComponent* curtains01_Curtains01_03;                             // 0x0230 (size: 0x8)
    class UStaticMeshComponent* curtains01_Curtains01_02;                             // 0x0238 (size: 0x8)
    class UStaticMeshComponent* curtains01_Curtains01_01;                             // 0x0240 (size: 0x8)
    class UBoxComponent* Box;                                                         // 0x0248 (size: 0x8)
    class UStaticMeshComponent* Porchroof_box_small;                                  // 0x0250 (size: 0x8)
    class UChildActorComponent* WoodPlane127;                                         // 0x0258 (size: 0x8)
    class UChildActorComponent* WoodPlane126;                                         // 0x0260 (size: 0x8)
    class UChildActorComponent* WoodPlane125;                                         // 0x0268 (size: 0x8)
    class UChildActorComponent* WoodPlane124;                                         // 0x0270 (size: 0x8)
    class UChildActorComponent* WoodPlane123;                                         // 0x0278 (size: 0x8)
    class UChildActorComponent* WoodPlane122;                                         // 0x0280 (size: 0x8)
    class UChildActorComponent* WoodPlane121;                                         // 0x0288 (size: 0x8)
    class UChildActorComponent* WoodPlane120;                                         // 0x0290 (size: 0x8)
    class UChildActorComponent* WoodPlane119;                                         // 0x0298 (size: 0x8)
    class UChildActorComponent* WoodPlane118;                                         // 0x02A0 (size: 0x8)
    class UChildActorComponent* WoodPlane117;                                         // 0x02A8 (size: 0x8)
    class UChildActorComponent* WoodPlane116;                                         // 0x02B0 (size: 0x8)
    class UChildActorComponent* WoodPlane105_354728;                                  // 0x02B8 (size: 0x8)
    class UChildActorComponent* WoodPlane104_354726;                                  // 0x02C0 (size: 0x8)
    class UChildActorComponent* WoodPlane102;                                         // 0x02C8 (size: 0x8)
    class UChildActorComponent* WoodPlane101;                                         // 0x02D0 (size: 0x8)
    class UChildActorComponent* WoodPlane100;                                         // 0x02D8 (size: 0x8)
    class UChildActorComponent* WoodPlane99;                                          // 0x02E0 (size: 0x8)
    class UChildActorComponent* WoodPlane98;                                          // 0x02E8 (size: 0x8)
    class UChildActorComponent* WoodPlane97;                                          // 0x02F0 (size: 0x8)
    class UChildActorComponent* WoodPlane96;                                          // 0x02F8 (size: 0x8)
    class UChildActorComponent* WoodPlane95;                                          // 0x0300 (size: 0x8)
    class UChildActorComponent* WoodPlane94;                                          // 0x0308 (size: 0x8)
    class UStaticMeshComponent* Plate_Rusty_c;                                        // 0x0310 (size: 0x8)
    class UChildActorComponent* WoodPlane_55;                                         // 0x0318 (size: 0x8)
    class UChildActorComponent* WoodPlane_54;                                         // 0x0320 (size: 0x8)
    class UChildActorComponent* WoodPlane_51;                                         // 0x0328 (size: 0x8)
    class UChildActorComponent* WoodPlane_50;                                         // 0x0330 (size: 0x8)
    class UChildActorComponent* Tunnel_8m_end_grid_354719;                            // 0x0338 (size: 0x8)
    class UChildActorComponent* Scaffold_WoodPlank_a45;                               // 0x0340 (size: 0x8)
    class UChildActorComponent* Scaffold_WoodPlank_a44;                               // 0x0348 (size: 0x8)
    class UChildActorComponent* Scaffold_WoodPlank_a43;                               // 0x0350 (size: 0x8)
    class UChildActorComponent* Scaffold_WoodPlank_a42;                               // 0x0358 (size: 0x8)
    class UChildActorComponent* Scaffold_WoodPlank_a41_354722;                        // 0x0360 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b60;                                      // 0x0368 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b59;                                      // 0x0370 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b58;                                      // 0x0378 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b51;                                      // 0x0380 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b50;                                      // 0x0388 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b49;                                      // 0x0390 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b48;                                      // 0x0398 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b47;                                      // 0x03A0 (size: 0x8)
    class UChildActorComponent* Plate_Rusty_b46;                                      // 0x03A8 (size: 0x8)
    class UChildActorComponent* BP_windows14;                                         // 0x03B0 (size: 0x8)
    class UChildActorComponent* BP_windows13;                                         // 0x03B8 (size: 0x8)
    class UChildActorComponent* BP_windows12;                                         // 0x03C0 (size: 0x8)
    class UChildActorComponent* WoodPlane_354732;                                     // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* Cube;                                                 // 0x03D0 (size: 0x8)
    class USceneComponent* SharedRoot;                                                // 0x03D8 (size: 0x8)

}; // Size: 0x3E0

#endif
